[Killed] ConditionalExpression
src/modules/payments/domain.ts:126:7
 ): void {
   assertThreeWayMatchPresent(poRef, grnRef);
   const { poAmountMinor, grnAmountMinor, invoiceMinor } = legs;
-  if (poAmountMinor <= 0n || grnAmountMinor <= 0n || invoiceMinor <= 0n) {
+  if (false || invoiceMinor <= 0n) {
     throw new DomainError(
       "THREE_WAY_MATCH_FAILED",
killedBy: L10 payments — all three legs must be positive rejects when po is zero
statusReason: expected [Function] to throw error matching /THREE_WAY_MATCH_FAILED/ but got '[GRN_EXCEEDS_PO] received value 10000…'
