[Killed] UnaryOperator
src/modules/payroll/domain.ts:113:34
 
 /** Round a paise amount to the nearest whole rupee (round-half-up). */
 export function roundRupee(x: bigint): bigint {
-  if (x < 0n) return -roundRupee(-x);
+  if (x < 0n) return -roundRupee(+x);
   return ((x + 50n) / 100n) * 100n;
 }
killedBy: L10 payroll — roundRupee is round-half-up and sign-symmetric negative amounts round symmetrically
statusReason: Cannot convert a BigInt value to a number

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:113:7
 
 /** Round a paise amount to the nearest whole rupee (round-half-up). */
 export function roundRupee(x: bigint): bigint {
-  if (x < 0n) return -roundRupee(-x);
+  if (false) return -roundRupee(-x);
   return ((x + 50n) / 100n) * 100n;
 }
killedBy: L10 payroll — roundRupee is round-half-up and sign-symmetric negative amounts round symmetrically
statusReason: expected 0n to be -100n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:114:12
 /** Round a paise amount to the nearest whole rupee (round-half-up). */
 export function roundRupee(x: bigint): bigint {
   if (x < 0n) return -roundRupee(-x);
-  return ((x + 50n) / 100n) * 100n;
+  return ((x - 50n) / 100n) * 100n;
 }
 
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is present and exact when the rate is set
statusReason: expected 2649900n to be 2650000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:123:16
 
 /** 7th CPC HRA slab % by city class, escalating with DA threshold (50% / 100%). */
 export function hraSlabPct(cityClass: CityClass, daRateBps: bigint): bigint {
-  const tier = daRateBps >= 10000n ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
+  const tier = daRateBps < 10000n ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
   const table: Record<CityClass, [bigint, bigint, bigint]> = {
     X: [24n, 27n, 30n],
killedBy: L10 payroll — HRA slab by city class and DA tier (vs golden fixture) X at DA 0% -> 24%
statusReason: expected 30n to be 24n // Object.is equality

[Killed] ArrayDeclaration
src/modules/payroll/domain.ts:125:8
 export function hraSlabPct(cityClass: CityClass, daRateBps: bigint): bigint {
   const tier = daRateBps >= 10000n ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
   const table: Record<CityClass, [bigint, bigint, bigint]> = {
-    X: [24n, 27n, 30n],
+    X: [],
     Y: [16n, 18n, 20n],
     Z: [8n, 9n, 10n],
killedBy: L10 payroll — zero-valued lines are omitted from the slip HRA line is absent when the city slab yields 0 (basic 0)
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArrayDeclaration
src/modules/payroll/domain.ts:127:8
   const table: Record<CityClass, [bigint, bigint, bigint]> = {
     X: [24n, 27n, 30n],
     Y: [16n, 18n, 20n],
-    Z: [8n, 9n, 10n],
+    Z: [],
   };
   return table[cityClass][tier];
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArrayDeclaration
src/modules/payroll/domain.ts:138:18
     daRateBps = 0n,
     cityClass = "X",
     ptMinor = 0n,
-    components = [],
+    components = ["Stryker was here"],
     rawComponents = [],
     pensionScheme = "EPF",
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[NoCoverage] StringLiteral
src/modules/payroll/domain.ts:141:17
     components = [],
     rawComponents = [],
     pensionScheme = "EPF",
-    taxRegime = "new",
+    taxRegime = "",
     fyStartYear = 2025,
     declaration = {},

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:158:7
 
   // Dearness Allowance = DA% of basic.
   const daMinor = roundRupee((basicMinor * daRateBps) / 10000n);
-  if (daMinor > 0n) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
+  if (true) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
 
   // HRA = city-class slab % of basic (escalates with DA threshold).
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: expected [ 'BASIC', 'DA', 'HRA' ] to not include 'DA'

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:158:7
 
   // Dearness Allowance = DA% of basic.
   const daMinor = roundRupee((basicMinor * daRateBps) / 10000n);
-  if (daMinor > 0n) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
+  if (false) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
 
   // HRA = city-class slab % of basic (escalates with DA threshold).
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is present and exact when the rate is set
statusReason: expected undefined to be 2650000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:165:34
   if (hraMinor > 0n) earnings.push({ code: "HRA", name: "House Rent Allowance", type: "earning", amountMinor: hraMinor });
 
   // Evaluate remaining structure components (skip BASIC/DA/HRA — handled above).
-  for (const c of rawComponents) {
-    if (["BASIC", "DA", "HRA"].includes(c.code)) continue;
-    const amt = c.pctOfBasic != null && c.pctOfBasic > 0
-      ? pct(basicMinor, BigInt(Math.round(c.pctOfBasic)))
-      : roundRupee(c.fixedMinor ?? 0n);
-    if (amt === 0n) continue;
-    (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
-  }
+  for (const c of rawComponents) {}
 
   // Ad-hoc components (LOP, EMI, arrears, reimbursements).
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:167:17
   // Evaluate remaining structure components (skip BASIC/DA/HRA — handled above).
   for (const c of rawComponents) {
     if (["BASIC", "DA", "HRA"].includes(c.code)) continue;
-    const amt = c.pctOfBasic != null && c.pctOfBasic > 0
+    const amt = c.pctOfBasic == null && c.pctOfBasic > 0
       ? pct(basicMinor, BigInt(Math.round(c.pctOfBasic)))
       : roundRupee(c.fixedMinor ?? 0n);
killedBy: L10 payroll — gross/deduction/net conservation pctOfBasic takes precedence over fixedMinor when both are present
statusReason: expected 1000000n to be 500000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:167:41
   // Evaluate remaining structure components (skip BASIC/DA/HRA — handled above).
   for (const c of rawComponents) {
     if (["BASIC", "DA", "HRA"].includes(c.code)) continue;
-    const amt = c.pctOfBasic != null && c.pctOfBasic > 0
+    const amt = c.pctOfBasic != null && c.pctOfBasic >= 0
       ? pct(basicMinor, BigInt(Math.round(c.pctOfBasic)))
       : roundRupee(c.fixedMinor ?? 0n);
killedBy: L10 payroll — gross/deduction/net conservation fixedMinor is used when pctOfBasic is absent or zero
statusReason: expected undefined to be 111100n // Object.is equality

[Killed] LogicalOperator
src/modules/payroll/domain.ts:169:20
     if (["BASIC", "DA", "HRA"].includes(c.code)) continue;
     const amt = c.pctOfBasic != null && c.pctOfBasic > 0
       ? pct(basicMinor, BigInt(Math.round(c.pctOfBasic)))
-      : roundRupee(c.fixedMinor ?? 0n);
+      : roundRupee(c.fixedMinor && 0n);
     if (amt === 0n) continue;
     (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:171:6
       ? pct(basicMinor, BigInt(Math.round(c.pctOfBasic)))
       : roundRupee(c.fixedMinor ?? 0n);
     if (amt === 0n) continue;
-    (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
+    (true ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
   }
 
killedBy: L10 payroll — gross/deduction/net conservation raw components route to earnings or deductions by type
statusReason: expected [] to include 'SOCIETY'

[Killed] BlockStatement
src/modules/payroll/domain.ts:187:32
   let pfEmployeeMinor = 0n, pfEmployerMinor = 0n, epsMinor = 0n, epfEmployerMinor = 0n;
   let gpfMinor = 0n, npsEmployeeMinor = 0n, npsEmployerMinor = 0n;
 
-  if (pensionScheme === "GPF") {
-    gpfMinor = pct(pensionBase, GPF_PCT);
-  } else if (pensionScheme === "NPS") {
+  if (pensionScheme === "GPF") {} else if (pensionScheme === "NPS") {
     npsEmployeeMinor = pct(pensionBase, NPS_EMP_PCT);
     npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
killedBy: payroll/domain — computeSlip() GPF GPF = 10% of basic+DA
statusReason: expected 0n to be 750000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:189:39
 
   if (pensionScheme === "GPF") {
     gpfMinor = pct(pensionBase, GPF_PCT);
-  } else if (pensionScheme === "NPS") {
-    npsEmployeeMinor = pct(pensionBase, NPS_EMP_PCT);
-    npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
-  } else {
+  } else if (pensionScheme === "NPS") {} else {
     const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
killedBy: payroll/domain — computeSlip() NPS NPS employee = 10%, employer = 14%
statusReason: expected 0n to be 750000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:192:10
   } else if (pensionScheme === "NPS") {
     npsEmployeeMinor = pct(pensionBase, NPS_EMP_PCT);
     npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
-  } else {
-    const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
-    pfEmployeeMinor = pct(pfWage, PF_PCT);
-    pfEmployerMinor = pct(pfWage, PF_PCT);
-    const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
-    epsMinor        = roundRupee((epsWage * 833n) / 10000n);
-    if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;
-    epfEmployerMinor = pfEmployerMinor - epsMinor;
-  }
+  } else {}
 
   const esiMinor         = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
killedBy: payroll/domain — computeSlip() EPF EPF employee PF is capped at 12% of ₹15K
statusReason: expected 0n to be 180000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:193:23
     npsEmployeeMinor = pct(pensionBase, NPS_EMP_PCT);
     npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
   } else {
-    const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
+    const pfWage    = false ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
killedBy: payroll/domain — computeSlip() EPF EPF employee PF is capped at 12% of ₹15K
statusReason: expected 1008000n to be 180000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:193:23
     npsEmployeeMinor = pct(pensionBase, NPS_EMP_PCT);
     npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
   } else {
-    const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
+    const pfWage    = pensionBase <= PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
killedBy: payroll/domain — computeSlip() EPF EPF employee PF is capped at 12% of ₹15K
statusReason: expected 1008000n to be 180000n // Object.is equality

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:196:23
     const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
-    const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
+    const epsWage   = true ? PF_WAGE_CAP : pensionBase;
     epsMinor        = roundRupee((epsWage * 833n) / 10000n);
     if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;

[Survived] EqualityOperator
src/modules/payroll/domain.ts:196:23
     const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
-    const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
+    const epsWage   = pensionBase <= PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     epsMinor        = roundRupee((epsWage * 833n) / 10000n);
     if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:202:63
     epfEmployerMinor = pfEmployerMinor - epsMinor;
   }
 
-  const esiMinor         = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
+  const esiMinor         = grossMinor <= ESI_CAP ? roundRupee(grossMinor * 75n * 10000n) : 0n;
   const esiEmployerMinor = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
 
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employee ESI is 0.75% of gross when gross <= cap
statusReason: expected 810000000000n to be 8100n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:202:28
     epfEmployerMinor = pfEmployerMinor - epsMinor;
   }
 
-  const esiMinor         = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
+  const esiMinor         = true ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
   const esiEmployerMinor = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
 
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling ESI is zero one paise above the cap
statusReason: expected 15800n to be 0n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:203:28
   }
 
   const esiMinor         = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
-  const esiEmployerMinor = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
+  const esiEmployerMinor = grossMinor > ESI_CAP ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
 
   const pt = roundRupee(ptMinor);
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employer ESI is 3.25% of gross when gross <= cap
statusReason: expected 0n to be 35100n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:203:64
   }
 
   const esiMinor         = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
-  const esiEmployerMinor = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
+  const esiEmployerMinor = grossMinor <= ESI_CAP ? roundRupee((grossMinor / 325n) / 10000n) : 0n;
 
   const pt = roundRupee(ptMinor);
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employer ESI is 3.25% of gross when gross <= cap
statusReason: expected 0n to be 35100n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:206:7
   const esiEmployerMinor = grossMinor <= ESI_CAP ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
 
   const pt = roundRupee(ptMinor);
-  if (pt > 0n) deductions.push({ code: "PT", name: "Professional Tax", type: "deduction", amountMinor: pt });
+  if (true) deductions.push({ code: "PT", name: "Professional Tax", type: "deduction", amountMinor: pt });
 
   // Monthly TDS (Sec 192) on real annual TAXABLE income: regime-aware, with
killedBy: L10 payroll — professional tax line PT line is omitted when ptMinor is 0
statusReason: expected [ 'PT' ] to not include 'PT'

[Killed] EqualityOperator
src/modules/payroll/domain.ts:220:7
   const otherSrcMinor   = declaration.otherSourcesIncomeMinor ?? 0n;
   const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
   let annualTaxableMinor: bigint;
-  if (taxRegime === "old") {
+  if (taxRegime !== "old") {
     const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
     const hraReceivedAnnual = hraMinor * 12n;
killedBy: L10 payroll — declared extra income raises annual taxable income annual gross is 12x the monthly gross (not a division)
statusReason: expected 59800000n to be 57300000n // Object.is equality

[Survived] EqualityOperator
src/modules/payroll/domain.ts:224:89
     const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
     const hraReceivedAnnual = hraMinor * 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
-    const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
+    const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass !== "X");
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;

[Killed] LogicalOperator
src/modules/payroll/domain.ts:225:18
     const hraReceivedAnnual = hraMinor * 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
-    const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
+    const d80c = declaration.ded80cMinor && 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:226:62
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
-    const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
+    const d80d = declaration.ded80dMinor ?? 0n; const c80d = false ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
     annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
killedBy: L10 payroll — old regime deductions (previously uncovered) 80D reduces taxable income and is capped at Rs 75,000
statusReason: expected 19400000n to be 61900000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:228:26
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
-    annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
+    annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c + c80d - other - pt * 12n - ltcExemptTotalMinor;
   } else {
     annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
killedBy: L10 payroll — old regime deductions (previously uncovered) 80D reduces taxable income and is capped at Rs 75,000
statusReason: expected 76900000n to be 61900000n // Object.is equality

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:236:8
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
   const tdsMinor = monthsRemaining != null
     ? trueUpTdsMinor(annualTaxMinor, tdsYtdMinor ?? 0n, monthsRemaining)         // Sec 192 true-up
-    : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
+    : (annualTaxMinor / 100n * 12n) * 100n;                                       // flat /12 fallback
 
   // Statutory pension/insurance/tax deductions are never floored.

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:239:31
     : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
 
   // Statutory pension/insurance/tax deductions are never floored.
-  const statutoryDeductions = pfEmployeeMinor + esiMinor + tdsMinor + gpfMinor + npsEmployeeMinor;
+  const statutoryDeductions = pfEmployeeMinor + esiMinor + tdsMinor - gpfMinor + npsEmployeeMinor;
 
   // Split ad-hoc deductions into recovery (floor-capped) and fixed (e.g. PT, and

[Killed] EqualityOperator
src/modules/payroll/domain.ts:254:25
   // keeping net at or above the protected floor.
   const nonRecovery   = statutoryDeductions + fixedAdHoc;
   const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
-  const recoveryCap   = headroom < 0n ? 0n : headroom;
+  const recoveryCap   = headroom >= 0n ? 0n : headroom;
   const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
   const recoveryCarryForwardMinor = recoveryRequested - recoveryApplied;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: expected 100000n to be 0n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:255:27
   const nonRecovery   = statutoryDeductions + fixedAdHoc;
   const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
   const recoveryCap   = headroom < 0n ? 0n : headroom;
-  const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
+  const recoveryApplied = false ? recoveryCap : recoveryRequested;
   const recoveryCarryForwardMinor = recoveryRequested - recoveryApplied;
 
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/modules/payroll/domain.ts:260:41
 
   // If recovery was capped, scale down the recovery deduction line items so the
   // persisted slip reflects what was actually withheld (carry the remainder).
-  if (recoveryCarryForwardMinor > 0n && recoveryRequested > 0n) {
+  if (recoveryCarryForwardMinor > 0n && recoveryRequested <= 0n) {
     let remainingToTrim = recoveryCarryForwardMinor;
     // Trim from the largest recovery lines first (deterministic by amount desc).
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 7220000n to be 6220000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:273:54
       remainingToTrim -= trim;
     }
     // Drop fully-trimmed recovery lines.
-    for (let i = deductions.length - 1; i >= 0; i--) {
-      const d = deductions[i]!;
-      if (RECOVERY_CODES.has(d.code) && d.amountMinor === 0n) deductions.splice(i, 1);
-    }
+    for (let i = deductions.length - 1; i >= 0; i--) {}
   }
 
killedBy: L10 payroll — protected net floor caps recovery and carries the rest a fully-trimmed recovery line is dropped from the slip
statusReason: expected [ 'LOAN_EMI' ] to not include 'LOAN_EMI'

[Killed] UpdateOperator
src/modules/payroll/domain.ts:273:49
       remainingToTrim -= trim;
     }
     // Drop fully-trimmed recovery lines.
-    for (let i = deductions.length - 1; i >= 0; i--) {
+    for (let i = deductions.length - 1; i >= 0; i++) {
       const d = deductions[i]!;
       if (RECOVERY_CODES.has(d.code) && d.amountMinor === 0n) deductions.splice(i, 1);
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] LogicalOperator
src/modules/payroll/domain.ts:275:11
     // Drop fully-trimmed recovery lines.
     for (let i = deductions.length - 1; i >= 0; i--) {
       const d = deductions[i]!;
-      if (RECOVERY_CODES.has(d.code) && d.amountMinor === 0n) deductions.splice(i, 1);
+      if (RECOVERY_CODES.has(d.code) || d.amountMinor === 0n) deductions.splice(i, 1);
     }
   }
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 1000000n to be 6220000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:307:7
  */
 export function additionalPensionPct(ageYears: number): bigint {
   if (ageYears >= 100) return 100n;
-  if (ageYears >= 95)  return 50n;
+  if (true)  return 50n;
   if (ageYears >= 90)  return 40n;
   if (ageYears >= 85)  return 30n;
killedBy: L11 — Canary: Pension age bands correct at boundaries CANARY: age 79 → 0% (mutation: change threshold from 80 to 79)
statusReason: expected 50 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:308:7
 export function additionalPensionPct(ageYears: number): bigint {
   if (ageYears >= 100) return 100n;
   if (ageYears >= 95)  return 50n;
-  if (ageYears >= 90)  return 40n;
+  if (false)  return 40n;
   if (ageYears >= 85)  return 30n;
   if (ageYears >= 80)  return 20n;
killedBy: L10 — Additional pension % by age (vs golden oracle) age 90 → 40%
statusReason: expected 30 to be 40 // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:308:7
 export function additionalPensionPct(ageYears: number): bigint {
   if (ageYears >= 100) return 100n;
   if (ageYears >= 95)  return 50n;
-  if (ageYears >= 90)  return 40n;
+  if (ageYears < 90)  return 40n;
   if (ageYears >= 85)  return 30n;
   if (ageYears >= 80)  return 20n;
killedBy: L11 — Canary: Pension age bands correct at boundaries CANARY: age 79 → 0% (mutation: change threshold from 80 to 79)
statusReason: expected 40 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:309:7
   if (ageYears >= 100) return 100n;
   if (ageYears >= 95)  return 50n;
   if (ageYears >= 90)  return 40n;
-  if (ageYears >= 85)  return 30n;
+  if (false)  return 30n;
   if (ageYears >= 80)  return 20n;
   return 0n;
killedBy: L10 — Additional pension % by age (vs golden oracle) age 85 → 30%
statusReason: expected 20 to be 30 // Object.is equality

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:322:7
   const ref = new Date(Date.UTC(y, m, 0));
   let age = ref.getUTCFullYear() - dob.getUTCFullYear();
   const mo = ref.getUTCMonth() - dob.getUTCMonth();
-  if (mo < 0 || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
+  if (false || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
   return age < 0 ? 0 : age;
 }

[Survived] StringLiteral
src/modules/payroll/domain.ts:390:25
   // Restoration: 15 years after commutation date the commuted portion is restored.
   let commutationRestored = true;
   if (commutedPensionMinor > 0n && commutationDate) {
-    const cd = new Date(`${commutationDate.slice(0, 10)}T00:00:00Z`);
+    const cd = new Date(``);
     const restoreOn = new Date(Date.UTC(cd.getUTCFullYear() + 15, cd.getUTCMonth(), cd.getUTCDate()));
     const [y, m] = month.split("-").map(Number) as [number, number];

[Survived] EqualityOperator
src/modules/payroll/domain.ts:395:14
     const [y, m] = month.split("-").map(Number) as [number, number];
     const runEnd = new Date(Date.UTC(y, m, 0));
     commutationRestored = runEnd >= restoreOn;
-  } else if (commutedPensionMinor > 0n) {
+  } else if (commutedPensionMinor >= 0n) {
     // Commuted but no date provided — treat as not yet restored.
     commutationRestored = false;

[Survived] EqualityOperator
src/modules/payroll/domain.ts:395:14
     const [y, m] = month.split("-").map(Number) as [number, number];
     const runEnd = new Date(Date.UTC(y, m, 0));
     commutationRestored = runEnd >= restoreOn;
-  } else if (commutedPensionMinor > 0n) {
+  } else if (commutedPensionMinor <= 0n) {
     // Commuted but no date provided — treat as not yet restored.
     commutationRestored = false;

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:409:7
 
   const earnings: PayComponent[] = [];
   earnings.push({ code: "BASIC_PENSION", name: "Basic Pension", type: "earning", amountMinor: basicPensionMinor });
-  if (additionalPensionMinor > 0n)
+  if (false)
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)

[Survived] EqualityOperator
src/modules/payroll/domain.ts:411:7
   earnings.push({ code: "BASIC_PENSION", name: "Basic Pension", type: "earning", amountMinor: basicPensionMinor });
   if (additionalPensionMinor > 0n)
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
-  if (drMinor > 0n)
+  if (drMinor <= 0n)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
   if (medical > 0n)
