[Survived] StringLiteral
src/modules/payroll/domain.ts:412:27
   if (additionalPensionMinor > 0n)
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)
-    earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
+    earnings.push({ code: "", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
   if (medical > 0n)
     earnings.push({ code: "FMA", name: "Medical Allowance", type: "earning", amountMinor: medical });

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:413:7
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
-  if (medical > 0n)
+  if (false)
     earnings.push({ code: "FMA", name: "Medical Allowance", type: "earning", amountMinor: medical });
 

[NoCoverage] StringLiteral
src/modules/payroll/domain.ts:414:67
   if (drMinor > 0n)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
   if (medical > 0n)
-    earnings.push({ code: "FMA", name: "Medical Allowance", type: "earning", amountMinor: medical });
+    earnings.push({ code: "FMA", name: "Medical Allowance", type: "", amountMinor: medical });
 
   // Gross is the full entitlement; commutation withholding and TDS are deductions.

[Survived] ArrayDeclaration
src/modules/payroll/domain.ts:419:38
   // Gross is the full entitlement; commutation withholding and TDS are deductions.
   const grossMinor = basicPensionMinor + additionalPensionMinor + drMinor + medical;
 
-  const deductions: PayComponent[] = [];
+  const deductions: PayComponent[] = ["Stryker was here"];
   if (commutationDeductionMinor > 0n)
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:420:7
   const grossMinor = basicPensionMinor + additionalPensionMinor + drMinor + medical;
 
   const deductions: PayComponent[] = [];
-  if (commutationDeductionMinor > 0n)
+  if (true)
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);

[Survived] EqualityOperator
src/modules/payroll/domain.ts:423:7
   if (commutationDeductionMinor > 0n)
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);
-  if (tds > 0n)
+  if (tds <= 0n)
     deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "deduction", amountMinor: tds });
 

[NoCoverage] StringLiteral
src/modules/payroll/domain.ts:424:68
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);
   if (tds > 0n)
-    deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "deduction", amountMinor: tds });
+    deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "", amountMinor: tds });
 
   const totalDeductionsMinor = commutationDeductionMinor + tds;

[Killed] ObjectLiteral
src/modules/payroll/domain.ts:429:10
   const totalDeductionsMinor = commutationDeductionMinor + tds;
   const netPayMinor = grossMinor - totalDeductionsMinor;
 
-  return {
-    grossMinor, totalDeductionsMinor, netPayMinor,
-    basicPensionMinor, payableBasicPensionMinor,
-    drMinor, additionalPensionMinor, additionalPensionPct: addlPct,
-    medicalAllowanceMinor: medical,
-    commutationDeductionMinor, commutationRestored,
-    tdsMinor: tds, ageYears, earnings, deductions,
-  };
+  return {};
 }
 
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected NaN to be 800000 // Object.is equality

[Killed] StringLiteral
src/modules/payroll/domain.ts:441:18
 
 export function assertRunStatusTransition(current: string, next: string): void {
   const allowed: Record<string, string[]> = {
-    draft:      ["processing"],
+    draft:      [""],
     processing: ["approved", "failed"],
     approved:   ["disbursed"],
killedBy: payroll/domain — assertRunStatusTransition() allows draft → processing
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_STATUS_TRANSITI…' was thrown

[Killed] StringLiteral
src/modules/payroll/domain.ts:443:18
   const allowed: Record<string, string[]> = {
     draft:      ["processing"],
     processing: ["approved", "failed"],
-    approved:   ["disbursed"],
+    approved:   [""],
     disbursed:  [],
     failed:     ["draft"],
killedBy: payroll/domain — assertRunStatusTransition() allows approved → disbursed
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_STATUS_TRANSITI…' was thrown

[Survived] StringLiteral
src/modules/payroll/domain.ts:448:27
     failed:     ["draft"],
   };
   if (!(allowed[current] ?? []).includes(next)) {
-    throw new DomainError("INVALID_STATUS_TRANSITION", `cannot move payroll run from '${current}' to '${next}'`);
+    throw new DomainError("", `cannot move payroll run from '${current}' to '${next}'`);
   }
 }

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:457:7
  * where >=6 months in the final year rounds up; capped at 20 lakh.
  */
 export function computeGratuity(yearsOfService: number, lastBasicMinor: bigint, lastDaMinor = 0n): bigint {
-  if (yearsOfService < 5) return 0n;
+  if (false) return 0n;
   const whole = Math.floor(yearsOfService);
   const fracMonths = Math.round((yearsOfService - whole) * 12);
killedBy: L11 — Canary: Gratuity gate catches boundary errors CANARY: 4.99 years → 0 (mutation: change < 5 to <= 5)
statusReason: expected 24230800n to be 0n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:460:42
   if (yearsOfService < 5) return 0n;
   const whole = Math.floor(yearsOfService);
   const fracMonths = Math.round((yearsOfService - whole) * 12);
-  const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
+  const completedYears = BigInt(whole + (fracMonths < 6 ? 1 : 0));
   const emoluments = lastBasicMinor + lastDaMinor;
   const raw = (emoluments * 15n * completedYears) / 26n;
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 4846100 to be less than or equal to 100

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:462:15
   const fracMonths = Math.round((yearsOfService - whole) * 12);
   const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
   const emoluments = lastBasicMinor + lastDaMinor;
-  const raw = (emoluments * 15n * completedYears) / 26n;
+  const raw = emoluments * 15n * completedYears * 26n;
   const rounded = roundRupee(raw);
   return rounded > GRATUITY_CAP ? GRATUITY_CAP : rounded;
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 175769200 to be less than or equal to 100

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:464:10
   const emoluments = lastBasicMinor + lastDaMinor;
   const raw = (emoluments * 15n * completedYears) / 26n;
   const rounded = roundRupee(raw);
-  return rounded > GRATUITY_CAP ? GRATUITY_CAP : rounded;
+  return false ? GRATUITY_CAP : rounded;
 }
 
killedBy: L10 — Gratuity computation (vs golden oracle) capped at 20 lakh
statusReason: expected 254326900 to be less than or equal to 100
