[Killed] EqualityOperator
src/modules/authority/domain.ts:58:7
 /** A limit is effective on `onDate` when active and the date is within bounds. */
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
   if (limit.status !== "active") return false;
-  if (limit.effectiveFrom > onDate) return false;
+  if (limit.effectiveFrom <= onDate) return false;
   if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
   return true;
killedBy: isEffective respects status, from and to bounds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:58:7
 /** A limit is effective on `onDate` when active and the date is within bounds. */
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
   if (limit.status !== "active") return false;
-  if (limit.effectiveFrom > onDate) return false;
+  if (false) return false;
   if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
   return true;
killedBy: isEffective respects status, from and to bounds
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:59:7
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
   if (limit.status !== "active") return false;
   if (limit.effectiveFrom > onDate) return false;
-  if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
+  if (false) return false;
   return true;
 }
killedBy: isEffective respects status, from and to bounds
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/modules/authority/domain.ts:59:72
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
   if (limit.status !== "active") return false;
   if (limit.effectiveFrom > onDate) return false;
-  if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
+  if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return true;
   return true;
 }
killedBy: isEffective respects status, from and to bounds
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/modules/authority/domain.ts:73:7
 ): AuthorityLimit[] {
   return limits.filter(
     (l) =>
-      l.scopeType === scopeType &&
-      l.scopeRef === scopeRef &&
+      l.scopeType === scopeType || l.scopeRef === scopeRef &&
       l.authorityType === authorityType &&
       isEffective(l, onDate),
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected 'board' to be 'director' // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:89:7
   onDate: string,
 ): AuthorityLimit | null {
   const matches = limitsForScope(limits, scopeType, scopeRef, authorityType, onDate);
-  if (matches.length === 0) return null;
+  if (true) return null;
   return matches.reduce((best, l) => (l.maxAmount > best.maxAmount ? l : best));
 }
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected undefined to be 'director' // Object.is equality

[Survived] ArrowFunction
src/modules/authority/domain.ts:90:25
 ): AuthorityLimit | null {
   const matches = limitsForScope(limits, scopeType, scopeRef, authorityType, onDate);
   if (matches.length === 0) return null;
-  return matches.reduce((best, l) => (l.maxAmount > best.maxAmount ? l : best));
+  return matches.reduce(() => undefined);
 }
 

[NoCoverage] EqualityOperator
src/modules/authority/domain.ts:90:39
 ): AuthorityLimit | null {
   const matches = limitsForScope(limits, scopeType, scopeRef, authorityType, onDate);
   if (matches.length === 0) return null;
-  return matches.reduce((best, l) => (l.maxAmount > best.maxAmount ? l : best));
+  return matches.reduce((best, l) => (l.maxAmount >= best.maxAmount ? l : best));
 }
 

[Survived] LogicalOperator
src/modules/authority/domain.ts:129:10
   const visited = new Set<string>([start.id]);
   let cursor: AuthorityLimit | null = start;
 
-  while (cursor && cursor.escalateToScopeType && cursor.escalateToRef) {
+  while (cursor || cursor.escalateToScopeType && cursor.escalateToRef) {
     const next: AuthorityLimit | null = bestLimitForScope(
       limits,

[Killed] ConditionalExpression
src/modules/authority/domain.ts:141:9
     visited.add(next.id);
     const node = { scopeType: next.scopeType, scopeRef: next.scopeRef, maxAmount: next.maxAmount };
     chain.push(node);
-    if (amount <= next.maxAmount) {
+    if (true) {
       return { escalationChain: chain, finalApprover: node, covered: true };
     }
killedBy: evaluateAuthority — limit exceeded triggers escalation walks the full ladder to the board for a very large amount
statusReason: expected [ 'director' ] to deeply equal [ 'director', 'board' ]

[Killed] LogicalOperator
src/modules/authority/domain.ts:164:20
   onDate: string,
 ): AuthorityDecision {
   const actorLimit = resolveActorLimit(limits, actor, authorityType, onDate);
-  const actorMax = actorLimit?.maxAmount ?? 0;
+  const actorMax = actorLimit?.maxAmount && 0;
   const withinActorAuthority = actorLimit !== null && amount <= actorMax;
 
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected false to be true // Object.is equality

[Survived] OptionalChaining
src/modules/authority/domain.ts:164:20
   onDate: string,
 ): AuthorityDecision {
   const actorLimit = resolveActorLimit(limits, actor, authorityType, onDate);
-  const actorMax = actorLimit?.maxAmount ?? 0;
+  const actorMax = actorLimit.maxAmount ?? 0;
   const withinActorAuthority = actorLimit !== null && amount <= actorMax;
 

[Killed] ConditionalExpression
src/modules/authority/domain.ts:165:32
 ): AuthorityDecision {
   const actorLimit = resolveActorLimit(limits, actor, authorityType, onDate);
   const actorMax = actorLimit?.maxAmount ?? 0;
-  const withinActorAuthority = actorLimit !== null && amount <= actorMax;
+  const withinActorAuthority = false;
 
   if (withinActorAuthority) {
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:165:32
 ): AuthorityDecision {
   const actorLimit = resolveActorLimit(limits, actor, authorityType, onDate);
   const actorMax = actorLimit?.maxAmount ?? 0;
-  const withinActorAuthority = actorLimit !== null && amount <= actorMax;
+  const withinActorAuthority = true;
 
   if (withinActorAuthority) {
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected true to be false // Object.is equality

[NoCoverage] ArrayDeclaration
src/modules/authority/domain.ts:184:26
   // Exceeds (or actor holds no limit): escalate from the actor's best limit.
   const esc = actorLimit
     ? resolveEscalation(limits, actorLimit, amount, authorityType, onDate)
-    : { escalationChain: [], finalApprover: null, covered: false };
+    : { escalationChain: ["Stryker was here"], finalApprover: null, covered: false };
 
   return {
