[Killed] ObjectLiteral
src/modules/fnf/domain.ts:98:60
     ceilingMinor: input.gratuityCeilingMinor,
   });
 
-  const leaveEncashExemption = computeLeaveEncashExemption({
-    actualEncashmentMinor: input.leaveEncashmentGrossMinor,
-    avgSalaryLast10MonthsMinor: input.avgSalaryLast10MonthsMinor,
-    leaveBalanceDays: input.leaveBalanceDays,
-    completedYears: input.completedYears,
-    employeeCategory: input.employeeCategory,
-    separationType: input.separationType,
-    ceilingMinor: input.leaveEncashCeilingMinor,
-    priorExemptionClaimedMinor: input.priorLeaveEncashExemptionMinor,
-  });
+  const leaveEncashExemption = computeLeaveEncashExemption({});
 
   const retrenchmentExemption = computeRetrenchmentExemption({
killedBy: L10 F&F — separation income adds to FY salary income taxable separation income raises annual taxable income
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:128:5
 
   // Step 2: Total gross
   const totalGrossMinor =
-    input.noticeBuyoutMinor +
-    input.leaveEncashmentGrossMinor +
-    input.gratuityGrossMinor +
-    input.retrenchmentCompMinor +
-    input.vrsCompMinor +
-    input.arrearsMinor;
+    input.noticeBuyoutMinor + input.leaveEncashmentGrossMinor + input.gratuityGrossMinor + input.retrenchmentCompMinor + input.vrsCompMinor - input.arrearsMinor;
 
   // Step 3: Total exempt
killedBy: L10 F&F — net payable equals gross less TDS gross is the sum of all settlement legs
statusReason: expected 9000000n to be 21000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:128:5
 
   // Step 2: Total gross
   const totalGrossMinor =
-    input.noticeBuyoutMinor +
-    input.leaveEncashmentGrossMinor +
-    input.gratuityGrossMinor +
+    input.noticeBuyoutMinor + input.leaveEncashmentGrossMinor - input.gratuityGrossMinor +
     input.retrenchmentCompMinor +
     input.vrsCompMinor +
killedBy: L10 F&F — net payable equals gross less TDS gross is the sum of all settlement legs
statusReason: expected 15000000n to be 21000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:137:5
 
   // Step 3: Total exempt
   const totalExemptMinor =
-    gratuityExemption.exemptMinor +
-    leaveEncashExemption.exemptMinor +
-    (retrenchmentExemption?.exemptMinor ?? 0n) +
-    (vrsExemption?.exemptMinor ?? 0n);
+    gratuityExemption.exemptMinor + leaveEncashExemption.exemptMinor + (retrenchmentExemption?.exemptMinor ?? 0n) - (vrsExemption?.exemptMinor ?? 0n);
 
   // Step 4: Total taxable on separation
killedBy: computeFnfSettlement — Conservation: exempt + taxable = gross conservation holds with VRS separation
statusReason: expected 1002000000n to be 1650000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:145:5
   // Step 4: Total taxable on separation
   // Notice buyout and arrears are fully taxable (salary income u/s 17(1))
   const totalTaxableOnSeparationMinor =
-    input.noticeBuyoutMinor +
-    input.arrearsMinor +
-    gratuityExemption.taxableMinor +
-    leaveEncashExemption.taxableMinor +
-    (retrenchmentExemption?.taxableMinor ?? 0n) +
+    input.noticeBuyoutMinor + input.arrearsMinor + gratuityExemption.taxableMinor + leaveEncashExemption.taxableMinor - (retrenchmentExemption?.taxableMinor ?? 0n) +
     (vrsExemption?.taxableMinor ?? 0n);
 
killedBy: computeFnfSettlement — Conservation: exempt + taxable = gross conservation holds with retrenchment separation
statusReason: expected 480000000n to be 1200000000n // Object.is equality

[Killed] ConditionalExpression
src/modules/fnf/domain.ts:155:22
   // Step 5: Annual taxable income for the FY
   const totalSalaryIncomeMinor = input.salaryYtdMinor + totalTaxableOnSeparationMinor;
   const stdDed = BigInt(stdDeduction(input.taxRegime, input.fyStartYear)) * 100n; // convert rupees to paise
-  const chapterViA = input.taxRegime === "old"
+  const chapterViA = false
     ? input.deductions80cMinor + input.deductions80dMinor + input.otherDeductionsMinor
     : 0n; // New regime: no Ch VI-A deductions
killedBy: L10 F&F — Chapter VI-A deductions apply only in the old regime 80C reduces taxable income in the OLD regime
statusReason: expected 95000000n to be 80000000n // Object.is equality

[Killed] MethodExpression
src/modules/fnf/domain.ts:163:36
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
 
   // Step 6: Compute annual tax (convert paise to rupees for the engine, then back)
-  const taxableRupees = Math.round(Math.max(0, Number(annualTaxableMinor) / 100) / 10) * 10; // Sec 288A rounding
+  const taxableRupees = Math.round(Math.min(0, Number(annualTaxableMinor) / 100) / 10) * 10; // Sec 288A rounding
   const taxResult = computeTax(taxableRupees, input.taxRegime, input.fyStartYear);
   const annualTaxMinor = BigInt(taxResult.totalTax) * 100n;
killedBy: L10 F&F — negative results are clamped to zero, never emitted TDS on separation is annual tax minus YTD TDS when positive
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/modules/fnf/domain.ts:169:7
 
   // Step 7: TDS on separation = annual tax − YTD TDS
   let tdsOnSeparationMinor = annualTaxMinor - input.tdsYtdMinor;
-  if (tdsOnSeparationMinor < 0n) tdsOnSeparationMinor = 0n;
+  if (false) tdsOnSeparationMinor = 0n;
 
   // Step 8: Net payable = total gross − TDS deducted on F&F
killedBy: L10 F&F — negative results are clamped to zero, never emitted TDS on separation clamps at 0 when YTD TDS already exceeds annual tax
statusReason: expected -999000000n to be 0n // Object.is equality

[Killed] ObjectLiteral
src/modules/fnf/domain.ts:174:10
   // Step 8: Net payable = total gross − TDS deducted on F&F
   const netPayableMinor = totalGrossMinor - tdsOnSeparationMinor;
 
-  return {
-    gratuityExemption,
-    leaveEncashExemption,
-    retrenchmentExemption,
-    vrsExemption,
-    totalGrossMinor,
-    totalExemptMinor,
-    totalTaxableOnSeparationMinor,
-    annualTaxableMinor,
-    annualTaxMinor,
-    tdsAlreadyDeductedMinor: input.tdsYtdMinor,
-    tdsOnSeparationMinor,
-    netPayableMinor,
-  };
+  return {};
 }
 
killedBy: L10 F&F — separation income adds to FY salary income taxable separation income raises annual taxable income
statusReason: Cannot mix BigInt and other types, use explicit conversions
