[Killed] BlockStatement
src/modules/payments/domain.ts:14:89
  * C4 FIX: Segregation of duties — the approver/payer (checker) must differ
  * from the creator (maker). Enforced on bill approve and payment initiate.
  */
-export function assertDistinctMakerChecker(creatorId: string, approverId: string): void {
-  if (creatorId && approverId && creatorId === approverId) {
-    throw new DomainError(
-      "MAKER_CHECKER_VIOLATION",
-      "maker and checker must be different actors (self-approval rejected on money path)",
-    );
-  }
-}
+export function assertDistinctMakerChecker(creatorId: string, approverId: string): void {}
 
 /** Bill must reference a PO and a GRN for 3-way match. */
killedBy: L10 payments — maker/checker segregation of duties rejects self-approval when maker and checker are the same actor
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/modules/payments/domain.ts:15:34
  * from the creator (maker). Enforced on bill approve and payment initiate.
  */
 export function assertDistinctMakerChecker(creatorId: string, approverId: string): void {
-  if (creatorId && approverId && creatorId === approverId) {
+  if (creatorId && approverId && creatorId !== approverId) {
     throw new DomainError(
       "MAKER_CHECKER_VIOLATION",
killedBy: L10 payments — maker/checker segregation of duties rejects self-approval when maker and checker are the same actor
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/modules/payments/domain.ts:15:60
  * from the creator (maker). Enforced on bill approve and payment initiate.
  */
 export function assertDistinctMakerChecker(creatorId: string, approverId: string): void {
-  if (creatorId && approverId && creatorId === approverId) {
-    throw new DomainError(
-      "MAKER_CHECKER_VIOLATION",
-      "maker and checker must be different actors (self-approval rejected on money path)",
-    );
-  }
+  if (creatorId && approverId && creatorId === approverId) {}
 }
 
killedBy: L10 payments — maker/checker segregation of duties rejects self-approval when maker and checker are the same actor
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/modules/payments/domain.ts:18:7
   if (creatorId && approverId && creatorId === approverId) {
     throw new DomainError(
       "MAKER_CHECKER_VIOLATION",
-      "maker and checker must be different actors (self-approval rejected on money path)",
+      "",
     );
   }
killedBy: L10 payments — maker/checker segregation of duties error carries the MAKER_CHECKER_VIOLATION code and a money-path message
statusReason: expected '[MAKER_CHECKER_VIOLATION] ' to match /self-approval/i

[Killed] BlockStatement
src/modules/payments/domain.ts:24:119
 }
 
 /** Bill must reference a PO and a GRN for 3-way match. */
-export function assertThreeWayMatchPresent(poRef: string | null | undefined, grnRef: string | null | undefined): void {
-  if (!poRef || !grnRef) {
-    throw new DomainError(
-      "THREE_WAY_MATCH_FAILED",
-      "bill requires both po_ref and grn_ref for 3-way match"
-    );
-  }
-}
+export function assertThreeWayMatchPresent(poRef: string | null | undefined, grnRef: string | null | undefined): void {}
 
 /** Default 3-way-match tolerance (percent). Overridable via env at the gate. */
killedBy: L10 payments — three-way match requires both references rejects when po null
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/modules/payments/domain.ts:25:7
 
 /** Bill must reference a PO and a GRN for 3-way match. */
 export function assertThreeWayMatchPresent(poRef: string | null | undefined, grnRef: string | null | undefined): void {
-  if (!poRef || !grnRef) {
+  if (poRef || !grnRef) {
     throw new DomainError(
       "THREE_WAY_MATCH_FAILED",
killedBy: L10 payments — three-way match requires both references accepts when both refs are present
statusReason: expected [Function] to not throw an error but 'DomainError: [THREE_WAY_MATCH_FAILED]…' was thrown

[Killed] ConditionalExpression
src/modules/payments/domain.ts:25:7
 
 /** Bill must reference a PO and a GRN for 3-way match. */
 export function assertThreeWayMatchPresent(poRef: string | null | undefined, grnRef: string | null | undefined): void {
-  if (!poRef || !grnRef) {
+  if (false) {
     throw new DomainError(
       "THREE_WAY_MATCH_FAILED",
killedBy: L10 payments — three-way match requires both references rejects when po null
statusReason: expected [Function] to throw an error

[Survived] BlockStatement
src/modules/payments/domain.ts:49:57
  * division truncates, so the result is quantised down to 0.01% steps and
  * systematically UNDER-reports. Use `exceedsTolerance()` to decide.
  */
-function overagePct(value: bigint, cap: bigint): number {
-  if (cap <= 0n) return value > 0n ? Number.POSITIVE_INFINITY : 0;
-  if (value <= cap) return 0;
-  return Number((value - cap) * 10000n / cap) / 100;
-}
+function overagePct(value: bigint, cap: bigint): number {}
 
 /**

[Survived] EqualityOperator
src/modules/payments/domain.ts:50:7
  * systematically UNDER-reports. Use `exceedsTolerance()` to decide.
  */
 function overagePct(value: bigint, cap: bigint): number {
-  if (cap <= 0n) return value > 0n ? Number.POSITIVE_INFINITY : 0;
+  if (cap > 0n) return value > 0n ? Number.POSITIVE_INFINITY : 0;
   if (value <= cap) return 0;
   return Number((value - cap) * 10000n / cap) / 100;

[NoCoverage] EqualityOperator
src/modules/payments/domain.ts:50:25
  * systematically UNDER-reports. Use `exceedsTolerance()` to decide.
  */
 function overagePct(value: bigint, cap: bigint): number {
-  if (cap <= 0n) return value > 0n ? Number.POSITIVE_INFINITY : 0;
+  if (cap <= 0n) return value >= 0n ? Number.POSITIVE_INFINITY : 0;
   if (value <= cap) return 0;
   return Number((value - cap) * 10000n / cap) / 100;

[Survived] EqualityOperator
src/modules/payments/domain.ts:51:7
  */
 function overagePct(value: bigint, cap: bigint): number {
   if (cap <= 0n) return value > 0n ? Number.POSITIVE_INFINITY : 0;
-  if (value <= cap) return 0;
+  if (value < cap) return 0;
   return Number((value - cap) * 10000n / cap) / 100;
 }

[Survived] ConditionalExpression
src/modules/payments/domain.ts:51:7
  */
 function overagePct(value: bigint, cap: bigint): number {
   if (cap <= 0n) return value > 0n ? Number.POSITIVE_INFINITY : 0;
-  if (value <= cap) return 0;
+  if (false) return 0;
   return Number((value - cap) * 10000n / cap) / 100;
 }

[Survived] ArithmeticOperator
src/modules/payments/domain.ts:52:17
 function overagePct(value: bigint, cap: bigint): number {
   if (cap <= 0n) return value > 0n ? Number.POSITIVE_INFINITY : 0;
   if (value <= cap) return 0;
-  return Number((value - cap) * 10000n / cap) / 100;
+  return Number((value - cap) / 10000n / cap) / 100;
 }
 

[Survived] ArithmeticOperator
src/modules/payments/domain.ts:52:17
 function overagePct(value: bigint, cap: bigint): number {
   if (cap <= 0n) return value > 0n ? Number.POSITIVE_INFINITY : 0;
   if (value <= cap) return 0;
-  return Number((value - cap) * 10000n / cap) / 100;
+  return Number((value - cap) * 10000n * cap) / 100;
 }
 

[Killed] BlockStatement
src/modules/payments/domain.ts:68:106
  * Exported so every money-path tolerance gate shares one implementation rather
  * than re-deriving it through `overagePct()`, which truncates (see below).
  */
-export function deviationExceedsTolerance(deviation: bigint, cap: bigint, tolerancePct: number): boolean {
-  if (cap <= 0n) return deviation > 0n;
-  if (deviation <= 0n) return false;
-  const toleranceBps = BigInt(Math.round(tolerancePct * 100)); // percent -> bps
-  return deviation * 10000n > cap * toleranceBps;
-}
+export function deviationExceedsTolerance(deviation: bigint, cap: bigint, tolerancePct: number): boolean {}
 
 /**
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) GRN just above 2% over PO is REJECTED
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/modules/payments/domain.ts:69:7
  * than re-deriving it through `overagePct()`, which truncates (see below).
  */
 export function deviationExceedsTolerance(deviation: bigint, cap: bigint, tolerancePct: number): boolean {
-  if (cap <= 0n) return deviation > 0n;
+  if (cap > 0n) return deviation > 0n;
   if (deviation <= 0n) return false;
   const toleranceBps = BigInt(Math.round(tolerancePct * 100)); // percent -> bps
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) GRN exactly 2% over PO is ALLOWED (boundary exclusive)
statusReason: expected [Function] to not throw an error but 'DomainError: [GRN_EXCEEDS_PO] receive…' was thrown

[Killed] EqualityOperator
src/modules/payments/domain.ts:69:25
  * than re-deriving it through `overagePct()`, which truncates (see below).
  */
 export function deviationExceedsTolerance(deviation: bigint, cap: bigint, tolerancePct: number): boolean {
-  if (cap <= 0n) return deviation > 0n;
+  if (cap <= 0n) return deviation <= 0n;
   if (deviation <= 0n) return false;
   const toleranceBps = BigInt(Math.round(tolerancePct * 100)); // percent -> bps
killedBy: deviationExceedsTolerance — shared exact comparator treats a non-positive cap as no authorised amount
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/modules/payments/domain.ts:70:7
  */
 export function deviationExceedsTolerance(deviation: bigint, cap: bigint, tolerancePct: number): boolean {
   if (cap <= 0n) return deviation > 0n;
-  if (deviation <= 0n) return false;
+  if (deviation > 0n) return false;
   const toleranceBps = BigInt(Math.round(tolerancePct * 100)); // percent -> bps
   return deviation * 10000n > cap * toleranceBps;
killedBy: 3-way match — tri-leg reconciliation (R5) rejects an invoice exceeding GRN beyond tolerance (over-billing)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/payments/domain.ts:70:7
  */
 export function deviationExceedsTolerance(deviation: bigint, cap: bigint, tolerancePct: number): boolean {
   if (cap <= 0n) return deviation > 0n;
-  if (deviation <= 0n) return false;
+  if (true) return false;
   const toleranceBps = BigInt(Math.round(tolerancePct * 100)); // percent -> bps
   return deviation * 10000n > cap * toleranceBps;
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) GRN just above 2% over PO is REJECTED
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/modules/payments/domain.ts:71:42
 export function deviationExceedsTolerance(deviation: bigint, cap: bigint, tolerancePct: number): boolean {
   if (cap <= 0n) return deviation > 0n;
   if (deviation <= 0n) return false;
-  const toleranceBps = BigInt(Math.round(tolerancePct * 100)); // percent -> bps
+  const toleranceBps = BigInt(Math.round(tolerancePct / 100)); // percent -> bps
   return deviation * 10000n > cap * toleranceBps;
 }
killedBy: 3-way match — tri-leg reconciliation (R5) passes a small overage within the 2% default tolerance
statusReason: expected [Function] to not throw an error but 'DomainError: [INVOICE_EXCEEDS_GRN] in…' was thrown

[Killed] ConditionalExpression
src/modules/payments/domain.ts:72:10
   if (cap <= 0n) return deviation > 0n;
   if (deviation <= 0n) return false;
   const toleranceBps = BigInt(Math.round(tolerancePct * 100)); // percent -> bps
-  return deviation * 10000n > cap * toleranceBps;
+  return false;
 }
 
killedBy: 3-way match — tri-leg reconciliation (R5) rejects an invoice exceeding GRN beyond tolerance (over-billing)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/payments/domain.ts:72:10
   if (cap <= 0n) return deviation > 0n;
   if (deviation <= 0n) return false;
   const toleranceBps = BigInt(Math.round(tolerancePct * 100)); // percent -> bps
-  return deviation * 10000n > cap * toleranceBps;
+  return true;
 }
 
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) GRN exactly 2% over PO is ALLOWED (boundary exclusive)
statusReason: expected [Function] to not throw an error but 'DomainError: [GRN_EXCEEDS_PO] receive…' was thrown

[Killed] BlockStatement
src/modules/payments/domain.ts:101:86
  * remain exact. The boundary stays EXCLUSIVE: exactly at tolerance is allowed,
  * which is the pre-existing contract.
  */
-function exceedsTolerance(value: bigint, cap: bigint, tolerancePct: number): boolean {
-  if (cap <= 0n) return value > 0n;
-  if (value <= cap) return false;
-  return deviationExceedsTolerance(value - cap, cap, tolerancePct);
-}
+function exceedsTolerance(value: bigint, cap: bigint, tolerancePct: number): boolean {}
 
 /**
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) GRN just above 2% over PO is REJECTED
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/modules/payments/domain.ts:102:7
  * which is the pre-existing contract.
  */
 function exceedsTolerance(value: bigint, cap: bigint, tolerancePct: number): boolean {
-  if (cap <= 0n) return value > 0n;
+  if (cap > 0n) return value > 0n;
   if (value <= cap) return false;
   return deviationExceedsTolerance(value - cap, cap, tolerancePct);
killedBy: L10 payments — all three legs must be positive accepts three equal positive legs
statusReason: expected [Function] to not throw an error but 'DomainError: [GRN_EXCEEDS_PO] receive…' was thrown

[Killed] ConditionalExpression
src/modules/payments/domain.ts:102:7
  * which is the pre-existing contract.
  */
 function exceedsTolerance(value: bigint, cap: bigint, tolerancePct: number): boolean {
-  if (cap <= 0n) return value > 0n;
+  if (true) return value > 0n;
   if (value <= cap) return false;
   return deviationExceedsTolerance(value - cap, cap, tolerancePct);
killedBy: L10 payments — all three legs must be positive accepts three equal positive legs
statusReason: expected [Function] to not throw an error but 'DomainError: [GRN_EXCEEDS_PO] receive…' was thrown

[Killed] EqualityOperator
src/modules/payments/domain.ts:103:7
  */
 function exceedsTolerance(value: bigint, cap: bigint, tolerancePct: number): boolean {
   if (cap <= 0n) return value > 0n;
-  if (value <= cap) return false;
+  if (value > cap) return false;
   return deviationExceedsTolerance(value - cap, cap, tolerancePct);
 }
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) GRN just above 2% over PO is REJECTED
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/modules/payments/domain.ts:103:28
  */
 function exceedsTolerance(value: bigint, cap: bigint, tolerancePct: number): boolean {
   if (cap <= 0n) return value > 0n;
-  if (value <= cap) return false;
+  if (value <= cap) return true;
   return deviationExceedsTolerance(value - cap, cap, tolerancePct);
 }
killedBy: 3-way match — tri-leg reconciliation (R5) passes when invoice == GRN == PO
statusReason: expected [Function] to not throw an error but 'DomainError: [GRN_EXCEEDS_PO] receive…' was thrown

[Killed] ArithmeticOperator
src/modules/payments/domain.ts:104:36
 function exceedsTolerance(value: bigint, cap: bigint, tolerancePct: number): boolean {
   if (cap <= 0n) return value > 0n;
   if (value <= cap) return false;
-  return deviationExceedsTolerance(value - cap, cap, tolerancePct);
+  return deviationExceedsTolerance(value + cap, cap, tolerancePct);
 }
 
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) GRN exactly 2% over PO is ALLOWED (boundary exclusive)
statusReason: expected [Function] to not throw an error but 'DomainError: [GRN_EXCEEDS_PO] receive…' was thrown

[Killed] ConditionalExpression
src/modules/payments/domain.ts:126:7
 ): void {
   assertThreeWayMatchPresent(poRef, grnRef);
   const { poAmountMinor, grnAmountMinor, invoiceMinor } = legs;
-  if (poAmountMinor <= 0n || grnAmountMinor <= 0n || invoiceMinor <= 0n) {
+  if (false) {
     throw new DomainError(
       "THREE_WAY_MATCH_FAILED",
killedBy: L10 payments — all three legs must be positive rejects when po is zero
statusReason: expected [Function] to throw error matching /THREE_WAY_MATCH_FAILED/ but got '[GRN_EXCEEDS_PO] received value 10000…'

[Killed] ConditionalExpression
src/modules/payments/domain.ts:126:7
 ): void {
   assertThreeWayMatchPresent(poRef, grnRef);
   const { poAmountMinor, grnAmountMinor, invoiceMinor } = legs;
-  if (poAmountMinor <= 0n || grnAmountMinor <= 0n || invoiceMinor <= 0n) {
+  if (false || grnAmountMinor <= 0n || invoiceMinor <= 0n) {
     throw new DomainError(
       "THREE_WAY_MATCH_FAILED",
killedBy: L10 payments — all three legs must be positive rejects when po is zero
statusReason: expected [Function] to throw error matching /THREE_WAY_MATCH_FAILED/ but got '[GRN_EXCEEDS_PO] received value 10000…'

[Survived] StringLiteral
src/modules/payments/domain.ts:129:7
   if (poAmountMinor <= 0n || grnAmountMinor <= 0n || invoiceMinor <= 0n) {
     throw new DomainError(
       "THREE_WAY_MATCH_FAILED",
-      `po/grn/invoice amounts must all be positive to reconcile (po=${poAmountMinor} grn=${grnAmountMinor} invoice=${invoiceMinor})`,
+      ``,
     );
   }

[Killed] ConditionalExpression
src/modules/payments/domain.ts:132:7
       `po/grn/invoice amounts must all be positive to reconcile (po=${poAmountMinor} grn=${grnAmountMinor} invoice=${invoiceMinor})`,
     );
   }
-  if (exceedsTolerance(grnAmountMinor, poAmountMinor, tolerancePct)) {
+  if (true) {
     throw new DomainError(
       "GRN_EXCEEDS_PO",
killedBy: L10 payments — all three legs must be positive accepts three equal positive legs
statusReason: expected [Function] to not throw an error but 'DomainError: [GRN_EXCEEDS_PO] receive…' was thrown

[Killed] ConditionalExpression
src/modules/payments/domain.ts:132:7
       `po/grn/invoice amounts must all be positive to reconcile (po=${poAmountMinor} grn=${grnAmountMinor} invoice=${invoiceMinor})`,
     );
   }
-  if (exceedsTolerance(grnAmountMinor, poAmountMinor, tolerancePct)) {
+  if (false) {
     throw new DomainError(
       "GRN_EXCEEDS_PO",
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) GRN just above 2% over PO is REJECTED
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/payments/domain.ts:138:7
       `received value ${grnAmountMinor} paise exceeds ordered value ${poAmountMinor} paise by ~${overagePct(grnAmountMinor, poAmountMinor)}%, beyond the ${tolerancePct}% tolerance`,
     );
   }
-  if (exceedsTolerance(invoiceMinor, grnAmountMinor, tolerancePct)) {
+  if (false) {
     throw new DomainError(
       "INVOICE_EXCEEDS_GRN",
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) invoice just above 2% over GRN is REJECTED
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/modules/payments/domain.ts:138:69
       `received value ${grnAmountMinor} paise exceeds ordered value ${poAmountMinor} paise by ~${overagePct(grnAmountMinor, poAmountMinor)}%, beyond the ${tolerancePct}% tolerance`,
     );
   }
-  if (exceedsTolerance(invoiceMinor, grnAmountMinor, tolerancePct)) {
-    throw new DomainError(
-      "INVOICE_EXCEEDS_GRN",
-      `invoice ${invoiceMinor} paise exceeds accepted/received value ${grnAmountMinor} paise by ~${overagePct(invoiceMinor, grnAmountMinor)}%, beyond the ${tolerancePct}% tolerance`,
-    );
-  }
+  if (exceedsTolerance(invoiceMinor, grnAmountMinor, tolerancePct)) {}
   if (exceedsTolerance(invoiceMinor, poAmountMinor, tolerancePct)) {
     throw new DomainError(
killedBy: L10 payments — tolerance boundary is exclusive (exactly-at-limit is allowed) invoice just above 2% over GRN is REJECTED
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/payments/domain.ts:144:7
       `invoice ${invoiceMinor} paise exceeds accepted/received value ${grnAmountMinor} paise by ~${overagePct(invoiceMinor, grnAmountMinor)}%, beyond the ${tolerancePct}% tolerance`,
     );
   }
-  if (exceedsTolerance(invoiceMinor, poAmountMinor, tolerancePct)) {
+  if (true) {
     throw new DomainError(
       "INVOICE_EXCEEDS_PO",
killedBy: L10 payments — all three legs must be positive accepts three equal positive legs
statusReason: expected [Function] to not throw an error but 'DomainError: [INVOICE_EXCEEDS_PO] inv…' was thrown

[NoCoverage] BlockStatement
src/modules/payments/domain.ts:144:68
       `invoice ${invoiceMinor} paise exceeds accepted/received value ${grnAmountMinor} paise by ~${overagePct(invoiceMinor, grnAmountMinor)}%, beyond the ${tolerancePct}% tolerance`,
     );
   }
-  if (exceedsTolerance(invoiceMinor, poAmountMinor, tolerancePct)) {
-    throw new DomainError(
-      "INVOICE_EXCEEDS_PO",
-      `invoice ${invoiceMinor} paise exceeds ordered value ${poAmountMinor} paise by ~${overagePct(invoiceMinor, poAmountMinor)}%, beyond the ${tolerancePct}% tolerance`,
-    );
-  }
+  if (exceedsTolerance(invoiceMinor, poAmountMinor, tolerancePct)) {}
 }
 

[Killed] StringLiteral
src/modules/payments/domain.ts:152:69
   }
 }
 
-const VALID_PAYMENT_MODES = new Set(["NEFT", "RTGS", "IMPS", "DBT", "PFMS", "cheque"]);
+const VALID_PAYMENT_MODES = new Set(["NEFT", "RTGS", "IMPS", "DBT", "", "cheque"]);
 
 export function assertValidPaymentMode(mode: string): void {
killedBy: L10 payments — payment mode allowlist accepts PFMS
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_PAYMENT_MODE] m…' was thrown

[Killed] ArrayDeclaration
src/modules/payments/domain.ts:152:37
   }
 }
 
-const VALID_PAYMENT_MODES = new Set(["NEFT", "RTGS", "IMPS", "DBT", "PFMS", "cheque"]);
+const VALID_PAYMENT_MODES = new Set([]);
 
 export function assertValidPaymentMode(mode: string): void {
killedBy: L10 payments — payment mode allowlist accepts NEFT
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_PAYMENT_MODE] m…' was thrown

[Killed] BlockStatement
src/modules/payments/domain.ts:154:60
 
 const VALID_PAYMENT_MODES = new Set(["NEFT", "RTGS", "IMPS", "DBT", "PFMS", "cheque"]);
 
-export function assertValidPaymentMode(mode: string): void {
-  if (!VALID_PAYMENT_MODES.has(mode)) {
-    throw new DomainError("INVALID_PAYMENT_MODE", `mode must be one of ${[...VALID_PAYMENT_MODES].join("|")}`);
-  }
-}
+export function assertValidPaymentMode(mode: string): void {}
 
 /** Payment can only be initiated once bill is in 'passed' status. */
killedBy: L10 payments — payment mode allowlist rejects "neft"
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/modules/payments/domain.ts:155:39
 const VALID_PAYMENT_MODES = new Set(["NEFT", "RTGS", "IMPS", "DBT", "PFMS", "cheque"]);
 
 export function assertValidPaymentMode(mode: string): void {
-  if (!VALID_PAYMENT_MODES.has(mode)) {
-    throw new DomainError("INVALID_PAYMENT_MODE", `mode must be one of ${[...VALID_PAYMENT_MODES].join("|")}`);
-  }
+  if (!VALID_PAYMENT_MODES.has(mode)) {}
 }
 
killedBy: L10 payments — payment mode allowlist rejects "neft"
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/payments/domain.ts:155:7
 const VALID_PAYMENT_MODES = new Set(["NEFT", "RTGS", "IMPS", "DBT", "PFMS", "cheque"]);
 
 export function assertValidPaymentMode(mode: string): void {
-  if (!VALID_PAYMENT_MODES.has(mode)) {
+  if (false) {
     throw new DomainError("INVALID_PAYMENT_MODE", `mode must be one of ${[...VALID_PAYMENT_MODES].join("|")}`);
   }
killedBy: L10 payments — payment mode allowlist rejects "neft"
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/modules/payments/domain.ts:156:51
 
 export function assertValidPaymentMode(mode: string): void {
   if (!VALID_PAYMENT_MODES.has(mode)) {
-    throw new DomainError("INVALID_PAYMENT_MODE", `mode must be one of ${[...VALID_PAYMENT_MODES].join("|")}`);
+    throw new DomainError("INVALID_PAYMENT_MODE", ``);
   }
 }
killedBy: L10 payments — payment mode allowlist the rejection message lists the permitted modes
statusReason: expected '[INVALID_PAYMENT_MODE] ' to match /NEFT/

[Killed] StringLiteral
src/modules/payments/domain.ts:156:27
 
 export function assertValidPaymentMode(mode: string): void {
   if (!VALID_PAYMENT_MODES.has(mode)) {
-    throw new DomainError("INVALID_PAYMENT_MODE", `mode must be one of ${[...VALID_PAYMENT_MODES].join("|")}`);
+    throw new DomainError("", `mode must be one of ${[...VALID_PAYMENT_MODES].join("|")}`);
   }
 }
killedBy: L10 payments — payment mode allowlist rejects "neft"
statusReason: expected [Function] to throw error matching /INVALID_PAYMENT_MODE/ but got '[] mode must be one of NEFT|RTGS|IMPS…'

[Killed] BlockStatement
src/modules/payments/domain.ts:161:56
 }
 
 /** Payment can only be initiated once bill is in 'passed' status. */
-export function assertBillPassed(status: string): void {
-  if (status !== "passed") {
-    throw new DomainError("BILL_NOT_PASSED", `payment requires bill.status=passed, got '${status}'`);
-  }
-}
+export function assertBillPassed(status: string): void {}
 
 const STAGE_TRANSITIONS: Record<string, string> = {
killedBy: L10 payments — payment requires bill.status = passed rejects "draft"
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/payments/domain.ts:162:7
 
 /** Payment can only be initiated once bill is in 'passed' status. */
 export function assertBillPassed(status: string): void {
-  if (status !== "passed") {
+  if (true) {
     throw new DomainError("BILL_NOT_PASSED", `payment requires bill.status=passed, got '${status}'`);
   }
killedBy: L10 payments — payment requires bill.status = passed accepts 'passed'
statusReason: expected [Function] to not throw an error but 'DomainError: [BILL_NOT_PASSED] paymen…' was thrown

[Killed] BlockStatement
src/modules/payments/domain.ts:162:28
 
 /** Payment can only be initiated once bill is in 'passed' status. */
 export function assertBillPassed(status: string): void {
-  if (status !== "passed") {
-    throw new DomainError("BILL_NOT_PASSED", `payment requires bill.status=passed, got '${status}'`);
-  }
+  if (status !== "passed") {}
 }
 
killedBy: L10 payments — payment requires bill.status = passed rejects "draft"
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/modules/payments/domain.ts:163:46
 /** Payment can only be initiated once bill is in 'passed' status. */
 export function assertBillPassed(status: string): void {
   if (status !== "passed") {
-    throw new DomainError("BILL_NOT_PASSED", `payment requires bill.status=passed, got '${status}'`);
+    throw new DomainError("BILL_NOT_PASSED", ``);
   }
 }
killedBy: L10 payments — payment requires bill.status = passed the error reports the offending status
statusReason: expected '[BILL_NOT_PASSED] ' to match /draft/

[Killed] StringLiteral
src/modules/payments/domain.ts:168:12
 }
 
 const STAGE_TRANSITIONS: Record<string, string> = {
-  section: "accounts",
+  section: "",
   accounts: "pay",
 };
killedBy: L10 payments — bill stage progression section advances to accounts
statusReason: [STAGE_TERMINAL] bill is already at final stage 'section'

[Killed] BlockStatement
src/modules/payments/domain.ts:172:52
   accounts: "pay",
 };
 
-export function nextStage(current: string): string {
-  const next = STAGE_TRANSITIONS[current];
-  if (!next) throw new DomainError("STAGE_TERMINAL", `bill is already at final stage '${current}'`);
-  return next;
-}
+export function nextStage(current: string): string {}
 
killedBy: L10 payments — bill stage progression section advances to accounts
statusReason: expected undefined to be 'accounts' // Object.is equality

[Killed] BooleanLiteral
src/modules/payments/domain.ts:174:7
 
 export function nextStage(current: string): string {
   const next = STAGE_TRANSITIONS[current];
-  if (!next) throw new DomainError("STAGE_TERMINAL", `bill is already at final stage '${current}'`);
+  if (next) throw new DomainError("STAGE_TERMINAL", `bill is already at final stage '${current}'`);
   return next;
 }
killedBy: L10 payments — bill stage progression section advances to accounts
statusReason: [STAGE_TERMINAL] bill is already at final stage 'section'

[Killed] ConditionalExpression
src/modules/payments/domain.ts:174:7
 
 export function nextStage(current: string): string {
   const next = STAGE_TRANSITIONS[current];
-  if (!next) throw new DomainError("STAGE_TERMINAL", `bill is already at final stage '${current}'`);
+  if (true) throw new DomainError("STAGE_TERMINAL", `bill is already at final stage '${current}'`);
   return next;
 }
killedBy: L10 payments — bill stage progression section advances to accounts
statusReason: [STAGE_TERMINAL] bill is already at final stage 'section'
