[Survived] StringLiteral
src/modules/payroll/domain.ts:19:11
 
 export class DomainError extends Error {
   constructor(public code: string, message: string) {
-    super(`[${code}] ${message}`);
+    super(``);
     this.name = "DomainError";
   }

[Killed] ArrayDeclaration
src/modules/payroll/domain.ts:85:32
 }
 
 /** Deduction codes treated as "recovery" — subject to the protected-net floor. */
-const RECOVERY_CODES = new Set(["LOP", "LOAN_EMI", "ARREAR_RECOVERY"]);
+const RECOVERY_CODES = new Set([]);
 
 /**
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 0 to be greater than 0

[Survived] StringLiteral
src/modules/payroll/domain.ts:85:52
 }
 
 /** Deduction codes treated as "recovery" — subject to the protected-net floor. */
-const RECOVERY_CODES = new Set(["LOP", "LOAN_EMI", "ARREAR_RECOVERY"]);
+const RECOVERY_CODES = new Set(["LOP", "LOAN_EMI", ""]);
 
 /**

[NoCoverage] BlockStatement
src/modules/payroll/domain.ts:94:120
  * own flows, so the salary run must skip them. Defaults to eligible when no
  * policy is supplied, preserving pre-engagement behaviour. Pure.
  */
-export function isPayrollEligible(emp: { paymentRoute?: string | null; eligibleForPayroll?: boolean | null }): boolean {
-  if (emp.eligibleForPayroll === false) return false;
-  const route = (emp.paymentRoute ?? "payroll").toLowerCase();
-  return route === "payroll";
-}
+export function isPayrollEligible(emp: { paymentRoute?: string | null; eligibleForPayroll?: boolean | null }): boolean {}
 
 export interface SlipResult {

[NoCoverage] BooleanLiteral
src/modules/payroll/domain.ts:95:48
  * policy is supplied, preserving pre-engagement behaviour. Pure.
  */
 export function isPayrollEligible(emp: { paymentRoute?: string | null; eligibleForPayroll?: boolean | null }): boolean {
-  if (emp.eligibleForPayroll === false) return false;
+  if (emp.eligibleForPayroll === false) return true;
   const route = (emp.paymentRoute ?? "payroll").toLowerCase();
   return route === "payroll";

[NoCoverage] ConditionalExpression
src/modules/payroll/domain.ts:95:7
  * policy is supplied, preserving pre-engagement behaviour. Pure.
  */
 export function isPayrollEligible(emp: { paymentRoute?: string | null; eligibleForPayroll?: boolean | null }): boolean {
-  if (emp.eligibleForPayroll === false) return false;
+  if (true) return false;
   const route = (emp.paymentRoute ?? "payroll").toLowerCase();
   return route === "payroll";

[NoCoverage] LogicalOperator
src/modules/payroll/domain.ts:96:18
  */
 export function isPayrollEligible(emp: { paymentRoute?: string | null; eligibleForPayroll?: boolean | null }): boolean {
   if (emp.eligibleForPayroll === false) return false;
-  const route = (emp.paymentRoute ?? "payroll").toLowerCase();
+  const route = (emp.paymentRoute && "payroll").toLowerCase();
   return route === "payroll";
 }

[NoCoverage] MethodExpression
src/modules/payroll/domain.ts:96:17
  */
 export function isPayrollEligible(emp: { paymentRoute?: string | null; eligibleForPayroll?: boolean | null }): boolean {
   if (emp.eligibleForPayroll === false) return false;
-  const route = (emp.paymentRoute ?? "payroll").toLowerCase();
+  const route = (emp.paymentRoute ?? "payroll").toUpperCase();
   return route === "payroll";
 }

[NoCoverage] ConditionalExpression
src/modules/payroll/domain.ts:97:10
 export function isPayrollEligible(emp: { paymentRoute?: string | null; eligibleForPayroll?: boolean | null }): boolean {
   if (emp.eligibleForPayroll === false) return false;
   const route = (emp.paymentRoute ?? "payroll").toLowerCase();
-  return route === "payroll";
+  return true;
 }
 

[NoCoverage] ConditionalExpression
src/modules/payroll/domain.ts:97:10
 export function isPayrollEligible(emp: { paymentRoute?: string | null; eligibleForPayroll?: boolean | null }): boolean {
   if (emp.eligibleForPayroll === false) return false;
   const route = (emp.paymentRoute ?? "payroll").toLowerCase();
-  return route === "payroll";
+  return false;
 }
 

[Killed] BlockStatement
src/modules/payroll/domain.ts:135:47
 const GRATUITY_CAP = 200_000_000n; // 20 lakh INR
 
 /** Round a paise amount to the nearest whole rupee (round-half-up). */
-export function roundRupee(x: bigint): bigint {
-  if (x < 0n) return -roundRupee(-x);
-  return ((x + 50n) / 100n) * 100n;
-}
+export function roundRupee(x: bigint): bigint {}
 
 function pct(base: bigint, percent: bigint): bigint {
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] EqualityOperator
src/modules/payroll/domain.ts:136:7
 
 /** Round a paise amount to the nearest whole rupee (round-half-up). */
 export function roundRupee(x: bigint): bigint {
-  if (x < 0n) return -roundRupee(-x);
+  if (x <= 0n) return -roundRupee(-x);
   return ((x + 50n) / 100n) * 100n;
 }
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Maximum call stack size exceeded

[Killed] UnaryOperator
src/modules/payroll/domain.ts:136:22
 
 /** Round a paise amount to the nearest whole rupee (round-half-up). */
 export function roundRupee(x: bigint): bigint {
-  if (x < 0n) return -roundRupee(-x);
+  if (x < 0n) return +roundRupee(-x);
   return ((x + 50n) / 100n) * 100n;
 }
killedBy: L10 payroll — roundRupee is round-half-up and sign-symmetric negative amounts round symmetrically
statusReason: Cannot convert a BigInt value to a number

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:137:11
 /** Round a paise amount to the nearest whole rupee (round-half-up). */
 export function roundRupee(x: bigint): bigint {
   if (x < 0n) return -roundRupee(-x);
-  return ((x + 50n) / 100n) * 100n;
+  return ((x + 50n) * 100n) * 100n;
 }
 
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: expected 500000n to be 0n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:137:10
 /** Round a paise amount to the nearest whole rupee (round-half-up). */
 export function roundRupee(x: bigint): bigint {
   if (x < 0n) return -roundRupee(-x);
-  return ((x + 50n) / 100n) * 100n;
+  return (x + 50n) / 100n / 100n;
 }
 
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is present and exact when the rate is set
statusReason: expected 265n to be 2650000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:140:53
   return ((x + 50n) / 100n) * 100n;
 }
 
-function pct(base: bigint, percent: bigint): bigint {
-  return roundRupee((base * percent) / 100n);
-}
+function pct(base: bigint, percent: bigint): bigint {}
 
 /** 7th CPC HRA slab % by city class, escalating with DA threshold (50% / 100%). */
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:141:21
 }
 
 function pct(base: bigint, percent: bigint): bigint {
-  return roundRupee((base * percent) / 100n);
+  return roundRupee(base * percent * 100n);
 }
 
killedBy: L10 payroll — HRA slab by city class and DA tier (vs golden fixture) HRA amount equals slab pct of basic
statusReason: expected 9600000000n to be 960000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:141:22
 }
 
 function pct(base: bigint, percent: bigint): bigint {
-  return roundRupee((base * percent) / 100n);
+  return roundRupee((base / percent) / 100n);
 }
 
killedBy: L10 payroll — HRA slab by city class and DA tier (vs golden fixture) HRA amount equals slab pct of basic
statusReason: expected 1700n to be 960000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:145:77
 }
 
 /** 7th CPC HRA slab % by city class, escalating with DA threshold (50% / 100%). */
-export function hraSlabPct(cityClass: CityClass, daRateBps: bigint): bigint {
-  const tier = daRateBps >= 10000n ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
-  const table: Record<CityClass, [bigint, bigint, bigint]> = {
-    X: [24n, 27n, 30n],
-    Y: [16n, 18n, 20n],
-    Z: [8n, 9n, 10n],
-  };
-  return table[cityClass][tier];
-}
+export function hraSlabPct(cityClass: CityClass, daRateBps: bigint): bigint {}
 
 export function computeSlip(input: SlipInput): SlipResult {
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:146:16
 
 /** 7th CPC HRA slab % by city class, escalating with DA threshold (50% / 100%). */
 export function hraSlabPct(cityClass: CityClass, daRateBps: bigint): bigint {
-  const tier = daRateBps >= 10000n ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
+  const tier = false ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
   const table: Record<CityClass, [bigint, bigint, bigint]> = {
     X: [24n, 27n, 30n],
killedBy: L10 payroll — HRA slab by city class and DA tier (vs golden fixture) X at DA 100% -> 30%
statusReason: expected 27n to be 30n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:146:16
 
 /** 7th CPC HRA slab % by city class, escalating with DA threshold (50% / 100%). */
 export function hraSlabPct(cityClass: CityClass, daRateBps: bigint): bigint {
-  const tier = daRateBps >= 10000n ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
+  const tier = daRateBps > 10000n ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
   const table: Record<CityClass, [bigint, bigint, bigint]> = {
     X: [24n, 27n, 30n],
killedBy: L10 payroll — HRA slab by city class and DA tier (vs golden fixture) X at DA 100% -> 30%
statusReason: expected 27n to be 30n // Object.is equality

[Killed] ObjectLiteral
src/modules/payroll/domain.ts:147:62
 /** 7th CPC HRA slab % by city class, escalating with DA threshold (50% / 100%). */
 export function hraSlabPct(cityClass: CityClass, daRateBps: bigint): bigint {
   const tier = daRateBps >= 10000n ? 2 : daRateBps >= 5000n ? 1 : 0; // DA>=100% / >=50%
-  const table: Record<CityClass, [bigint, bigint, bigint]> = {
-    X: [24n, 27n, 30n],
-    Y: [16n, 18n, 20n],
-    Z: [8n, 9n, 10n],
-  };
+  const table: Record<CityClass, [bigint, bigint, bigint]> = {};
   return table[cityClass][tier];
 }
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
src/modules/payroll/domain.ts:159:17
   const {
     basicMinor,
     daRateBps = 0n,
-    cityClass = "X",
+    cityClass = "",
     ptMinor = 0n,
     components = [],
killedBy: payroll/domain — computeSlip() GPF GPF = 10% of basic+DA
statusReason: Cannot read properties of undefined (reading '1')

[Killed] BooleanLiteral
src/modules/payroll/domain.ts:164:19
     components = [],
     rawComponents = [],
     pensionScheme = "EPF",
-    statutoryPf = true,
+    statutoryPf = false,
     statutoryEsi = true,
     taxRegime = "new",
killedBy: L10 payroll — EPF 12% of (basic+DA) capped at the Rs 15,000 wage ceiling below the ceiling, PF is 12% of basic+DA
statusReason: expected 0n to be 120000n // Object.is equality

[Killed] BooleanLiteral
src/modules/payroll/domain.ts:165:20
     rawComponents = [],
     pensionScheme = "EPF",
     statutoryPf = true,
-    statutoryEsi = true,
+    statutoryEsi = false,
     taxRegime = "new",
     fyStartYear = 2025,
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employee ESI is 0.75% of gross when gross <= cap
statusReason: expected 0n to be 8100n // Object.is equality

[NoCoverage] StringLiteral
src/modules/payroll/domain.ts:166:17
     pensionScheme = "EPF",
     statutoryPf = true,
     statutoryEsi = true,
-    taxRegime = "new",
+    taxRegime = "",
     fyStartYear = 2025,
     declaration = {},

[Killed] ArrayDeclaration
src/modules/payroll/domain.ts:175:36
     ltcExemptTotalMinor = 0n,
   } = input;
 
-  const earnings: PayComponent[] = [];
+  const earnings: PayComponent[] = ["Stryker was here"];
   const deductions: PayComponent[] = [];
 
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] StringLiteral
src/modules/payroll/domain.ts:179:25
   const deductions: PayComponent[] = [];
 
   // Basic is the first earning.
-  earnings.push({ code: "BASIC", name: "Basic Pay", type: "earning", amountMinor: basicMinor });
+  earnings.push({ code: "", name: "Basic Pay", type: "earning", amountMinor: basicMinor });
 
   // Dearness Allowance = DA% of basic.
killedBy: L10 payroll — gross/deduction/net conservation BASIC/DA/HRA raw components are ignored (handled ahead of the loop)
statusReason: expected [] to have a length of 1 but got +0

[Survived] StringLiteral
src/modules/payroll/domain.ts:179:40
   const deductions: PayComponent[] = [];
 
   // Basic is the first earning.
-  earnings.push({ code: "BASIC", name: "Basic Pay", type: "earning", amountMinor: basicMinor });
+  earnings.push({ code: "BASIC", name: "", type: "earning", amountMinor: basicMinor });
 
   // Dearness Allowance = DA% of basic.

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:182:31
   earnings.push({ code: "BASIC", name: "Basic Pay", type: "earning", amountMinor: basicMinor });
 
   // Dearness Allowance = DA% of basic.
-  const daMinor = roundRupee((basicMinor * daRateBps) / 10000n);
+  const daMinor = roundRupee((basicMinor / daRateBps) / 10000n);
   if (daMinor > 0n) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
 
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Division by zero

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:182:30
   earnings.push({ code: "BASIC", name: "Basic Pay", type: "earning", amountMinor: basicMinor });
 
   // Dearness Allowance = DA% of basic.
-  const daMinor = roundRupee((basicMinor * daRateBps) / 10000n);
+  const daMinor = roundRupee(basicMinor * daRateBps * 10000n);
   if (daMinor > 0n) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
 
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is present and exact when the rate is set
statusReason: expected 265000000000000n to be 2650000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:183:7
 
   // Dearness Allowance = DA% of basic.
   const daMinor = roundRupee((basicMinor * daRateBps) / 10000n);
-  if (daMinor > 0n) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
+  if (daMinor <= 0n) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
 
   // HRA = city-class slab % of basic (escalates with DA threshold).
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: expected [ 'BASIC', 'DA', 'HRA' ] to not include 'DA'

[Killed] EqualityOperator
src/modules/payroll/domain.ts:183:7
 
   // Dearness Allowance = DA% of basic.
   const daMinor = roundRupee((basicMinor * daRateBps) / 10000n);
-  if (daMinor > 0n) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
+  if (daMinor >= 0n) earnings.push({ code: "DA", name: "Dearness Allowance", type: "earning", amountMinor: daMinor });
 
   // HRA = city-class slab % of basic (escalates with DA threshold).
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: expected [ 'BASIC', 'DA', 'HRA' ] to not include 'DA'

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:187:7
 
   // HRA = city-class slab % of basic (escalates with DA threshold).
   const hraMinor = pct(basicMinor, hraSlabPct(cityClass, daRateBps));
-  if (hraMinor > 0n) earnings.push({ code: "HRA", name: "House Rent Allowance", type: "earning", amountMinor: hraMinor });
+  if (false) earnings.push({ code: "HRA", name: "House Rent Allowance", type: "earning", amountMinor: hraMinor });
 
   // Evaluate remaining structure components (skip BASIC/DA/HRA — handled above).
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employee ESI is 0.75% of gross when gross <= cap
statusReason: expected 1000000n to be 1080000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:187:7
 
   // HRA = city-class slab % of basic (escalates with DA threshold).
   const hraMinor = pct(basicMinor, hraSlabPct(cityClass, daRateBps));
-  if (hraMinor > 0n) earnings.push({ code: "HRA", name: "House Rent Allowance", type: "earning", amountMinor: hraMinor });
+  if (hraMinor >= 0n) earnings.push({ code: "HRA", name: "House Rent Allowance", type: "earning", amountMinor: hraMinor });
 
   // Evaluate remaining structure components (skip BASIC/DA/HRA — handled above).
killedBy: L10 payroll — zero-valued lines are omitted from the slip HRA line is absent when the city slab yields 0 (basic 0)
statusReason: expected [ 'BASIC', 'HRA' ] to not include 'HRA'

[Killed] BlockStatement
src/modules/payroll/domain.ts:190:34
   if (hraMinor > 0n) earnings.push({ code: "HRA", name: "House Rent Allowance", type: "earning", amountMinor: hraMinor });
 
   // Evaluate remaining structure components (skip BASIC/DA/HRA — handled above).
-  for (const c of rawComponents) {
-    if (["BASIC", "DA", "HRA"].includes(c.code)) continue;
-    // pctOfBasic takes precedence over fixedMinor when configured and > 0
-    // (REL-009: was previously divided by 100n only, inflating every
-    // percentage-based component 100x). Math.round(pctOfBasic * 100) preserves
-    // 2 decimal places of the percentage as an integer, so the divisor must be
-    // 10_000n: 100 to undo that pre-multiplication, and 100 to convert percent
-    // to a fraction. E.g. pctOfBasic=12.5 -> round(1250) -> basic*1250/10_000.
-    const amt = c.pctOfBasic != null && c.pctOfBasic > 0
-      ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
-      : roundRupee(c.fixedMinor ?? 0n);
-    if (amt === 0n) continue;
-    (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
-  }
+  for (const c of rawComponents) {}
 
   // Ad-hoc components (LOP, EMI, arrears, reimbursements).
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:191:9
 
   // Evaluate remaining structure components (skip BASIC/DA/HRA — handled above).
   for (const c of rawComponents) {
-    if (["BASIC", "DA", "HRA"].includes(c.code)) continue;
+    if (false) continue;
     // pctOfBasic takes precedence over fixedMinor when configured and > 0
     // (REL-009: was previously divided by 100n only, inflating every
killedBy: L10 payroll — gross/deduction/net conservation BASIC/DA/HRA raw components are ignored (handled ahead of the loop)
statusReason: expected [ 'BASIC', 'BASIC' ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:191:9
 
   // Evaluate remaining structure components (skip BASIC/DA/HRA — handled above).
   for (const c of rawComponents) {
-    if (["BASIC", "DA", "HRA"].includes(c.code)) continue;
+    if (true) continue;
     // pctOfBasic takes precedence over fixedMinor when configured and > 0
     // (REL-009: was previously divided by 100n only, inflating every
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:198:41
     // 2 decimal places of the percentage as an integer, so the divisor must be
     // 10_000n: 100 to undo that pre-multiplication, and 100 to convert percent
     // to a fraction. E.g. pctOfBasic=12.5 -> round(1250) -> basic*1250/10_000.
-    const amt = c.pctOfBasic != null && c.pctOfBasic > 0
+    const amt = c.pctOfBasic != null && true
       ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
       : roundRupee(c.fixedMinor ?? 0n);
killedBy: L10 payroll — gross/deduction/net conservation fixedMinor is used when pctOfBasic is absent or zero
statusReason: expected undefined to be 111100n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:198:17
     // 2 decimal places of the percentage as an integer, so the divisor must be
     // 10_000n: 100 to undo that pre-multiplication, and 100 to convert percent
     // to a fraction. E.g. pctOfBasic=12.5 -> round(1250) -> basic*1250/10_000.
-    const amt = c.pctOfBasic != null && c.pctOfBasic > 0
+    const amt = c.pctOfBasic == null && c.pctOfBasic > 0
       ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
       : roundRupee(c.fixedMinor ?? 0n);
killedBy: L10 payroll — gross/deduction/net conservation pctOfBasic takes precedence over fixedMinor when both are present
statusReason: expected 1000000n to be 500000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:199:20
     // 10_000n: 100 to undo that pre-multiplication, and 100 to convert percent
     // to a fraction. E.g. pctOfBasic=12.5 -> round(1250) -> basic*1250/10_000.
     const amt = c.pctOfBasic != null && c.pctOfBasic > 0
-      ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
+      ? roundRupee(basicMinor * BigInt(Math.round(c.pctOfBasic * 100)) * 10_000n)
       : roundRupee(c.fixedMinor ?? 0n);
     if (amt === 0n) continue;
killedBy: L10 payroll — gross/deduction/net conservation pctOfBasic takes precedence over fixedMinor when both are present
statusReason: expected 50000000000000n to be 500000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:199:21
     // 10_000n: 100 to undo that pre-multiplication, and 100 to convert percent
     // to a fraction. E.g. pctOfBasic=12.5 -> round(1250) -> basic*1250/10_000.
     const amt = c.pctOfBasic != null && c.pctOfBasic > 0
-      ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
+      ? roundRupee((basicMinor / BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
       : roundRupee(c.fixedMinor ?? 0n);
     if (amt === 0n) continue;
killedBy: L10 payroll — gross/deduction/net conservation pctOfBasic takes precedence over fixedMinor when both are present
statusReason: expected undefined to be 500000n // Object.is equality

[Killed] LogicalOperator
src/modules/payroll/domain.ts:200:20
     // to a fraction. E.g. pctOfBasic=12.5 -> round(1250) -> basic*1250/10_000.
     const amt = c.pctOfBasic != null && c.pctOfBasic > 0
       ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
-      : roundRupee(c.fixedMinor ?? 0n);
+      : roundRupee(c.fixedMinor && 0n);
     if (amt === 0n) continue;
     (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:201:9
     const amt = c.pctOfBasic != null && c.pctOfBasic > 0
       ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
       : roundRupee(c.fixedMinor ?? 0n);
-    if (amt === 0n) continue;
+    if (false) continue;
     (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
   }
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected [ Array(4) ] to not include 'ZEROFIX'

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:201:9
     const amt = c.pctOfBasic != null && c.pctOfBasic > 0
       ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
       : roundRupee(c.fixedMinor ?? 0n);
-    if (amt === 0n) continue;
+    if (true) continue;
     (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
   }
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:202:6
       ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
       : roundRupee(c.fixedMinor ?? 0n);
     if (amt === 0n) continue;
-    (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
+    (c.type !== "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
   }
 
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:202:6
       ? roundRupee((basicMinor * BigInt(Math.round(c.pctOfBasic * 100))) / 10_000n)
       : roundRupee(c.fixedMinor ?? 0n);
     if (amt === 0n) continue;
-    (c.type === "earning" ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
+    (false ? earnings : deductions).push({ code: c.code, name: c.name, type: c.type, amountMinor: amt });
   }
 
killedBy: L10 payroll — zero-valued lines are omitted from the slip a raw component computing to 0 is skipped entirely
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:206:31
   }
 
   // Ad-hoc components (LOP, EMI, arrears, reimbursements).
-  for (const c of components) {
-    (c.type === "earning" ? earnings : deductions).push({ ...c, amountMinor: roundRupee(c.amountMinor) });
-  }
+  for (const c of components) {}
 
   const grossMinor = earnings.reduce((s, e) => s + e.amountMinor, 0n);
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:207:6
 
   // Ad-hoc components (LOP, EMI, arrears, reimbursements).
   for (const c of components) {
-    (c.type === "earning" ? earnings : deductions).push({ ...c, amountMinor: roundRupee(c.amountMinor) });
+    (c.type !== "earning" ? earnings : deductions).push({ ...c, amountMinor: roundRupee(c.amountMinor) });
   }
 
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:207:6
 
   // Ad-hoc components (LOP, EMI, arrears, reimbursements).
   for (const c of components) {
-    (c.type === "earning" ? earnings : deductions).push({ ...c, amountMinor: roundRupee(c.amountMinor) });
+    (true ? earnings : deductions).push({ ...c, amountMinor: roundRupee(c.amountMinor) });
   }
 
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: expected undefined to be 100000n // Object.is equality

[Killed] ArrowFunction
src/modules/payroll/domain.ts:210:38
     (c.type === "earning" ? earnings : deductions).push({ ...c, amountMinor: roundRupee(c.amountMinor) });
   }
 
-  const grossMinor = earnings.reduce((s, e) => s + e.amountMinor, 0n);
+  const grossMinor = earnings.reduce(() => undefined, 0n);
 
   // Pension contributions are computed on Basic + DA.
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:210:48
     (c.type === "earning" ? earnings : deductions).push({ ...c, amountMinor: roundRupee(c.amountMinor) });
   }
 
-  const grossMinor = earnings.reduce((s, e) => s + e.amountMinor, 0n);
+  const grossMinor = earnings.reduce((s, e) => s - e.amountMinor, 0n);
 
   // Pension contributions are computed on Basic + DA.
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employee ESI is 0.75% of gross when gross <= cap
statusReason: expected -1080000n to be 1080000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:213:23
   const grossMinor = earnings.reduce((s, e) => s + e.amountMinor, 0n);
 
   // Pension contributions are computed on Basic + DA.
-  const pensionBase = basicMinor + daMinor;
+  const pensionBase = basicMinor - daMinor;
 
   let pfEmployeeMinor = 0n, pfEmployerMinor = 0n, epsMinor = 0n, epfEmployerMinor = 0n;
killedBy: L10 — EPF computation (vs golden oracle) 12% of 15000 (both under cap)
statusReason: expected 72000 to be less than or equal to 100
