[Killed] ConditionalExpression
src/modules/payroll/domain.ts:218:7
   let pfEmployeeMinor = 0n, pfEmployerMinor = 0n, epsMinor = 0n, epfEmployerMinor = 0n;
   let gpfMinor = 0n, npsEmployeeMinor = 0n, npsEmployerMinor = 0n;
 
-  if (pensionScheme === "GPF") {
+  if (false) {
     gpfMinor = pct(pensionBase, GPF_PCT);
   } else if (pensionScheme === "NPS") {
killedBy: payroll/domain — computeSlip() GPF GPF = 10% of basic+DA
statusReason: expected 0n to be 750000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:218:7
   let pfEmployeeMinor = 0n, pfEmployerMinor = 0n, epsMinor = 0n, epfEmployerMinor = 0n;
   let gpfMinor = 0n, npsEmployeeMinor = 0n, npsEmployerMinor = 0n;
 
-  if (pensionScheme === "GPF") {
+  if (pensionScheme !== "GPF") {
     gpfMinor = pct(pensionBase, GPF_PCT);
   } else if (pensionScheme === "NPS") {
killedBy: L10 payroll — EPF 12% of (basic+DA) capped at the Rs 15,000 wage ceiling below the ceiling, PF is 12% of basic+DA
statusReason: expected 0n to be 120000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:220:39
 
   if (pensionScheme === "GPF") {
     gpfMinor = pct(pensionBase, GPF_PCT);
-  } else if (pensionScheme === "NPS") {
-    // Pension scheme is authoritative per-employee: an employee on NPS always
-    // gets NPS. (The engagement type gates payroll INCLUSION via isPayrollEligible
-    // — an excluded type never reaches computeSlip — not which pension scheme
-    // applies. Gating NPS by a type flag here previously zeroed pension entirely
-    // for an NPS-scheme employee of a type with statutoryNps=false, with no
-    // fall-through to EPF. statutoryNps is retained on SlipInput for callers but
-    // no longer suppresses a scheme-driven contribution.)
-    npsEmployeeMinor = pct(pensionBase, NPS_EMP_PCT);
-    npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
-  } else if (statutoryPf) {
+  } else if (pensionScheme === "NPS") {} else if (statutoryPf) {
     // Engagement gate: no EPF/EPS for a type whose policy excludes provident fund.
     const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
killedBy: payroll/domain — computeSlip() NPS NPS employee = 10%, employer = 14%
statusReason: expected 0n to be 750000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:220:14
 
   if (pensionScheme === "GPF") {
     gpfMinor = pct(pensionBase, GPF_PCT);
-  } else if (pensionScheme === "NPS") {
+  } else if (true) {
     // Pension scheme is authoritative per-employee: an employee on NPS always
     // gets NPS. (The engagement type gates payroll INCLUSION via isPayrollEligible
killedBy: L10 — EPF computation (vs golden oracle) 12% of 15000 (both under cap)
statusReason: expected 180000 to be less than or equal to 100

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:230:14
     // no longer suppresses a scheme-driven contribution.)
     npsEmployeeMinor = pct(pensionBase, NPS_EMP_PCT);
     npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
-  } else if (statutoryPf) {
+  } else if (false) {
     // Engagement gate: no EPF/EPS for a type whose policy excludes provident fund.
     const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
killedBy: payroll/domain — computeSlip() EPF EPF employee PF is capped at 12% of ₹15K
statusReason: expected 0n to be 180000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:230:27
     // no longer suppresses a scheme-driven contribution.)
     npsEmployeeMinor = pct(pensionBase, NPS_EMP_PCT);
     npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
-  } else if (statutoryPf) {
-    // Engagement gate: no EPF/EPS for a type whose policy excludes provident fund.
-    const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
-    pfEmployeeMinor = pct(pfWage, PF_PCT);
-    pfEmployerMinor = pct(pfWage, PF_PCT);
-    const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
-    epsMinor        = roundRupee((epsWage * 833n) / 10000n);
-    if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;
-    epfEmployerMinor = pfEmployerMinor - epsMinor;
-  }
+  } else if (statutoryPf) {}
 
   // Engagement gate: ESI only when the type's policy allows it AND under the cap.
killedBy: payroll/domain — computeSlip() EPF EPF employee PF is capped at 12% of ₹15K
statusReason: expected 0n to be 180000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:232:23
     npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
   } else if (statutoryPf) {
     // Engagement gate: no EPF/EPS for a type whose policy excludes provident fund.
-    const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
+    const pfWage    = false ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
killedBy: payroll/domain — computeSlip() EPF EPF employee PF is capped at 12% of ₹15K
statusReason: expected 1008000n to be 180000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:232:23
     npsEmployerMinor = pct(pensionBase, NPS_ER_PCT);
   } else if (statutoryPf) {
     // Engagement gate: no EPF/EPS for a type whose policy excludes provident fund.
-    const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
+    const pfWage    = pensionBase <= PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
killedBy: L10 — EPF computation (vs golden oracle) basic+DA 37500 > cap 15000 → 12% of 15000
statusReason: expected 270000 to be less than or equal to 100

[Survived] EqualityOperator
src/modules/payroll/domain.ts:235:23
     const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
-    const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
+    const epsWage   = pensionBase >= PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     epsMinor        = roundRupee((epsWage * 833n) / 10000n);
     if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:235:23
     const pfWage    = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
-    const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
+    const epsWage   = false ? PF_WAGE_CAP : pensionBase;
     epsMinor        = roundRupee((epsWage * 833n) / 10000n);
     if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:236:34
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
     const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
-    epsMinor        = roundRupee((epsWage * 833n) / 10000n);
+    epsMinor        = roundRupee(epsWage * 833n * 10000n);
     if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;
     epfEmployerMinor = pfEmployerMinor - epsMinor;

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:236:35
     pfEmployeeMinor = pct(pfWage, PF_PCT);
     pfEmployerMinor = pct(pfWage, PF_PCT);
     const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
-    epsMinor        = roundRupee((epsWage * 833n) / 10000n);
+    epsMinor        = roundRupee((epsWage / 833n) / 10000n);
     if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;
     epfEmployerMinor = pfEmployerMinor - epsMinor;

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:237:9
     pfEmployerMinor = pct(pfWage, PF_PCT);
     const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     epsMinor        = roundRupee((epsWage * 833n) / 10000n);
-    if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;
+    if (false) epsMinor = EPS_CAP;
     epfEmployerMinor = pfEmployerMinor - epsMinor;
   }

[Survived] EqualityOperator
src/modules/payroll/domain.ts:237:9
     pfEmployerMinor = pct(pfWage, PF_PCT);
     const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     epsMinor        = roundRupee((epsWage * 833n) / 10000n);
-    if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;
+    if (epsMinor <= EPS_CAP) epsMinor = EPS_CAP;
     epfEmployerMinor = pfEmployerMinor - epsMinor;
   }

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:238:24
     const epsWage   = pensionBase > PF_WAGE_CAP ? PF_WAGE_CAP : pensionBase;
     epsMinor        = roundRupee((epsWage * 833n) / 10000n);
     if (epsMinor > EPS_CAP) epsMinor = EPS_CAP;
-    epfEmployerMinor = pfEmployerMinor - epsMinor;
+    epfEmployerMinor = pfEmployerMinor + epsMinor;
   }
 

[Killed] LogicalOperator
src/modules/payroll/domain.ts:242:28
   }
 
   // Engagement gate: ESI only when the type's policy allows it AND under the cap.
-  const esiApplicable    = statutoryEsi && grossMinor <= ESI_CAP;
+  const esiApplicable    = statutoryEsi || grossMinor <= ESI_CAP;
   const esiMinor         = esiApplicable ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
   const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling ESI is zero one paise above the cap
statusReason: expected 15800n to be 0n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:242:44
   }
 
   // Engagement gate: ESI only when the type's policy allows it AND under the cap.
-  const esiApplicable    = statutoryEsi && grossMinor <= ESI_CAP;
+  const esiApplicable    = statutoryEsi && grossMinor > ESI_CAP;
   const esiMinor         = esiApplicable ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
   const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employee ESI is 0.75% of gross when gross <= cap
statusReason: expected 0n to be 8100n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:243:55
 
   // Engagement gate: ESI only when the type's policy allows it AND under the cap.
   const esiApplicable    = statutoryEsi && grossMinor <= ESI_CAP;
-  const esiMinor         = esiApplicable ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
+  const esiMinor         = esiApplicable ? roundRupee(grossMinor * 75n * 10000n) : 0n;
   const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
 
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employee ESI is 0.75% of gross when gross <= cap
statusReason: expected 810000000000n to be 8100n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:243:56
 
   // Engagement gate: ESI only when the type's policy allows it AND under the cap.
   const esiApplicable    = statutoryEsi && grossMinor <= ESI_CAP;
-  const esiMinor         = esiApplicable ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
+  const esiMinor         = esiApplicable ? roundRupee((grossMinor / 75n) / 10000n) : 0n;
   const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
 
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employee ESI is 0.75% of gross when gross <= cap
statusReason: expected 0n to be 8100n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:244:55
   // Engagement gate: ESI only when the type's policy allows it AND under the cap.
   const esiApplicable    = statutoryEsi && grossMinor <= ESI_CAP;
   const esiMinor         = esiApplicable ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
-  const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
+  const esiEmployerMinor = esiApplicable ? roundRupee(grossMinor * 325n * 10000n) : 0n;
 
   const pt = roundRupee(ptMinor);
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employer ESI is 3.25% of gross when gross <= cap
statusReason: expected 3510000000000n to be 35100n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:244:56
   // Engagement gate: ESI only when the type's policy allows it AND under the cap.
   const esiApplicable    = statutoryEsi && grossMinor <= ESI_CAP;
   const esiMinor         = esiApplicable ? roundRupee((grossMinor * 75n) / 10000n) : 0n;
-  const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
+  const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor / 325n) / 10000n) : 0n;
 
   const pt = roundRupee(ptMinor);
killedBy: L10 payroll — ESI applies only at or below the Rs 21,000 gross ceiling employer ESI is 3.25% of gross when gross <= cap
statusReason: expected 0n to be 35100n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:247:7
   const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
 
   const pt = roundRupee(ptMinor);
-  if (pt > 0n) deductions.push({ code: "PT", name: "Professional Tax", type: "deduction", amountMinor: pt });
+  if (pt <= 0n) deductions.push({ code: "PT", name: "Professional Tax", type: "deduction", amountMinor: pt });
 
   // Monthly TDS (Sec 192) on real annual TAXABLE income: regime-aware, with
killedBy: L10 payroll — professional tax line PT line is omitted when ptMinor is 0
statusReason: expected [ 'PT' ] to not include 'PT'

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:247:7
   const esiEmployerMinor = esiApplicable ? roundRupee((grossMinor * 325n) / 10000n) : 0n;
 
   const pt = roundRupee(ptMinor);
-  if (pt > 0n) deductions.push({ code: "PT", name: "Professional Tax", type: "deduction", amountMinor: pt });
+  if (false) deductions.push({ code: "PT", name: "Professional Tax", type: "deduction", amountMinor: pt });
 
   // Monthly TDS (Sec 192) on real annual TAXABLE income: regime-aware, with
killedBy: L10 payroll — professional tax line PT line is present and rounded to the rupee when set
statusReason: expected undefined to be 20000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:251:23
 
   // Monthly TDS (Sec 192) on real annual TAXABLE income: regime-aware, with
   // Sec 16 std deduction + PT, Sec 10(13A) HRA exemption, and Chapter VI-A (old regime).
-  const annualGross = grossMinor * 12n;
+  const annualGross = grossMinor / 12n;
   // Additions taxed under BOTH regimes (added before slabs):
   //  - perquisites Sec 17(2) (current employer, not part of cash gross),
killedBy: L10 payroll — declared extra income raises annual taxable income perquisites add to taxable income
statusReason: expected 2950000n to be 10000000n // Object.is equality

[Killed] LogicalOperator
src/modules/payroll/domain.ts:256:27
   //  - perquisites Sec 17(2) (current employer, not part of cash gross),
   //  - previous-employer taxable salary for the FY (Sec 192(2)),
   //  - income from other sources.
-  const perqMinor       = declaration.perquisitesMinor ?? 0n;
+  const perqMinor       = declaration.perquisitesMinor && 0n;
   const prevEmpSalMinor = declaration.prevEmployerSalaryMinor ?? 0n;
   const otherSrcMinor   = declaration.otherSourcesIncomeMinor ?? 0n;
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] LogicalOperator
src/modules/payroll/domain.ts:257:27
   //  - previous-employer taxable salary for the FY (Sec 192(2)),
   //  - income from other sources.
   const perqMinor       = declaration.perquisitesMinor ?? 0n;
-  const prevEmpSalMinor = declaration.prevEmployerSalaryMinor ?? 0n;
+  const prevEmpSalMinor = declaration.prevEmployerSalaryMinor && 0n;
   const otherSrcMinor   = declaration.otherSourcesIncomeMinor ?? 0n;
   const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] LogicalOperator
src/modules/payroll/domain.ts:258:27
   //  - income from other sources.
   const perqMinor       = declaration.perquisitesMinor ?? 0n;
   const prevEmpSalMinor = declaration.prevEmployerSalaryMinor ?? 0n;
-  const otherSrcMinor   = declaration.otherSourcesIncomeMinor ?? 0n;
+  const otherSrcMinor   = declaration.otherSourcesIncomeMinor && 0n;
   const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
   let annualTaxableMinor: bigint;
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:259:27
   const perqMinor       = declaration.perquisitesMinor ?? 0n;
   const prevEmpSalMinor = declaration.prevEmployerSalaryMinor ?? 0n;
   const otherSrcMinor   = declaration.otherSourcesIncomeMinor ?? 0n;
-  const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
+  const extraIncome     = perqMinor + prevEmpSalMinor - otherSrcMinor;
   let annualTaxableMinor: bigint;
   if (taxRegime === "old") {
killedBy: L10 payroll — declared extra income raises annual taxable income other-sources income adds to taxable income
statusReason: expected 52300000n to be 62300000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:259:27
   const perqMinor       = declaration.perquisitesMinor ?? 0n;
   const prevEmpSalMinor = declaration.prevEmployerSalaryMinor ?? 0n;
   const otherSrcMinor   = declaration.otherSourcesIncomeMinor ?? 0n;
-  const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
+  const extraIncome     = perqMinor - prevEmpSalMinor + otherSrcMinor;
   let annualTaxableMinor: bigint;
   if (taxRegime === "old") {
killedBy: L10 payroll — declared extra income raises annual taxable income previous-employer salary adds to taxable income (Sec 192(2))
statusReason: expected 32300000n to be 82300000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:261:28
   const otherSrcMinor   = declaration.otherSourcesIncomeMinor ?? 0n;
   const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
   let annualTaxableMinor: bigint;
-  if (taxRegime === "old") {
-    const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
-    const hraReceivedAnnual = hraMinor * 12n;
-    const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
-    const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
-    const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
-    const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
-    const other = declaration.otherDedMinor ?? 0n;
-    annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
-  } else {
+  if (taxRegime === "old") {} else {
     annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
   }
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:261:7
   const otherSrcMinor   = declaration.otherSourcesIncomeMinor ?? 0n;
   const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
   let annualTaxableMinor: bigint;
-  if (taxRegime === "old") {
+  if (true) {
     const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
     const hraReceivedAnnual = hraMinor * 12n;
killedBy: L10 payroll — declared extra income raises annual taxable income annual gross is 12x the monthly gross (not a division)
statusReason: expected 59800000n to be 57300000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:262:31
   const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
   let annualTaxableMinor: bigint;
   if (taxRegime === "old") {
-    const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
+    const salaryHraAnnual   = (basicMinor + daMinor) / 12n;
     const hraReceivedAnnual = hraMinor * 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
killedBy: L10 payroll — old regime deductions (previously uncovered) Sec 10(13A) HRA exemption is the least of the three statutory limits
statusReason: expected 208333n to be 14400000n // Object.is equality

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:262:32
   const extraIncome     = perqMinor + prevEmpSalMinor + otherSrcMinor;
   let annualTaxableMinor: bigint;
   if (taxRegime === "old") {
-    const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
+    const salaryHraAnnual   = (basicMinor - daMinor) * 12n;
     const hraReceivedAnnual = hraMinor * 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:263:31
   let annualTaxableMinor: bigint;
   if (taxRegime === "old") {
     const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
-    const hraReceivedAnnual = hraMinor * 12n;
+    const hraReceivedAnnual = hraMinor / 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
killedBy: L10 payroll — old regime deductions (previously uncovered) Sec 10(13A) HRA exemption is the least of the three statutory limits
statusReason: expected 100000n to be 14400000n // Object.is equality

[Killed] LogicalOperator
src/modules/payroll/domain.ts:264:31
   if (taxRegime === "old") {
     const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
     const hraReceivedAnnual = hraMinor * 12n;
-    const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
+    const rentAnnual        = declaration.rentPaidAnnualMinor && 0n;
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:265:89
     const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
     const hraReceivedAnnual = hraMinor * 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
-    const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
+    const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, true);
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:265:89
     const salaryHraAnnual   = (basicMinor + daMinor) * 12n;
     const hraReceivedAnnual = hraMinor * 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
-    const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
+    const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, false);
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:266:62
     const hraReceivedAnnual = hraMinor * 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
-    const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
+    const d80c = declaration.ded80cMinor ?? 0n; const c80c = true ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: expected 66900000 to be less than 54400000

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:266:62
     const hraReceivedAnnual = hraMinor * 12n;
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
-    const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
+    const d80c = declaration.ded80cMinor ?? 0n; const c80c = false ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
killedBy: L10 payroll — old regime deductions (previously uncovered) 80C reduces taxable income and is capped at Rs 1,50,000
statusReason: expected 0n to be 54400000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:267:62
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
-    const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
+    const d80d = declaration.ded80dMinor ?? 0n; const c80d = true ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
     annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: expected 66900000 to be less than 61900000

[Killed] LogicalOperator
src/modules/payroll/domain.ts:267:18
     const rentAnnual        = declaration.rentPaidAnnualMinor ?? 0n;
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
-    const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
+    const d80d = declaration.ded80dMinor && 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
     annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] LogicalOperator
src/modules/payroll/domain.ts:268:19
     const hraExempt = hraExemptionMinor(salaryHraAnnual, hraReceivedAnnual, rentAnnual, cityClass === "X");
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
-    const other = declaration.otherDedMinor ?? 0n;
+    const other = declaration.otherDedMinor && 0n;
     annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
   } else {
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:269:26
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
-    annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
+    annualTaxableMinor = annualGross + extraIncome + 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
   } else {
     annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: expected 12500000n to be 2500000n // Object.is equality
