[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:269:26
     const d80c = declaration.ded80cMinor ?? 0n; const c80c = d80c > 15_000_000n ? 15_000_000n : d80c;
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
-    annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
+    annualTaxableMinor = annualGross + extraIncome - 5_000_000n + hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
   } else {
     annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
killedBy: L10 payroll — old regime deductions (previously uncovered) Sec 10(13A) HRA exemption is the least of the three statutory limits
statusReason: expected -14400000n to be 14400000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:270:10
     const d80d = declaration.ded80dMinor ?? 0n; const c80d = d80d > 7_500_000n ? 7_500_000n : d80d;
     const other = declaration.otherDedMinor ?? 0n;
     annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
-  } else {
-    annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
-  }
+  } else {}
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
killedBy: L10 payroll — zero-valued lines are omitted from the slip DA line is absent when the DA rate is 0
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:271:26
     const other = declaration.otherDedMinor ?? 0n;
     annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
   } else {
-    annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
+    annualTaxableMinor = annualGross + extraIncome + 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
   }
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
killedBy: L10 payroll — declared extra income raises annual taxable income annual gross is 12x the monthly gross (not a division)
statusReason: expected 72300000n to be 57300000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:271:26
     const other = declaration.otherDedMinor ?? 0n;
     annualTaxableMinor = annualGross + extraIncome - 5_000_000n - hraExempt - c80c - c80d - other - pt * 12n - ltcExemptTotalMinor;
   } else {
-    annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
+    annualTaxableMinor = annualGross - extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
   }
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
killedBy: L10 payroll — declared extra income raises annual taxable income perquisites add to taxable income
statusReason: expected 47300000n to be 67300000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:273:7
   } else {
     annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
   }
-  if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
+  if (true) annualTaxableMinor = 0n;
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
   const tdsMinor = monthsRemaining != null
killedBy: L10 payroll — declared extra income raises annual taxable income perquisites add to taxable income
statusReason: expected 0n to be 10000000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:273:7
   } else {
     annualTaxableMinor = annualGross + extraIncome - 7_500_000n - ltcExemptTotalMinor; // new regime: standard deduction + LTC exempt
   }
-  if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
+  if (annualTaxableMinor >= 0n) annualTaxableMinor = 0n;
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
   const tdsMinor = monthsRemaining != null
killedBy: L10 payroll — declared extra income raises annual taxable income perquisites add to taxable income
statusReason: expected 0n to be 10000000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:275:20
   }
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
-  const tdsMinor = monthsRemaining != null
+  const tdsMinor = true
     ? trueUpTdsMinor(annualTaxMinor, tdsYtdMinor ?? 0n, monthsRemaining)         // Sec 192 true-up
     : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] EqualityOperator
src/modules/payroll/domain.ts:275:20
   }
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
-  const tdsMinor = monthsRemaining != null
+  const tdsMinor = monthsRemaining == null
     ? trueUpTdsMinor(annualTaxMinor, tdsYtdMinor ?? 0n, monthsRemaining)         // Sec 192 true-up
     : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
killedBy: L10 payroll — old regime deductions (previously uncovered) old regime applies a Rs 50,000 standard deduction, new regime Rs 75,000
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[NoCoverage] LogicalOperator
src/modules/payroll/domain.ts:276:38
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
   const tdsMinor = monthsRemaining != null
-    ? trueUpTdsMinor(annualTaxMinor, tdsYtdMinor ?? 0n, monthsRemaining)         // Sec 192 true-up
+    ? trueUpTdsMinor(annualTaxMinor, tdsYtdMinor && 0n, monthsRemaining)         // Sec 192 true-up
     : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
 

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:277:8
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
   const tdsMinor = monthsRemaining != null
     ? trueUpTdsMinor(annualTaxMinor, tdsYtdMinor ?? 0n, monthsRemaining)         // Sec 192 true-up
-    : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
+    : (annualTaxMinor * 100n / 12n) * 100n;                                       // flat /12 fallback
 
   // Statutory pension/insurance/tax deductions are never floored.

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:277:7
   const annualTaxMinor = annualTaxFromTaxableMinor(annualTaxableMinor, taxRegime, fyStartYear);
   const tdsMinor = monthsRemaining != null
     ? trueUpTdsMinor(annualTaxMinor, tdsYtdMinor ?? 0n, monthsRemaining)         // Sec 192 true-up
-    : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
+    : annualTaxMinor / 100n / 12n / 100n;                                       // flat /12 fallback
 
   // Statutory pension/insurance/tax deductions are never floored.

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:280:31
     : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
 
   // Statutory pension/insurance/tax deductions are never floored.
-  const statutoryDeductions = pfEmployeeMinor + esiMinor + tdsMinor + gpfMinor + npsEmployeeMinor;
+  const statutoryDeductions = pfEmployeeMinor + esiMinor + tdsMinor + gpfMinor - npsEmployeeMinor;
 
   // Split ad-hoc deductions into recovery (floor-capped) and fixed (e.g. PT, and

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:280:31
     : (annualTaxMinor / 100n / 12n) * 100n;                                       // flat /12 fallback
 
   // Statutory pension/insurance/tax deductions are never floored.
-  const statutoryDeductions = pfEmployeeMinor + esiMinor + tdsMinor + gpfMinor + npsEmployeeMinor;
+  const statutoryDeductions = pfEmployeeMinor - esiMinor + tdsMinor + gpfMinor + npsEmployeeMinor;
 
   // Split ad-hoc deductions into recovery (floor-capped) and fixed (e.g. PT, and

[Survived] MethodExpression
src/modules/payroll/domain.ts:284:29
 
   // Split ad-hoc deductions into recovery (floor-capped) and fixed (e.g. PT, and
   // any structure-defined deduction). Fixed deductions are not subject to the floor.
-  const recoveryRequested = deductions
-    .filter((d) => RECOVERY_CODES.has(d.code))
+  const recoveryRequested = deductions
     .reduce((s, d) => s + d.amountMinor, 0n);
   const fixedAdHoc = deductions

[Killed] ArrowFunction
src/modules/payroll/domain.ts:285:13
   // Split ad-hoc deductions into recovery (floor-capped) and fixed (e.g. PT, and
   // any structure-defined deduction). Fixed deductions are not subject to the floor.
   const recoveryRequested = deductions
-    .filter((d) => RECOVERY_CODES.has(d.code))
+    .filter(() => undefined)
     .reduce((s, d) => s + d.amountMinor, 0n);
   const fixedAdHoc = deductions
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
src/modules/payroll/domain.ts:286:13
   // any structure-defined deduction). Fixed deductions are not subject to the floor.
   const recoveryRequested = deductions
     .filter((d) => RECOVERY_CODES.has(d.code))
-    .reduce((s, d) => s + d.amountMinor, 0n);
+    .reduce(() => undefined, 0n);
   const fixedAdHoc = deductions
     .filter((d) => !RECOVERY_CODES.has(d.code))
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:286:23
   // any structure-defined deduction). Fixed deductions are not subject to the floor.
   const recoveryRequested = deductions
     .filter((d) => RECOVERY_CODES.has(d.code))
-    .reduce((s, d) => s + d.amountMinor, 0n);
+    .reduce((s, d) => s - d.amountMinor, 0n);
   const fixedAdHoc = deductions
     .filter((d) => !RECOVERY_CODES.has(d.code))
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
src/modules/payroll/domain.ts:287:22
   const recoveryRequested = deductions
     .filter((d) => RECOVERY_CODES.has(d.code))
     .reduce((s, d) => s + d.amountMinor, 0n);
-  const fixedAdHoc = deductions
-    .filter((d) => !RECOVERY_CODES.has(d.code))
+  const fixedAdHoc = deductions
     .reduce((s, d) => s + d.amountMinor, 0n);
 
killedBy: L10 payroll — protected net floor caps recovery and carries the rest net pay never falls below the protected floor
statusReason: expected 0 to be greater than or equal to 2000000

[Killed] BooleanLiteral
src/modules/payroll/domain.ts:288:20
     .filter((d) => RECOVERY_CODES.has(d.code))
     .reduce((s, d) => s + d.amountMinor, 0n);
   const fixedAdHoc = deductions
-    .filter((d) => !RECOVERY_CODES.has(d.code))
+    .filter((d) => RECOVERY_CODES.has(d.code))
     .reduce((s, d) => s + d.amountMinor, 0n);
 
killedBy: L10 payroll — protected net floor caps recovery and carries the rest net pay never falls below the protected floor
statusReason: expected 0 to be greater than or equal to 2000000

[Survived] ArrowFunction
src/modules/payroll/domain.ts:288:13
     .filter((d) => RECOVERY_CODES.has(d.code))
     .reduce((s, d) => s + d.amountMinor, 0n);
   const fixedAdHoc = deductions
-    .filter((d) => !RECOVERY_CODES.has(d.code))
+    .filter(() => undefined)
     .reduce((s, d) => s + d.amountMinor, 0n);
 

[Killed] ArrowFunction
src/modules/payroll/domain.ts:289:13
     .reduce((s, d) => s + d.amountMinor, 0n);
   const fixedAdHoc = deductions
     .filter((d) => !RECOVERY_CODES.has(d.code))
-    .reduce((s, d) => s + d.amountMinor, 0n);
+    .reduce(() => undefined, 0n);
 
   // Headroom available for recovery after gross less all non-recovery deductions,
killedBy: L10 payroll — professional tax line PT line is present and rounded to the rupee when set
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:289:23
     .reduce((s, d) => s + d.amountMinor, 0n);
   const fixedAdHoc = deductions
     .filter((d) => !RECOVERY_CODES.has(d.code))
-    .reduce((s, d) => s + d.amountMinor, 0n);
+    .reduce((s, d) => s - d.amountMinor, 0n);
 
   // Headroom available for recovery after gross less all non-recovery deductions,

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:293:25
 
   // Headroom available for recovery after gross less all non-recovery deductions,
   // keeping net at or above the protected floor.
-  const nonRecovery   = statutoryDeductions + fixedAdHoc;
+  const nonRecovery   = statutoryDeductions - fixedAdHoc;
   const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
   const recoveryCap   = headroom < 0n ? 0n : headroom;

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:294:25
   // Headroom available for recovery after gross less all non-recovery deductions,
   // keeping net at or above the protected floor.
   const nonRecovery   = statutoryDeductions + fixedAdHoc;
-  const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
+  const headroom      = grossMinor - nonRecovery + protectedNetFloorMinor;
   const recoveryCap   = headroom < 0n ? 0n : headroom;
   const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest net pay never falls below the protected floor
statusReason: expected 0 to be greater than or equal to 2000000

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:294:25
   // Headroom available for recovery after gross less all non-recovery deductions,
   // keeping net at or above the protected floor.
   const nonRecovery   = statutoryDeductions + fixedAdHoc;
-  const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
+  const headroom      = grossMinor + nonRecovery - protectedNetFloorMinor;
   const recoveryCap   = headroom < 0n ? 0n : headroom;
   const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest net pay never falls below the protected floor
statusReason: expected 1640000 to be greater than or equal to 2000000

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:295:25
   // keeping net at or above the protected floor.
   const nonRecovery   = statutoryDeductions + fixedAdHoc;
   const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
-  const recoveryCap   = headroom < 0n ? 0n : headroom;
+  const recoveryCap   = false ? 0n : headroom;
   const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
   const recoveryCarryForwardMinor = recoveryRequested - recoveryApplied;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest a fully-trimmed recovery line is dropped from the slip
statusReason: expected 144780000n to be 50000000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:295:25
   // keeping net at or above the protected floor.
   const nonRecovery   = statutoryDeductions + fixedAdHoc;
   const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
-  const recoveryCap   = headroom < 0n ? 0n : headroom;
+  const recoveryCap   = true ? 0n : headroom;
   const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
   const recoveryCarryForwardMinor = recoveryRequested - recoveryApplied;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: expected 100000n to be 0n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:296:27
   const nonRecovery   = statutoryDeductions + fixedAdHoc;
   const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
   const recoveryCap   = headroom < 0n ? 0n : headroom;
-  const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
+  const recoveryApplied = true ? recoveryCap : recoveryRequested;
   const recoveryCarryForwardMinor = recoveryRequested - recoveryApplied;
 
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: expected -5120000n to be 0n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:296:27
   const nonRecovery   = statutoryDeductions + fixedAdHoc;
   const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
   const recoveryCap   = headroom < 0n ? 0n : headroom;
-  const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
+  const recoveryApplied = recoveryRequested <= recoveryCap ? recoveryCap : recoveryRequested;
   const recoveryCarryForwardMinor = recoveryRequested - recoveryApplied;
 
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: expected -5120000n to be 0n // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:297:37
   const headroom      = grossMinor - nonRecovery - protectedNetFloorMinor;
   const recoveryCap   = headroom < 0n ? 0n : headroom;
   const recoveryApplied = recoveryRequested > recoveryCap ? recoveryCap : recoveryRequested;
-  const recoveryCarryForwardMinor = recoveryRequested - recoveryApplied;
+  const recoveryCarryForwardMinor = recoveryRequested + recoveryApplied;
 
   // If recovery was capped, scale down the recovery deduction line items so the
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery within headroom is applied in full with no carry-forward
statusReason: expected 200000n to be 0n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:301:7
 
   // If recovery was capped, scale down the recovery deduction line items so the
   // persisted slip reflects what was actually withheld (carry the remainder).
-  if (recoveryCarryForwardMinor > 0n && recoveryRequested > 0n) {
+  if (false) {
     let remainingToTrim = recoveryCarryForwardMinor;
     // Trim from the largest recovery lines first (deterministic by amount desc).
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 7220000n to be 6220000n // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:301:65
 
   // If recovery was capped, scale down the recovery deduction line items so the
   // persisted slip reflects what was actually withheld (carry the remainder).
-  if (recoveryCarryForwardMinor > 0n && recoveryRequested > 0n) {
-    let remainingToTrim = recoveryCarryForwardMinor;
-    // Trim from the largest recovery lines first (deterministic by amount desc).
-    const recoveryLines = deductions
-      .filter((d) => RECOVERY_CODES.has(d.code))
-      .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
-    for (const line of recoveryLines) {
-      if (remainingToTrim <= 0n) break;
-      const trim = line.amountMinor < remainingToTrim ? line.amountMinor : remainingToTrim;
-      line.amountMinor -= trim;
-      remainingToTrim -= trim;
-    }
-    // Drop fully-trimmed recovery lines.
-    for (let i = deductions.length - 1; i >= 0; i--) {
-      const d = deductions[i]!;
-      if (RECOVERY_CODES.has(d.code) && d.amountMinor === 0n) deductions.splice(i, 1);
-    }
-  }
+  if (recoveryCarryForwardMinor > 0n && recoveryRequested > 0n) {}
 
   const totalDeductions = nonRecovery + recoveryApplied;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 7220000n to be 6220000n // Object.is equality

[Survived] MethodExpression
src/modules/payroll/domain.ts:304:27
   if (recoveryCarryForwardMinor > 0n && recoveryRequested > 0n) {
     let remainingToTrim = recoveryCarryForwardMinor;
     // Trim from the largest recovery lines first (deterministic by amount desc).
-    const recoveryLines = deductions
-      .filter((d) => RECOVERY_CODES.has(d.code))
+    const recoveryLines = deductions
       .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
     for (const line of recoveryLines) {

[Survived] MethodExpression
src/modules/payroll/domain.ts:304:27
   if (recoveryCarryForwardMinor > 0n && recoveryRequested > 0n) {
     let remainingToTrim = recoveryCarryForwardMinor;
     // Trim from the largest recovery lines first (deterministic by amount desc).
-    const recoveryLines = deductions
-      .filter((d) => RECOVERY_CODES.has(d.code))
-      .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
+    const recoveryLines = deductions.filter(d => RECOVERY_CODES.has(d.code));
     for (const line of recoveryLines) {
       if (remainingToTrim <= 0n) break;

[Killed] ArrowFunction
src/modules/payroll/domain.ts:305:15
     let remainingToTrim = recoveryCarryForwardMinor;
     // Trim from the largest recovery lines first (deterministic by amount desc).
     const recoveryLines = deductions
-      .filter((d) => RECOVERY_CODES.has(d.code))
+      .filter(() => undefined)
       .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
     for (const line of recoveryLines) {
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 7220000n to be 6220000n // Object.is equality

[NoCoverage] EqualityOperator
src/modules/payroll/domain.ts:306:24
     // Trim from the largest recovery lines first (deterministic by amount desc).
     const recoveryLines = deductions
       .filter((d) => RECOVERY_CODES.has(d.code))
-      .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
+      .sort((a, b) => (a.amountMinor <= b.amountMinor ? 1 : -1));
     for (const line of recoveryLines) {
       if (remainingToTrim <= 0n) break;

[NoCoverage] UnaryOperator
src/modules/payroll/domain.ts:306:60
     // Trim from the largest recovery lines first (deterministic by amount desc).
     const recoveryLines = deductions
       .filter((d) => RECOVERY_CODES.has(d.code))
-      .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
+      .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : +1));
     for (const line of recoveryLines) {
       if (remainingToTrim <= 0n) break;

[Killed] BlockStatement
src/modules/payroll/domain.ts:307:39
     const recoveryLines = deductions
       .filter((d) => RECOVERY_CODES.has(d.code))
       .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
-    for (const line of recoveryLines) {
-      if (remainingToTrim <= 0n) break;
-      const trim = line.amountMinor < remainingToTrim ? line.amountMinor : remainingToTrim;
-      line.amountMinor -= trim;
-      remainingToTrim -= trim;
-    }
+    for (const line of recoveryLines) {}
     // Drop fully-trimmed recovery lines.
     for (let i = deductions.length - 1; i >= 0; i--) {
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 7220000n to be 6220000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:308:11
       .filter((d) => RECOVERY_CODES.has(d.code))
       .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
     for (const line of recoveryLines) {
-      if (remainingToTrim <= 0n) break;
+      if (remainingToTrim > 0n) break;
       const trim = line.amountMinor < remainingToTrim ? line.amountMinor : remainingToTrim;
       line.amountMinor -= trim;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 7220000n to be 6220000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:308:11
       .filter((d) => RECOVERY_CODES.has(d.code))
       .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
     for (const line of recoveryLines) {
-      if (remainingToTrim <= 0n) break;
+      if (true) break;
       const trim = line.amountMinor < remainingToTrim ? line.amountMinor : remainingToTrim;
       line.amountMinor -= trim;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 7220000n to be 6220000n // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:309:20
       .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
     for (const line of recoveryLines) {
       if (remainingToTrim <= 0n) break;
-      const trim = line.amountMinor < remainingToTrim ? line.amountMinor : remainingToTrim;
+      const trim = true ? line.amountMinor : remainingToTrim;
       line.amountMinor -= trim;
       remainingToTrim -= trim;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 1000000n to be 6220000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:309:20
       .sort((a, b) => (a.amountMinor < b.amountMinor ? 1 : -1));
     for (const line of recoveryLines) {
       if (remainingToTrim <= 0n) break;
-      const trim = line.amountMinor < remainingToTrim ? line.amountMinor : remainingToTrim;
+      const trim = line.amountMinor >= remainingToTrim ? line.amountMinor : remainingToTrim;
       line.amountMinor -= trim;
       remainingToTrim -= trim;
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 1000000n to be 6220000n // Object.is equality

[Killed] AssignmentOperator
src/modules/payroll/domain.ts:310:7
     for (const line of recoveryLines) {
       if (remainingToTrim <= 0n) break;
       const trim = line.amountMinor < remainingToTrim ? line.amountMinor : remainingToTrim;
-      line.amountMinor -= trim;
+      line.amountMinor += trim;
       remainingToTrim -= trim;
     }
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 8220000n to be 6220000n // Object.is equality

[Survived] AssignmentOperator
src/modules/payroll/domain.ts:311:7
       if (remainingToTrim <= 0n) break;
       const trim = line.amountMinor < remainingToTrim ? line.amountMinor : remainingToTrim;
       line.amountMinor -= trim;
-      remainingToTrim -= trim;
+      remainingToTrim += trim;
     }
     // Drop fully-trimmed recovery lines.

[Killed] EqualityOperator
src/modules/payroll/domain.ts:314:41
       remainingToTrim -= trim;
     }
     // Drop fully-trimmed recovery lines.
-    for (let i = deductions.length - 1; i >= 0; i--) {
+    for (let i = deductions.length - 1; i < 0; i--) {
       const d = deductions[i]!;
       if (RECOVERY_CODES.has(d.code) && d.amountMinor === 0n) deductions.splice(i, 1);
killedBy: L10 payroll — protected net floor caps recovery and carries the rest a fully-trimmed recovery line is dropped from the slip
statusReason: expected [ 'LOAN_EMI' ] to not include 'LOAN_EMI'

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:314:41
       remainingToTrim -= trim;
     }
     // Drop fully-trimmed recovery lines.
-    for (let i = deductions.length - 1; i >= 0; i--) {
+    for (let i = deductions.length - 1; false; i--) {
       const d = deductions[i]!;
       if (RECOVERY_CODES.has(d.code) && d.amountMinor === 0n) deductions.splice(i, 1);
killedBy: L10 payroll — protected net floor caps recovery and carries the rest a fully-trimmed recovery line is dropped from the slip
statusReason: expected [ 'LOAN_EMI' ] to not include 'LOAN_EMI'

[Killed] EqualityOperator
src/modules/payroll/domain.ts:316:41
     // Drop fully-trimmed recovery lines.
     for (let i = deductions.length - 1; i >= 0; i--) {
       const d = deductions[i]!;
-      if (RECOVERY_CODES.has(d.code) && d.amountMinor === 0n) deductions.splice(i, 1);
+      if (RECOVERY_CODES.has(d.code) && d.amountMinor !== 0n) deductions.splice(i, 1);
     }
   }
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 1000000n to be 6220000n // Object.is equality
