[Killed] ConditionalExpression
src/modules/payroll/domain.ts:316:41
     // Drop fully-trimmed recovery lines.
     for (let i = deductions.length - 1; i >= 0; i--) {
       const d = deductions[i]!;
-      if (RECOVERY_CODES.has(d.code) && d.amountMinor === 0n) deductions.splice(i, 1);
+      if (RECOVERY_CODES.has(d.code) && true) deductions.splice(i, 1);
     }
   }
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 1000000n to be 6220000n // Object.is equality

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:320:27
     }
   }
 
-  const totalDeductions = nonRecovery + recoveryApplied;
+  const totalDeductions = nonRecovery - recoveryApplied;
   const netRaw          = grossMinor - totalDeductions;
   // With the floor enforced, netRaw can still legitimately be 0 (no floor + full

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:321:27
   }
 
   const totalDeductions = nonRecovery + recoveryApplied;
-  const netRaw          = grossMinor - totalDeductions;
+  const netRaw          = grossMinor + totalDeductions;
   // With the floor enforced, netRaw can still legitimately be 0 (no floor + full
   // recovery). negativeNet now only ever true if floor is 0 and fixed/statutory
killedBy: L10 payroll — gross/deduction/net conservation net equals gross minus total deductions
statusReason: expected 9200000n to be 8800000n // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:325:27
   // With the floor enforced, netRaw can still legitimately be 0 (no floor + full
   // recovery). negativeNet now only ever true if floor is 0 and fixed/statutory
   // alone exceed gross (an upstream data error worth flagging as an exception).
-  const negativeNet     = netRaw < 0n;
+  const negativeNet     = netRaw >= 0n;
 
   return {
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:325:27
   // With the floor enforced, netRaw can still legitimately be 0 (no floor + full
   // recovery). negativeNet now only ever true if floor is 0 and fixed/statutory
   // alone exceed gross (an upstream data error worth flagging as an exception).
-  const negativeNet     = netRaw < 0n;
+  const negativeNet     = true;
 
   return {
killedBy: L10 payroll — protected net floor caps recovery and carries the rest recovery exceeding headroom is trimmed and the remainder carried forward
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/modules/payroll/domain.ts:346:64
  * the pensioner attains in the run month, an extra % of basic pension is paid:
  *   80–84: 20%, 85–89: 30%, 90–94: 40%, 95–99: 50%, 100+: 100%.
  */
-export function additionalPensionPct(ageYears: number): bigint {
-  if (ageYears >= 100) return 100n;
-  if (ageYears >= 95)  return 50n;
-  if (ageYears >= 90)  return 40n;
-  if (ageYears >= 85)  return 30n;
-  if (ageYears >= 80)  return 20n;
-  return 0n;
-}
+export function additionalPensionPct(ageYears: number): bigint {}
 
 /** Whole years attained on/before the last day of the run month (YYYY-MM). */
killedBy: L10 — Additional pension % by age (vs golden oracle) age 79 → 0%
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:347:7
  *   80–84: 20%, 85–89: 30%, 90–94: 40%, 95–99: 50%, 100+: 100%.
  */
 export function additionalPensionPct(ageYears: number): bigint {
-  if (ageYears >= 100) return 100n;
+  if (false) return 100n;
   if (ageYears >= 95)  return 50n;
   if (ageYears >= 90)  return 40n;
killedBy: L11 — Canary: Pension age bands correct at boundaries CANARY: age 100 → 100% (mutation: change 100 to 50)
statusReason: expected 50 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:347:7
  *   80–84: 20%, 85–89: 30%, 90–94: 40%, 95–99: 50%, 100+: 100%.
  */
 export function additionalPensionPct(ageYears: number): bigint {
-  if (ageYears >= 100) return 100n;
+  if (true) return 100n;
   if (ageYears >= 95)  return 50n;
   if (ageYears >= 90)  return 40n;
killedBy: L11 — Canary: Pension age bands correct at boundaries CANARY: age 79 → 0% (mutation: change threshold from 80 to 79)
statusReason: expected 100 to be +0 // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:348:7
  */
 export function additionalPensionPct(ageYears: number): bigint {
   if (ageYears >= 100) return 100n;
-  if (ageYears >= 95)  return 50n;
+  if (ageYears > 95)  return 50n;
   if (ageYears >= 90)  return 40n;
   if (ageYears >= 85)  return 30n;
killedBy: L10 — Additional pension % by age (vs golden oracle) age 95 → 50%
statusReason: expected 40 to be 50 // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:348:7
  */
 export function additionalPensionPct(ageYears: number): bigint {
   if (ageYears >= 100) return 100n;
-  if (ageYears >= 95)  return 50n;
+  if (ageYears < 95)  return 50n;
   if (ageYears >= 90)  return 40n;
   if (ageYears >= 85)  return 30n;
killedBy: L11 — Canary: Pension age bands correct at boundaries CANARY: age 79 → 0% (mutation: change threshold from 80 to 79)
statusReason: expected 50 to be +0 // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:349:7
 export function additionalPensionPct(ageYears: number): bigint {
   if (ageYears >= 100) return 100n;
   if (ageYears >= 95)  return 50n;
-  if (ageYears >= 90)  return 40n;
+  if (ageYears > 90)  return 40n;
   if (ageYears >= 85)  return 30n;
   if (ageYears >= 80)  return 20n;
killedBy: L10 — Additional pension % by age (vs golden oracle) age 90 → 40%
statusReason: expected 30 to be 40 // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:349:7
 export function additionalPensionPct(ageYears: number): bigint {
   if (ageYears >= 100) return 100n;
   if (ageYears >= 95)  return 50n;
-  if (ageYears >= 90)  return 40n;
+  if (true)  return 40n;
   if (ageYears >= 85)  return 30n;
   if (ageYears >= 80)  return 20n;
killedBy: L11 — Canary: Pension age bands correct at boundaries CANARY: age 79 → 0% (mutation: change threshold from 80 to 79)
statusReason: expected 40 to be +0 // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:350:7
   if (ageYears >= 100) return 100n;
   if (ageYears >= 95)  return 50n;
   if (ageYears >= 90)  return 40n;
-  if (ageYears >= 85)  return 30n;
+  if (ageYears > 85)  return 30n;
   if (ageYears >= 80)  return 20n;
   return 0n;
killedBy: L10 — Additional pension % by age (vs golden oracle) age 85 → 30%
statusReason: expected 20 to be 30 // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:350:7
   if (ageYears >= 100) return 100n;
   if (ageYears >= 95)  return 50n;
   if (ageYears >= 90)  return 40n;
-  if (ageYears >= 85)  return 30n;
+  if (true)  return 30n;
   if (ageYears >= 80)  return 20n;
   return 0n;
killedBy: L10 — Additional pension % by age (vs golden oracle) age 79 → 0%
statusReason: expected 30 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:351:7
   if (ageYears >= 95)  return 50n;
   if (ageYears >= 90)  return 40n;
   if (ageYears >= 85)  return 30n;
-  if (ageYears >= 80)  return 20n;
+  if (true)  return 20n;
   return 0n;
 }
killedBy: L10 — Additional pension % by age (vs golden oracle) age 79 → 0%
statusReason: expected 20 to be +0 // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:351:7
   if (ageYears >= 95)  return 50n;
   if (ageYears >= 90)  return 40n;
   if (ageYears >= 85)  return 30n;
-  if (ageYears >= 80)  return 20n;
+  if (ageYears < 80)  return 20n;
   return 0n;
 }
killedBy: L10 — Additional pension % by age (vs golden oracle) age 79 → 0%
statusReason: expected 20 to be +0 // Object.is equality

[Killed] BlockStatement
src/modules/payroll/domain.ts:356:67
 }
 
 /** Whole years attained on/before the last day of the run month (YYYY-MM). */
-export function ageAtMonth(dobIso: string, month: string): number {
-  const dob = new Date(`${dobIso.slice(0, 10)}T00:00:00Z`);
-  const [y, m] = month.split("-").map(Number) as [number, number];
-  // Reference = last day of run month.
-  const ref = new Date(Date.UTC(y, m, 0));
-  let age = ref.getUTCFullYear() - dob.getUTCFullYear();
-  const mo = ref.getUTCMonth() - dob.getUTCMonth();
-  if (mo < 0 || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
-  return age < 0 ? 0 : age;
-}
+export function ageAtMonth(dobIso: string, month: string): number {}
 
 export interface PensionInput {
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected +0 to be 800000 // Object.is equality

[Survived] MethodExpression
src/modules/payroll/domain.ts:357:27
 
 /** Whole years attained on/before the last day of the run month (YYYY-MM). */
 export function ageAtMonth(dobIso: string, month: string): number {
-  const dob = new Date(`${dobIso.slice(0, 10)}T00:00:00Z`);
+  const dob = new Date(`${dobIso}T00:00:00Z`);
   const [y, m] = month.split("-").map(Number) as [number, number];
   // Reference = last day of run month.

[Killed] StringLiteral
src/modules/payroll/domain.ts:357:24
 
 /** Whole years attained on/before the last day of the run month (YYYY-MM). */
 export function ageAtMonth(dobIso: string, month: string): number {
-  const dob = new Date(`${dobIso.slice(0, 10)}T00:00:00Z`);
+  const dob = new Date(``);
   const [y, m] = month.split("-").map(Number) as [number, number];
   // Reference = last day of run month.
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected +0 to be 800000 // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:361:13
   const [y, m] = month.split("-").map(Number) as [number, number];
   // Reference = last day of run month.
   const ref = new Date(Date.UTC(y, m, 0));
-  let age = ref.getUTCFullYear() - dob.getUTCFullYear();
+  let age = ref.getUTCFullYear() + dob.getUTCFullYear();
   const mo = ref.getUTCMonth() - dob.getUTCMonth();
   if (mo < 0 || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected 4000000 to be 800000 // Object.is equality

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:362:14
   // Reference = last day of run month.
   const ref = new Date(Date.UTC(y, m, 0));
   let age = ref.getUTCFullYear() - dob.getUTCFullYear();
-  const mo = ref.getUTCMonth() - dob.getUTCMonth();
+  const mo = ref.getUTCMonth() + dob.getUTCMonth();
   if (mo < 0 || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
   return age < 0 ? 0 : age;

[NoCoverage] EqualityOperator
src/modules/payroll/domain.ts:363:30
   const ref = new Date(Date.UTC(y, m, 0));
   let age = ref.getUTCFullYear() - dob.getUTCFullYear();
   const mo = ref.getUTCMonth() - dob.getUTCMonth();
-  if (mo < 0 || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
+  if (mo < 0 || (mo === 0 && ref.getUTCDate() <= dob.getUTCDate())) age -= 1;
   return age < 0 ? 0 : age;
 }

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:363:7
   const ref = new Date(Date.UTC(y, m, 0));
   let age = ref.getUTCFullYear() - dob.getUTCFullYear();
   const mo = ref.getUTCMonth() - dob.getUTCMonth();
-  if (mo < 0 || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
+  if (false) age -= 1;
   return age < 0 ? 0 : age;
 }

[Killed] EqualityOperator
src/modules/payroll/domain.ts:364:10
   let age = ref.getUTCFullYear() - dob.getUTCFullYear();
   const mo = ref.getUTCMonth() - dob.getUTCMonth();
   if (mo < 0 || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
-  return age < 0 ? 0 : age;
+  return age >= 0 ? 0 : age;
 }
 
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected +0 to be 800000 // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:364:10
   let age = ref.getUTCFullYear() - dob.getUTCFullYear();
   const mo = ref.getUTCMonth() - dob.getUTCMonth();
   if (mo < 0 || (mo === 0 && ref.getUTCDate() < dob.getUTCDate())) age -= 1;
-  return age < 0 ? 0 : age;
+  return true ? 0 : age;
 }
 
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected +0 to be 800000 // Object.is equality

[Survived] BooleanLiteral
src/modules/payroll/domain.ts:429:29
   const additionalPensionMinor = pct(basicPensionMinor, addlPct);
 
   // Restoration: 15 years after commutation date the commuted portion is restored.
-  let commutationRestored = true;
+  let commutationRestored = false;
   if (commutedPensionMinor > 0n && commutationDate) {
     const cd = new Date(`${commutationDate.slice(0, 10)}T00:00:00Z`);

[Killed] BlockStatement
src/modules/payroll/domain.ts:430:53
 
   // Restoration: 15 years after commutation date the commuted portion is restored.
   let commutationRestored = true;
-  if (commutedPensionMinor > 0n && commutationDate) {
-    const cd = new Date(`${commutationDate.slice(0, 10)}T00:00:00Z`);
-    const restoreOn = new Date(Date.UTC(cd.getUTCFullYear() + 15, cd.getUTCMonth(), cd.getUTCDate()));
-    const [y, m] = month.split("-").map(Number) as [number, number];
-    const runEnd = new Date(Date.UTC(y, m, 0));
-    commutationRestored = runEnd >= restoreOn;
-  } else if (commutedPensionMinor > 0n) {
+  if (commutedPensionMinor > 0n && commutationDate) {} else if (commutedPensionMinor > 0n) {
     // Commuted but no date provided — treat as not yet restored.
     commutationRestored = false;
killedBy: L10 — Pension computation (basic + DR + additional) commutation deducted before restoration (15-year rule)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:430:7
 
   // Restoration: 15 years after commutation date the commuted portion is restored.
   let commutationRestored = true;
-  if (commutedPensionMinor > 0n && commutationDate) {
+  if (true) {
     const cd = new Date(`${commutationDate.slice(0, 10)}T00:00:00Z`);
     const restoreOn = new Date(Date.UTC(cd.getUTCFullYear() + 15, cd.getUTCMonth(), cd.getUTCDate()));
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: Cannot read properties of null (reading 'slice')

[Survived] MethodExpression
src/modules/payroll/domain.ts:431:28
   // Restoration: 15 years after commutation date the commuted portion is restored.
   let commutationRestored = true;
   if (commutedPensionMinor > 0n && commutationDate) {
-    const cd = new Date(`${commutationDate.slice(0, 10)}T00:00:00Z`);
+    const cd = new Date(`${commutationDate}T00:00:00Z`);
     const restoreOn = new Date(Date.UTC(cd.getUTCFullYear() + 15, cd.getUTCMonth(), cd.getUTCDate()));
     const [y, m] = month.split("-").map(Number) as [number, number];

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:432:41
   let commutationRestored = true;
   if (commutedPensionMinor > 0n && commutationDate) {
     const cd = new Date(`${commutationDate.slice(0, 10)}T00:00:00Z`);
-    const restoreOn = new Date(Date.UTC(cd.getUTCFullYear() + 15, cd.getUTCMonth(), cd.getUTCDate()));
+    const restoreOn = new Date(Date.UTC(cd.getUTCFullYear() - 15, cd.getUTCMonth(), cd.getUTCDate()));
     const [y, m] = month.split("-").map(Number) as [number, number];
     const runEnd = new Date(Date.UTC(y, m, 0));
killedBy: L10 — Pension computation (basic + DR + additional) commutation deducted before restoration (15-year rule)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:435:27
     const restoreOn = new Date(Date.UTC(cd.getUTCFullYear() + 15, cd.getUTCMonth(), cd.getUTCDate()));
     const [y, m] = month.split("-").map(Number) as [number, number];
     const runEnd = new Date(Date.UTC(y, m, 0));
-    commutationRestored = runEnd >= restoreOn;
+    commutationRestored = true;
   } else if (commutedPensionMinor > 0n) {
     // Commuted but no date provided — treat as not yet restored.
killedBy: L10 — Pension computation (basic + DR + additional) commutation deducted before restoration (15-year rule)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/modules/payroll/domain.ts:435:27
     const restoreOn = new Date(Date.UTC(cd.getUTCFullYear() + 15, cd.getUTCMonth(), cd.getUTCDate()));
     const [y, m] = month.split("-").map(Number) as [number, number];
     const runEnd = new Date(Date.UTC(y, m, 0));
-    commutationRestored = runEnd >= restoreOn;
+    commutationRestored = runEnd < restoreOn;
   } else if (commutedPensionMinor > 0n) {
     // Commuted but no date provided — treat as not yet restored.
killedBy: L10 — Pension computation (basic + DR + additional) commutation deducted before restoration (15-year rule)
statusReason: expected true to be false // Object.is equality

[NoCoverage] BlockStatement
src/modules/payroll/domain.ts:436:41
     const [y, m] = month.split("-").map(Number) as [number, number];
     const runEnd = new Date(Date.UTC(y, m, 0));
     commutationRestored = runEnd >= restoreOn;
-  } else if (commutedPensionMinor > 0n) {
-    // Commuted but no date provided — treat as not yet restored.
-    commutationRestored = false;
-  }
+  } else if (commutedPensionMinor > 0n) {}
   const commutationDeductionMinor = commutationRestored ? 0n : commutedPensionMinor;
   const payableBasicPensionMinor = basicPensionMinor - commutationDeductionMinor;

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:436:14
     const [y, m] = month.split("-").map(Number) as [number, number];
     const runEnd = new Date(Date.UTC(y, m, 0));
     commutationRestored = runEnd >= restoreOn;
-  } else if (commutedPensionMinor > 0n) {
+  } else if (false) {
     // Commuted but no date provided — treat as not yet restored.
     commutationRestored = false;

[NoCoverage] BooleanLiteral
src/modules/payroll/domain.ts:438:27
     commutationRestored = runEnd >= restoreOn;
   } else if (commutedPensionMinor > 0n) {
     // Commuted but no date provided — treat as not yet restored.
-    commutationRestored = false;
+    commutationRestored = true;
   }
   const commutationDeductionMinor = commutationRestored ? 0n : commutedPensionMinor;

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:441:36
     commutationRestored = false;
   }
   const commutationDeductionMinor = commutationRestored ? 0n : commutedPensionMinor;
-  const payableBasicPensionMinor = basicPensionMinor - commutationDeductionMinor;
+  const payableBasicPensionMinor = basicPensionMinor + commutationDeductionMinor;
 
   // DR is on basic + additional pension (full basic, not reduced by commutation).
killedBy: L10 — Pension computation (basic + DR + additional) commutation deducted before restoration (15-year rule)
statusReason: expected 5600000 to be 2400000 // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:444:18
   const payableBasicPensionMinor = basicPensionMinor - commutationDeductionMinor;
 
   // DR is on basic + additional pension (full basic, not reduced by commutation).
-  const drBase = basicPensionMinor + additionalPensionMinor;
+  const drBase = basicPensionMinor - additionalPensionMinor;
   const drMinor = roundRupee((drBase * drRateBps) / 10000n);
   const medical = roundRupee(medicalAllowanceMinor);
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected 1600000 to be 2400000 // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:445:30
 
   // DR is on basic + additional pension (full basic, not reduced by commutation).
   const drBase = basicPensionMinor + additionalPensionMinor;
-  const drMinor = roundRupee((drBase * drRateBps) / 10000n);
+  const drMinor = roundRupee(drBase * drRateBps * 10000n);
   const medical = roundRupee(medicalAllowanceMinor);
 
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected 240000000000000 to be 2400000 // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:445:31
 
   // DR is on basic + additional pension (full basic, not reduced by commutation).
   const drBase = basicPensionMinor + additionalPensionMinor;
-  const drMinor = roundRupee((drBase * drRateBps) / 10000n);
+  const drMinor = roundRupee((drBase / drRateBps) / 10000n);
   const medical = roundRupee(medicalAllowanceMinor);
 
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected +0 to be 2400000 // Object.is equality

[Survived] EqualityOperator
src/modules/payroll/domain.ts:450:7
 
   const earnings: PayComponent[] = [];
   earnings.push({ code: "BASIC_PENSION", name: "Basic Pension", type: "earning", amountMinor: basicPensionMinor });
-  if (additionalPensionMinor > 0n)
+  if (additionalPensionMinor >= 0n)
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)

[Survived] EqualityOperator
src/modules/payroll/domain.ts:450:7
 
   const earnings: PayComponent[] = [];
   earnings.push({ code: "BASIC_PENSION", name: "Basic Pension", type: "earning", amountMinor: basicPensionMinor });
-  if (additionalPensionMinor > 0n)
+  if (additionalPensionMinor <= 0n)
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)

[Survived] StringLiteral
src/modules/payroll/domain.ts:451:91
   const earnings: PayComponent[] = [];
   earnings.push({ code: "BASIC_PENSION", name: "Basic Pension", type: "earning", amountMinor: basicPensionMinor });
   if (additionalPensionMinor > 0n)
-    earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
+    earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });

[Survived] StringLiteral
src/modules/payroll/domain.ts:451:27
   const earnings: PayComponent[] = [];
   earnings.push({ code: "BASIC_PENSION", name: "Basic Pension", type: "earning", amountMinor: basicPensionMinor });
   if (additionalPensionMinor > 0n)
-    earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
+    earnings.push({ code: "", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:452:7
   earnings.push({ code: "BASIC_PENSION", name: "Basic Pension", type: "earning", amountMinor: basicPensionMinor });
   if (additionalPensionMinor > 0n)
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
-  if (drMinor > 0n)
+  if (true)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
   if (medical > 0n)

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:452:7
   earnings.push({ code: "BASIC_PENSION", name: "Basic Pension", type: "earning", amountMinor: basicPensionMinor });
   if (additionalPensionMinor > 0n)
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
-  if (drMinor > 0n)
+  if (false)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
   if (medical > 0n)

[Survived] StringLiteral
src/modules/payroll/domain.ts:453:64
   if (additionalPensionMinor > 0n)
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)
-    earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
+    earnings.push({ code: "DR", name: "Dearness Relief", type: "", amountMinor: drMinor });
   if (medical > 0n)
     earnings.push({ code: "FMA", name: "Medical Allowance", type: "earning", amountMinor: medical });

[Survived] EqualityOperator
src/modules/payroll/domain.ts:454:7
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
-  if (medical > 0n)
+  if (medical <= 0n)
     earnings.push({ code: "FMA", name: "Medical Allowance", type: "earning", amountMinor: medical });
 

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:454:7
     earnings.push({ code: "ADDL_PENSION", name: `Additional Pension (${addlPct}%)`, type: "earning", amountMinor: additionalPensionMinor });
   if (drMinor > 0n)
     earnings.push({ code: "DR", name: "Dearness Relief", type: "earning", amountMinor: drMinor });
-  if (medical > 0n)
+  if (true)
     earnings.push({ code: "FMA", name: "Medical Allowance", type: "earning", amountMinor: medical });
 

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:458:22
     earnings.push({ code: "FMA", name: "Medical Allowance", type: "earning", amountMinor: medical });
 
   // Gross is the full entitlement; commutation withholding and TDS are deductions.
-  const grossMinor = basicPensionMinor + additionalPensionMinor + drMinor + medical;
+  const grossMinor = basicPensionMinor - additionalPensionMinor + drMinor + medical;
 
   const deductions: PayComponent[] = [];
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected 5600000 to be 7200000 // Object.is equality

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:458:22
     earnings.push({ code: "FMA", name: "Medical Allowance", type: "earning", amountMinor: medical });
 
   // Gross is the full entitlement; commutation withholding and TDS are deductions.
-  const grossMinor = basicPensionMinor + additionalPensionMinor + drMinor + medical;
+  const grossMinor = basicPensionMinor + additionalPensionMinor - drMinor + medical;
 
   const deductions: PayComponent[] = [];
killedBy: L10 — Pension computation (basic + DR + additional) pensioner aged 82 gets 20% additional pension
statusReason: expected 2400000 to be 7200000 // Object.is equality

[Survived] EqualityOperator
src/modules/payroll/domain.ts:461:7
   const grossMinor = basicPensionMinor + additionalPensionMinor + drMinor + medical;
 
   const deductions: PayComponent[] = [];
-  if (commutationDeductionMinor > 0n)
+  if (commutationDeductionMinor >= 0n)
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);

[Survived] EqualityOperator
src/modules/payroll/domain.ts:461:7
   const grossMinor = basicPensionMinor + additionalPensionMinor + drMinor + medical;
 
   const deductions: PayComponent[] = [];
-  if (commutationDeductionMinor > 0n)
+  if (commutationDeductionMinor <= 0n)
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);

[Survived] StringLiteral
src/modules/payroll/domain.ts:462:29
 
   const deductions: PayComponent[] = [];
   if (commutationDeductionMinor > 0n)
-    deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
+    deductions.push({ code: "", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);
   if (tds > 0n)

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:464:7
   if (commutationDeductionMinor > 0n)
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);
-  if (tds > 0n)
+  if (false)
     deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "deduction", amountMinor: tds });
 

[Survived] ConditionalExpression
src/modules/payroll/domain.ts:464:7
   if (commutationDeductionMinor > 0n)
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);
-  if (tds > 0n)
+  if (true)
     deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "deduction", amountMinor: tds });
 

[NoCoverage] ObjectLiteral
src/modules/payroll/domain.ts:465:21
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);
   if (tds > 0n)
-    deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "deduction", amountMinor: tds });
+    deductions.push({});
 
   const totalDeductionsMinor = commutationDeductionMinor + tds;
