[NoCoverage] StringLiteral
src/modules/payroll/domain.ts:465:42
     deductions.push({ code: "COMMUTATION", name: "Commuted Pension", type: "deduction", amountMinor: commutationDeductionMinor });
   const tds = roundRupee(tdsMinor);
   if (tds > 0n)
-    deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "deduction", amountMinor: tds });
+    deductions.push({ code: "TDS", name: "", type: "deduction", amountMinor: tds });
 
   const totalDeductionsMinor = commutationDeductionMinor + tds;

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:467:32
   if (tds > 0n)
     deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "deduction", amountMinor: tds });
 
-  const totalDeductionsMinor = commutationDeductionMinor + tds;
+  const totalDeductionsMinor = commutationDeductionMinor - tds;
   const netPayMinor = grossMinor - totalDeductionsMinor;
 

[Survived] ArithmeticOperator
src/modules/payroll/domain.ts:468:23
     deductions.push({ code: "TDS", name: "Income Tax (TDS)", type: "deduction", amountMinor: tds });
 
   const totalDeductionsMinor = commutationDeductionMinor + tds;
-  const netPayMinor = grossMinor - totalDeductionsMinor;
+  const netPayMinor = grossMinor + totalDeductionsMinor;
 
   return {

[Killed] BlockStatement
src/modules/payroll/domain.ts:480:80
   };
 }
 
-export function assertRunStatusTransition(current: string, next: string): void {
-  const allowed: Record<string, string[]> = {
-    draft:      ["processing"],
-    processing: ["approved", "failed"],
-    approved:   ["disbursed"],
-    disbursed:  [],
-    failed:     ["draft"],
-  };
-  if (!(allowed[current] ?? []).includes(next)) {
-    throw new DomainError("INVALID_STATUS_TRANSITION", `cannot move payroll run from '${current}' to '${next}'`);
-  }
-}
+export function assertRunStatusTransition(current: string, next: string): void {}
 
 /**
killedBy: payroll/domain — assertRunStatusTransition() blocks draft → approved
statusReason: expected function to throw an error, but it didn't

[Killed] ObjectLiteral
src/modules/payroll/domain.ts:481:45
 }
 
 export function assertRunStatusTransition(current: string, next: string): void {
-  const allowed: Record<string, string[]> = {
-    draft:      ["processing"],
-    processing: ["approved", "failed"],
-    approved:   ["disbursed"],
-    disbursed:  [],
-    failed:     ["draft"],
-  };
+  const allowed: Record<string, string[]> = {};
   if (!(allowed[current] ?? []).includes(next)) {
     throw new DomainError("INVALID_STATUS_TRANSITION", `cannot move payroll run from '${current}' to '${next}'`);
killedBy: payroll/domain — assertRunStatusTransition() allows draft → processing
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_STATUS_TRANSITI…' was thrown

[Killed] ArrayDeclaration
src/modules/payroll/domain.ts:483:17
 export function assertRunStatusTransition(current: string, next: string): void {
   const allowed: Record<string, string[]> = {
     draft:      ["processing"],
-    processing: ["approved", "failed"],
+    processing: [],
     approved:   ["disbursed"],
     disbursed:  [],
killedBy: payroll/domain — assertRunStatusTransition() allows processing → approved
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_STATUS_TRANSITI…' was thrown

[Killed] StringLiteral
src/modules/payroll/domain.ts:483:30
 export function assertRunStatusTransition(current: string, next: string): void {
   const allowed: Record<string, string[]> = {
     draft:      ["processing"],
-    processing: ["approved", "failed"],
+    processing: ["approved", ""],
     approved:   ["disbursed"],
     disbursed:  [],
killedBy: payroll/domain — assertRunStatusTransition() allows processing → failed
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_STATUS_TRANSITI…' was thrown

[Killed] ArrayDeclaration
src/modules/payroll/domain.ts:484:17
   const allowed: Record<string, string[]> = {
     draft:      ["processing"],
     processing: ["approved", "failed"],
-    approved:   ["disbursed"],
+    approved:   [],
     disbursed:  [],
     failed:     ["draft"],
killedBy: payroll/domain — assertRunStatusTransition() allows approved → disbursed
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_STATUS_TRANSITI…' was thrown

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:488:7
     disbursed:  [],
     failed:     ["draft"],
   };
-  if (!(allowed[current] ?? []).includes(next)) {
+  if (false) {
     throw new DomainError("INVALID_STATUS_TRANSITION", `cannot move payroll run from '${current}' to '${next}'`);
   }
killedBy: payroll/domain — assertRunStatusTransition() blocks draft → approved
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:488:7
     disbursed:  [],
     failed:     ["draft"],
   };
-  if (!(allowed[current] ?? []).includes(next)) {
+  if (true) {
     throw new DomainError("INVALID_STATUS_TRANSITION", `cannot move payroll run from '${current}' to '${next}'`);
   }
killedBy: payroll/domain — assertRunStatusTransition() allows draft → processing
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_STATUS_TRANSITI…' was thrown

[Killed] BlockStatement
src/modules/payroll/domain.ts:497:107
  * Payment of Gratuity Act / CCS: (15/26) * (last Basic+DA) * completed years,
  * where >=6 months in the final year rounds up; capped at 20 lakh.
  */
-export function computeGratuity(yearsOfService: number, lastBasicMinor: bigint, lastDaMinor = 0n): bigint {
-  if (yearsOfService < 5) return 0n;
-  const whole = Math.floor(yearsOfService);
-  const fracMonths = Math.round((yearsOfService - whole) * 12);
-  const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
-  const emoluments = lastBasicMinor + lastDaMinor;
-  const raw = (emoluments * 15n * completedYears) / 26n;
-  const rounded = roundRupee(raw);
-  return rounded > GRATUITY_CAP ? GRATUITY_CAP : rounded;
-}
+export function computeGratuity(yearsOfService: number, lastBasicMinor: bigint, lastDaMinor = 0n): bigint {}
 
killedBy: payroll/domain — computeGratuity() computes for 20 years service
statusReason: actual value must be number or bigint, received "undefined"

[Killed] EqualityOperator
src/modules/payroll/domain.ts:498:7
  * where >=6 months in the final year rounds up; capped at 20 lakh.
  */
 export function computeGratuity(yearsOfService: number, lastBasicMinor: bigint, lastDaMinor = 0n): bigint {
-  if (yearsOfService < 5) return 0n;
+  if (yearsOfService <= 5) return 0n;
   const whole = Math.floor(yearsOfService);
   const fracMonths = Math.round((yearsOfService - whole) * 12);
killedBy: L11 — Canary: Gratuity gate catches boundary errors CANARY: exactly 5 years → non-zero (mutation: change < 5 to < 6)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:498:7
  * where >=6 months in the final year rounds up; capped at 20 lakh.
  */
 export function computeGratuity(yearsOfService: number, lastBasicMinor: bigint, lastDaMinor = 0n): bigint {
-  if (yearsOfService < 5) return 0n;
+  if (true) return 0n;
   const whole = Math.floor(yearsOfService);
   const fracMonths = Math.round((yearsOfService - whole) * 12);
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 24230800 to be less than or equal to 100

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:500:33
 export function computeGratuity(yearsOfService: number, lastBasicMinor: bigint, lastDaMinor = 0n): bigint {
   if (yearsOfService < 5) return 0n;
   const whole = Math.floor(yearsOfService);
-  const fracMonths = Math.round((yearsOfService - whole) * 12);
+  const fracMonths = Math.round((yearsOfService - whole) / 12);
   const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
   const emoluments = lastBasicMinor + lastDaMinor;
killedBy: L10 — Gratuity computation (vs golden oracle) 6 months in last year → rounds UP to 11 years: 84000*15*11/26 = 533076.92
statusReason: expected 4846200 to be less than or equal to 100

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:500:34
 export function computeGratuity(yearsOfService: number, lastBasicMinor: bigint, lastDaMinor = 0n): bigint {
   if (yearsOfService < 5) return 0n;
   const whole = Math.floor(yearsOfService);
-  const fracMonths = Math.round((yearsOfService - whole) * 12);
+  const fracMonths = Math.round((yearsOfService + whole) * 12);
   const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
   const emoluments = lastBasicMinor + lastDaMinor;
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 4846100 to be less than or equal to 100

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:501:42
   if (yearsOfService < 5) return 0n;
   const whole = Math.floor(yearsOfService);
   const fracMonths = Math.round((yearsOfService - whole) * 12);
-  const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
+  const completedYears = BigInt(whole + (true ? 1 : 0));
   const emoluments = lastBasicMinor + lastDaMinor;
   const raw = (emoluments * 15n * completedYears) / 26n;
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 4846100 to be less than or equal to 100

[Killed] EqualityOperator
src/modules/payroll/domain.ts:501:42
   if (yearsOfService < 5) return 0n;
   const whole = Math.floor(yearsOfService);
   const fracMonths = Math.round((yearsOfService - whole) * 12);
-  const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
+  const completedYears = BigInt(whole + (fracMonths > 6 ? 1 : 0));
   const emoluments = lastBasicMinor + lastDaMinor;
   const raw = (emoluments * 15n * completedYears) / 26n;
killedBy: L10 — Gratuity computation (vs golden oracle) 6 months in last year → rounds UP to 11 years: 84000*15*11/26 = 533076.92
statusReason: expected 4846200 to be less than or equal to 100

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:502:22
   const whole = Math.floor(yearsOfService);
   const fracMonths = Math.round((yearsOfService - whole) * 12);
   const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
-  const emoluments = lastBasicMinor + lastDaMinor;
+  const emoluments = lastBasicMinor - lastDaMinor;
   const raw = (emoluments * 15n * completedYears) / 26n;
   const rounded = roundRupee(raw);
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 16153900 to be less than or equal to 100

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:503:16
   const fracMonths = Math.round((yearsOfService - whole) * 12);
   const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
   const emoluments = lastBasicMinor + lastDaMinor;
-  const raw = (emoluments * 15n * completedYears) / 26n;
+  const raw = (emoluments / 15n * completedYears) / 26n;
   const rounded = roundRupee(raw);
   return rounded > GRATUITY_CAP ? GRATUITY_CAP : rounded;
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 24123100 to be less than or equal to 100

[Killed] ArithmeticOperator
src/modules/payroll/domain.ts:503:16
   const fracMonths = Math.round((yearsOfService - whole) * 12);
   const completedYears = BigInt(whole + (fracMonths >= 6 ? 1 : 0));
   const emoluments = lastBasicMinor + lastDaMinor;
-  const raw = (emoluments * 15n * completedYears) / 26n;
+  const raw = (emoluments * 15n / completedYears) / 26n;
   const rounded = roundRupee(raw);
   return rounded > GRATUITY_CAP ? GRATUITY_CAP : rounded;
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 23261600 to be less than or equal to 100

[Killed] EqualityOperator
src/modules/payroll/domain.ts:505:10
   const emoluments = lastBasicMinor + lastDaMinor;
   const raw = (emoluments * 15n * completedYears) / 26n;
   const rounded = roundRupee(raw);
-  return rounded > GRATUITY_CAP ? GRATUITY_CAP : rounded;
+  return rounded <= GRATUITY_CAP ? GRATUITY_CAP : rounded;
 }
 
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 175769200 to be less than or equal to 100

[Killed] ConditionalExpression
src/modules/payroll/domain.ts:505:10
   const emoluments = lastBasicMinor + lastDaMinor;
   const raw = (emoluments * 15n * completedYears) / 26n;
   const rounded = roundRupee(raw);
-  return rounded > GRATUITY_CAP ? GRATUITY_CAP : rounded;
+  return true ? GRATUITY_CAP : rounded;
 }
 
killedBy: L10 — Gratuity computation (vs golden oracle) (56000+28000)*15*5/26 = 242307.69 → 242308 paise
statusReason: expected 175769200 to be less than or equal to 100
