[Killed] BlockStatement
src/modules/authority/domain.ts:60:77
 }
 
 /** A limit is effective on `onDate` when active and the date is within bounds. */
-export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
-  if (limit.status !== "active") return false;
-  if (limit.effectiveFrom > onDate) return false;
-  if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
-  return true;
-}
+export function isEffective(limit: AuthorityLimit, onDate: string): boolean {}
 
 /** Effective limits matching an exact scope + authority type on a date. */
killedBy: isEffective respects status, from and to bounds
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/modules/authority/domain.ts:61:7
 
 /** A limit is effective on `onDate` when active and the date is within bounds. */
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
-  if (limit.status !== "active") return false;
+  if (limit.status === "active") return false;
   if (limit.effectiveFrom > onDate) return false;
   if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
killedBy: isEffective respects status, from and to bounds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:61:7
 
 /** A limit is effective on `onDate` when active and the date is within bounds. */
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
-  if (limit.status !== "active") return false;
+  if (true) return false;
   if (limit.effectiveFrom > onDate) return false;
   if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
killedBy: isEffective respects status, from and to bounds
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/modules/authority/domain.ts:62:44
 /** A limit is effective on `onDate` when active and the date is within bounds. */
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
   if (limit.status !== "active") return false;
-  if (limit.effectiveFrom > onDate) return false;
+  if (limit.effectiveFrom > onDate) return true;
   if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
   return true;
killedBy: isEffective respects status, from and to bounds
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:62:7
 /** A limit is effective on `onDate` when active and the date is within bounds. */
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
   if (limit.status !== "active") return false;
-  if (limit.effectiveFrom > onDate) return false;
+  if (true) return false;
   if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
   return true;
killedBy: isEffective respects status, from and to bounds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:63:7
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
   if (limit.status !== "active") return false;
   if (limit.effectiveFrom > onDate) return false;
-  if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
+  if (true) return false;
   return true;
 }
killedBy: isEffective respects status, from and to bounds
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/modules/authority/domain.ts:63:37
 export function isEffective(limit: AuthorityLimit, onDate: string): boolean {
   if (limit.status !== "active") return false;
   if (limit.effectiveFrom > onDate) return false;
-  if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
+  if (limit.effectiveTo !== null && limit.effectiveTo >= onDate) return false;
   return true;
 }
killedBy: isEffective respects status, from and to bounds
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/modules/authority/domain.ts:64:10
   if (limit.status !== "active") return false;
   if (limit.effectiveFrom > onDate) return false;
   if (limit.effectiveTo !== null && limit.effectiveTo < onDate) return false;
-  return true;
+  return false;
 }
 
killedBy: isEffective respects status, from and to bounds
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/authority/domain.ts:74:21
   scopeRef: string,
   authorityType: AuthorityType,
   onDate: string,
-): AuthorityLimit[] {
-  return limits.filter(
-    (l) =>
-      l.scopeType === scopeType &&
-      l.scopeRef === scopeRef &&
-      l.authorityType === authorityType &&
-      isEffective(l, onDate),
-  );
-}
+): AuthorityLimit[] {}
 
 /** Highest-authority effective limit for a single scope (or null). */
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/modules/authority/domain.ts:75:10
   authorityType: AuthorityType,
   onDate: string,
 ): AuthorityLimit[] {
-  return limits.filter(
-    (l) =>
-      l.scopeType === scopeType &&
-      l.scopeRef === scopeRef &&
-      l.authorityType === authorityType &&
-      isEffective(l, onDate),
-  );
+  return limits;
 }
 
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected 'board' to be 'director' // Object.is equality

[Killed] ArrowFunction
src/modules/authority/domain.ts:76:5
   onDate: string,
 ): AuthorityLimit[] {
   return limits.filter(
-    (l) =>
-      l.scopeType === scopeType &&
-      l.scopeRef === scopeRef &&
-      l.authorityType === authorityType &&
-      isEffective(l, onDate),
+    () => undefined,
   );
 }
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected undefined to be 'director' // Object.is equality

[Killed] LogicalOperator
src/modules/authority/domain.ts:77:7
 ): AuthorityLimit[] {
   return limits.filter(
     (l) =>
-      l.scopeType === scopeType &&
-      l.scopeRef === scopeRef &&
-      l.authorityType === authorityType &&
+      l.scopeType === scopeType && l.scopeRef === scopeRef || l.authorityType === authorityType &&
       isEffective(l, onDate),
   );
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected 'board' to be 'director' // Object.is equality

[Killed] EqualityOperator
src/modules/authority/domain.ts:77:7
 ): AuthorityLimit[] {
   return limits.filter(
     (l) =>
-      l.scopeType === scopeType &&
+      l.scopeType !== scopeType &&
       l.scopeRef === scopeRef &&
       l.authorityType === authorityType &&
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected undefined to be 'director' // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:78:7
   return limits.filter(
     (l) =>
       l.scopeType === scopeType &&
-      l.scopeRef === scopeRef &&
+      true &&
       l.authorityType === authorityType &&
       isEffective(l, onDate),
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected 'board' to be 'director' // Object.is equality

[Killed] EqualityOperator
src/modules/authority/domain.ts:78:7
   return limits.filter(
     (l) =>
       l.scopeType === scopeType &&
-      l.scopeRef === scopeRef &&
+      l.scopeRef !== scopeRef &&
       l.authorityType === authorityType &&
       isEffective(l, onDate),
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected 'board' to be 'director' // Object.is equality

[Killed] EqualityOperator
src/modules/authority/domain.ts:79:7
     (l) =>
       l.scopeType === scopeType &&
       l.scopeRef === scopeRef &&
-      l.authorityType === authorityType &&
+      l.authorityType !== authorityType &&
       isEffective(l, onDate),
   );
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected undefined to be 'director' // Object.is equality

[Survived] ConditionalExpression
src/modules/authority/domain.ts:79:7
     (l) =>
       l.scopeType === scopeType &&
       l.scopeRef === scopeRef &&
-      l.authorityType === authorityType &&
+      true &&
       isEffective(l, onDate),
   );

[Killed] BlockStatement
src/modules/authority/domain.ts:91:26
   scopeRef: string,
   authorityType: AuthorityType,
   onDate: string,
-): AuthorityLimit | null {
-  const matches = limitsForScope(limits, scopeType, scopeRef, authorityType, onDate);
-  if (matches.length === 0) return null;
-  return matches.reduce((best, l) => (l.maxAmount > best.maxAmount ? l : best));
-}
+): AuthorityLimit | null {}
 
 /**
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected undefined to be 'director' // Object.is equality

[Killed] EqualityOperator
src/modules/authority/domain.ts:93:7
   onDate: string,
 ): AuthorityLimit | null {
   const matches = limitsForScope(limits, scopeType, scopeRef, authorityType, onDate);
-  if (matches.length === 0) return null;
+  if (matches.length !== 0) return null;
   return matches.reduce((best, l) => (l.maxAmount > best.maxAmount ? l : best));
 }
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected undefined to be 'director' // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:93:7
   onDate: string,
 ): AuthorityLimit | null {
   const matches = limitsForScope(limits, scopeType, scopeRef, authorityType, onDate);
-  if (matches.length === 0) return null;
+  if (false) return null;
   return matches.reduce((best, l) => (l.maxAmount > best.maxAmount ? l : best));
 }
killedBy: resolveActorLimit returns null when the actor holds no applicable limit
statusReason: Reduce of empty array with no initial value

[NoCoverage] ConditionalExpression
src/modules/authority/domain.ts:94:39
 ): AuthorityLimit | null {
   const matches = limitsForScope(limits, scopeType, scopeRef, authorityType, onDate);
   if (matches.length === 0) return null;
-  return matches.reduce((best, l) => (l.maxAmount > best.maxAmount ? l : best));
+  return matches.reduce((best, l) => (true ? l : best));
 }
 

[NoCoverage] EqualityOperator
src/modules/authority/domain.ts:94:39
 ): AuthorityLimit | null {
   const matches = limitsForScope(limits, scopeType, scopeRef, authorityType, onDate);
   if (matches.length === 0) return null;
-  return matches.reduce((best, l) => (l.maxAmount > best.maxAmount ? l : best));
+  return matches.reduce((best, l) => (l.maxAmount <= best.maxAmount ? l : best));
 }
 

[Killed] BlockStatement
src/modules/authority/domain.ts:107:26
   actor: ActorScopes,
   authorityType: AuthorityType,
   onDate: string,
-): AuthorityLimit | null {
-  let best: AuthorityLimit | null = null;
-  for (const s of actor.scopes) {
-    const l = bestLimitForScope(limits, s.scopeType, s.scopeRef, authorityType, onDate);
-    if (l && (best === null || l.maxAmount > best.maxAmount)) best = l;
-  }
-  return best;
-}
+): AuthorityLimit | null {}
 
 /**
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected undefined to be 'director' // Object.is equality

[Killed] BlockStatement
src/modules/authority/domain.ts:109:33
   onDate: string,
 ): AuthorityLimit | null {
   let best: AuthorityLimit | null = null;
-  for (const s of actor.scopes) {
-    const l = bestLimitForScope(limits, s.scopeType, s.scopeRef, authorityType, onDate);
-    if (l && (best === null || l.maxAmount > best.maxAmount)) best = l;
-  }
+  for (const s of actor.scopes) {}
   return best;
 }
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected undefined to be 'director' // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:111:32
   let best: AuthorityLimit | null = null;
   for (const s of actor.scopes) {
     const l = bestLimitForScope(limits, s.scopeType, s.scopeRef, authorityType, onDate);
-    if (l && (best === null || l.maxAmount > best.maxAmount)) best = l;
+    if (l && (best === null || false)) best = l;
   }
   return best;
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: expected 'officer' to be 'director' // Object.is equality

[Killed] EqualityOperator
src/modules/authority/domain.ts:111:15
   let best: AuthorityLimit | null = null;
   for (const s of actor.scopes) {
     const l = bestLimitForScope(limits, s.scopeType, s.scopeRef, authorityType, onDate);
-    if (l && (best === null || l.maxAmount > best.maxAmount)) best = l;
+    if (l && (best !== null || l.maxAmount > best.maxAmount)) best = l;
   }
   return best;
killedBy: resolveActorLimit picks the highest effective limit across the actor's scopes
statusReason: Cannot read properties of null (reading 'maxAmount')

[Killed] BlockStatement
src/modules/authority/domain.ts:128:77
   amount: bigint,
   authorityType: AuthorityType,
   onDate: string,
-): Pick<AuthorityDecision, "escalationChain" | "finalApprover" | "covered"> {
-  const chain: AuthorityDecision["escalationChain"] = [];
-  const visited = new Set<string>([start.id]);
-  let cursor: AuthorityLimit | null = start;
-
-  while (cursor && cursor.escalateToScopeType && cursor.escalateToRef) {
-    const next: AuthorityLimit | null = bestLimitForScope(
-      limits,
-      cursor.escalateToScopeType,
-      cursor.escalateToRef,
-      authorityType,
-      onDate,
-    );
-    if (!next || visited.has(next.id)) break; // dead end or cycle
-    visited.add(next.id);
-    const node = { scopeType: next.scopeType, scopeRef: next.scopeRef, maxAmount: next.maxAmount };
-    chain.push(node);
-    if (amount <= next.maxAmount) {
-      return { escalationChain: chain, finalApprover: node, covered: true };
-    }
-    cursor = next;
-  }
-  return { escalationChain: chain, finalApprover: null, covered: false };
-}
+): Pick<AuthorityDecision, "escalationChain" | "finalApprover" | "covered"> {}
 
 /**
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: Cannot read properties of undefined (reading 'escalationChain')

[Survived] ArrayDeclaration
src/modules/authority/domain.ts:130:35
   onDate: string,
 ): Pick<AuthorityDecision, "escalationChain" | "finalApprover" | "covered"> {
   const chain: AuthorityDecision["escalationChain"] = [];
-  const visited = new Set<string>([start.id]);
+  const visited = new Set<string>([]);
   let cursor: AuthorityLimit | null = start;
 

[Killed] ConditionalExpression
src/modules/authority/domain.ts:133:10
   const visited = new Set<string>([start.id]);
   let cursor: AuthorityLimit | null = start;
 
-  while (cursor && cursor.escalateToScopeType && cursor.escalateToRef) {
+  while (false) {
     const next: AuthorityLimit | null = bestLimitForScope(
       limits,
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected [] to deeply equal [ 'director' ]

[Survived] ConditionalExpression
src/modules/authority/domain.ts:133:10
   const visited = new Set<string>([start.id]);
   let cursor: AuthorityLimit | null = start;
 
-  while (cursor && cursor.escalateToScopeType && cursor.escalateToRef) {
+  while (true && cursor.escalateToRef) {
     const next: AuthorityLimit | null = bestLimitForScope(
       limits,

[Killed] ConditionalExpression
src/modules/authority/domain.ts:141:9
       authorityType,
       onDate,
     );
-    if (!next || visited.has(next.id)) break; // dead end or cycle
+    if (true) break; // dead end or cycle
     visited.add(next.id);
     const node = { scopeType: next.scopeType, scopeRef: next.scopeRef, maxAmount: next.maxAmount };
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected [] to deeply equal [ 'director' ]

[Killed] BooleanLiteral
src/modules/authority/domain.ts:141:9
       authorityType,
       onDate,
     );
-    if (!next || visited.has(next.id)) break; // dead end or cycle
+    if (next || visited.has(next.id)) break; // dead end or cycle
     visited.add(next.id);
     const node = { scopeType: next.scopeType, scopeRef: next.scopeRef, maxAmount: next.maxAmount };
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected [] to deeply equal [ 'director' ]

[Killed] ConditionalExpression
src/modules/authority/domain.ts:145:9
     visited.add(next.id);
     const node = { scopeType: next.scopeType, scopeRef: next.scopeRef, maxAmount: next.maxAmount };
     chain.push(node);
-    if (amount <= next.maxAmount) {
+    if (false) {
       return { escalationChain: chain, finalApprover: node, covered: true };
     }
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected [ 'director', 'board' ] to deeply equal [ 'director' ]

[Killed] BlockStatement
src/modules/authority/domain.ts:145:35
     visited.add(next.id);
     const node = { scopeType: next.scopeType, scopeRef: next.scopeRef, maxAmount: next.maxAmount };
     chain.push(node);
-    if (amount <= next.maxAmount) {
-      return { escalationChain: chain, finalApprover: node, covered: true };
-    }
+    if (amount <= next.maxAmount) {}
     cursor = next;
   }
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected [ 'director', 'board' ] to deeply equal [ 'director' ]

[Killed] BooleanLiteral
src/modules/authority/domain.ts:146:70
     const node = { scopeType: next.scopeType, scopeRef: next.scopeRef, maxAmount: next.maxAmount };
     chain.push(node);
     if (amount <= next.maxAmount) {
-      return { escalationChain: chain, finalApprover: node, covered: true };
+      return { escalationChain: chain, finalApprover: node, covered: false };
     }
     cursor = next;
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/modules/authority/domain.ts:150:66
     }
     cursor = next;
   }
-  return { escalationChain: chain, finalApprover: null, covered: false };
+  return { escalationChain: chain, finalApprover: null, covered: true };
 }
 
killedBy: evaluateAuthority — limit exceeded triggers escalation reports uncovered when no office in the chain can authorise the amount
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/modules/authority/domain.ts:150:10
     }
     cursor = next;
   }
-  return { escalationChain: chain, finalApprover: null, covered: false };
+  return {};
 }
 
killedBy: evaluateAuthority — limit exceeded triggers escalation reports uncovered when no office in the chain can authorise the amount
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/modules/authority/domain.ts:169:20
   onDate: string,
 ): AuthorityDecision {
   const actorLimit = resolveActorLimit(limits, actor, authorityType, onDate);
-  const actorMax = actorLimit?.maxAmount ?? 0n;
+  const actorMax = actorLimit?.maxAmount && 0n;
   const withinActorAuthority = actorLimit !== null && amount <= actorMax;
 
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected false to be true // Object.is equality

[Survived] OptionalChaining
src/modules/authority/domain.ts:169:20
   onDate: string,
 ): AuthorityDecision {
   const actorLimit = resolveActorLimit(limits, actor, authorityType, onDate);
-  const actorMax = actorLimit?.maxAmount ?? 0n;
+  const actorMax = actorLimit.maxAmount ?? 0n;
   const withinActorAuthority = actorLimit !== null && amount <= actorMax;
 

[Killed] EqualityOperator
src/modules/authority/domain.ts:170:32
 ): AuthorityDecision {
   const actorLimit = resolveActorLimit(limits, actor, authorityType, onDate);
   const actorMax = actorLimit?.maxAmount ?? 0n;
-  const withinActorAuthority = actorLimit !== null && amount <= actorMax;
+  const withinActorAuthority = actorLimit === null && amount <= actorMax;
 
   if (withinActorAuthority) {
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/modules/authority/domain.ts:170:55
 ): AuthorityDecision {
   const actorLimit = resolveActorLimit(limits, actor, authorityType, onDate);
   const actorMax = actorLimit?.maxAmount ?? 0n;
-  const withinActorAuthority = actorLimit !== null && amount <= actorMax;
+  const withinActorAuthority = actorLimit !== null && amount > actorMax;
 
   if (withinActorAuthority) {
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/authority/domain.ts:172:29
   const actorMax = actorLimit?.maxAmount ?? 0n;
   const withinActorAuthority = actorLimit !== null && amount <= actorMax;
 
-  if (withinActorAuthority) {
-    return {
-      actorLimit,
-      actorMax,
-      withinActorAuthority: true,
-      requiresEscalation: false,
-      escalationChain: [],
-      finalApprover: actorLimit
-        ? { scopeType: actorLimit.scopeType, scopeRef: actorLimit.scopeRef, maxAmount: actorLimit.maxAmount }
-        : null,
-      covered: true,
-    };
-  }
+  if (withinActorAuthority) {}
 
   // Exceeds (or actor holds no limit): escalate from the actor's best limit.
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/authority/domain.ts:172:7
   const actorMax = actorLimit?.maxAmount ?? 0n;
   const withinActorAuthority = actorLimit !== null && amount <= actorMax;
 
-  if (withinActorAuthority) {
+  if (false) {
     return {
       actorLimit,
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/modules/authority/domain.ts:176:29
     return {
       actorLimit,
       actorMax,
-      withinActorAuthority: true,
+      withinActorAuthority: false,
       requiresEscalation: false,
       escalationChain: [],
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/modules/authority/domain.ts:177:27
       actorLimit,
       actorMax,
       withinActorAuthority: true,
-      requiresEscalation: false,
+      requiresEscalation: true,
       escalationChain: [],
       finalApprover: actorLimit
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/modules/authority/domain.ts:180:11
       requiresEscalation: false,
       escalationChain: [],
       finalApprover: actorLimit
-        ? { scopeType: actorLimit.scopeType, scopeRef: actorLimit.scopeRef, maxAmount: actorLimit.maxAmount }
+        ? {}
         : null,
       covered: true,
killedBy: evaluateAuthority — within authority approves when amount is within the actor's own limit (no escalation)
statusReason: expected undefined to be 'director' // Object.is equality

[Survived] BooleanLiteral
src/modules/authority/domain.ts:182:16
       finalApprover: actorLimit
         ? { scopeType: actorLimit.scopeType, scopeRef: actorLimit.scopeRef, maxAmount: actorLimit.maxAmount }
         : null,
-      covered: true,
+      covered: false,
     };
   }

[NoCoverage] BooleanLiteral
src/modules/authority/domain.ts:189:60
   // Exceeds (or actor holds no limit): escalate from the actor's best limit.
   const esc = actorLimit
     ? resolveEscalation(limits, actorLimit, amount, authorityType, onDate)
-    : { escalationChain: [], finalApprover: null, covered: false };
+    : { escalationChain: [], finalApprover: null, covered: true };
 
   return {

[Killed] ObjectLiteral
src/modules/authority/domain.ts:191:10
     ? resolveEscalation(limits, actorLimit, amount, authorityType, onDate)
     : { escalationChain: [], finalApprover: null, covered: false };
 
-  return {
-    actorLimit,
-    actorMax,
-    withinActorAuthority: false,
-    requiresEscalation: true,
-    escalationChain: esc.escalationChain,
-    finalApprover: esc.finalApprover,
-    covered: esc.covered,
-  };
+  return {};
 }
 
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/modules/authority/domain.ts:194:27
   return {
     actorLimit,
     actorMax,
-    withinActorAuthority: false,
+    withinActorAuthority: true,
     requiresEscalation: true,
     escalationChain: esc.escalationChain,
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/modules/authority/domain.ts:195:25
     actorLimit,
     actorMax,
     withinActorAuthority: false,
-    requiresEscalation: true,
+    requiresEscalation: false,
     escalationChain: esc.escalationChain,
     finalApprover: esc.finalApprover,
killedBy: evaluateAuthority — limit exceeded triggers escalation escalates an officer's over-limit request up to the director who can cover it
statusReason: expected false to be true // Object.is equality
