[Killed] MethodExpression
src/modules/quorum/domain.ts:50:17
  *  - threshold(N): approve once approvals reach N; reject once N is unreachable.
  */
 export function tallyQuorum(input: QuorumInput): QuorumTally {
-  const total = Math.max(0, Math.trunc(input.totalMembers));
+  const total = Math.min(0, Math.trunc(input.totalMembers));
   let approvals = 0;
   let rejections = 0;
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/quorum/domain.ts:54:32
   let approvals = 0;
   let rejections = 0;
   let abstentions = 0;
-  for (const v of input.votes) {
-    if (v === "approve") approvals++;
-    else if (v === "reject") rejections++;
-    else abstentions++;
-  }
+  for (const v of input.votes) {}
   const cast = approvals + rejections + abstentions;
   const pending = Math.max(0, total - cast);
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:55:9
   let rejections = 0;
   let abstentions = 0;
   for (const v of input.votes) {
-    if (v === "approve") approvals++;
+    if (true) approvals++;
     else if (v === "reject") rejections++;
     else abstentions++;
killedBy: tallyQuorum — majority rejects once approval is mathematically unreachable
statusReason: expected 'approve' to be 'reject' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:55:9
   let rejections = 0;
   let abstentions = 0;
   for (const v of input.votes) {
-    if (v === "approve") approvals++;
+    if (v !== "approve") approvals++;
     else if (v === "reject") rejections++;
     else abstentions++;
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected 'reject' to be 'approve' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:56:14
   let abstentions = 0;
   for (const v of input.votes) {
     if (v === "approve") approvals++;
-    else if (v === "reject") rejections++;
+    else if (v !== "reject") rejections++;
     else abstentions++;
   }
killedBy: tallyQuorum — unanimous rejects the instant any member rejects
statusReason: expected null to be 'reject' // Object.is equality

[Killed] UpdateOperator
src/modules/quorum/domain.ts:56:30
   let abstentions = 0;
   for (const v of input.votes) {
     if (v === "approve") approvals++;
-    else if (v === "reject") rejections++;
+    else if (v === "reject") rejections--;
     else abstentions++;
   }
killedBy: tallyQuorum — majority rejects once approval is mathematically unreachable
statusReason: expected false to be true // Object.is equality

[Killed] UpdateOperator
src/modules/quorum/domain.ts:57:10
   for (const v of input.votes) {
     if (v === "approve") approvals++;
     else if (v === "reject") rejections++;
-    else abstentions++;
+    else abstentions--;
   }
   const cast = approvals + rejections + abstentions;
killedBy: tallyQuorum — unanimous rejects when all voted but an abstention broke unanimity
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/modules/quorum/domain.ts:59:16
     else if (v === "reject") rejections++;
     else abstentions++;
   }
-  const cast = approvals + rejections + abstentions;
+  const cast = approvals + rejections - abstentions;
   const pending = Math.max(0, total - cast);
   const base: Omit<QuorumTally, "decided" | "outcome" | "rationale"> = {
killedBy: tallyQuorum — unanimous rejects when all voted but an abstention broke unanimity
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/modules/quorum/domain.ts:59:16
     else if (v === "reject") rejections++;
     else abstentions++;
   }
-  const cast = approvals + rejections + abstentions;
+  const cast = approvals - rejections + abstentions;
   const pending = Math.max(0, total - cast);
   const base: Omit<QuorumTally, "decided" | "outcome" | "rationale"> = {
killedBy: tallyQuorum — threshold rejects once the threshold is unreachable
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/modules/quorum/domain.ts:60:19
     else abstentions++;
   }
   const cast = approvals + rejections + abstentions;
-  const pending = Math.max(0, total - cast);
+  const pending = Math.min(0, total - cast);
   const base: Omit<QuorumTally, "decided" | "outcome" | "rationale"> = {
     approvals,
killedBy: tallyQuorum — majority stays pending before a majority is reached
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/modules/quorum/domain.ts:60:31
     else abstentions++;
   }
   const cast = approvals + rejections + abstentions;
-  const pending = Math.max(0, total - cast);
+  const pending = Math.max(0, total + cast);
   const base: Omit<QuorumTally, "decided" | "outcome" | "rationale"> = {
     approvals,
killedBy: tallyQuorum — unanimous rejects when all voted but an abstention broke unanimity
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/modules/quorum/domain.ts:69:18
     pending,
   };
 
-  const settle = (outcome: Outcome | null, rationale: string): QuorumTally => ({
-    ...base,
-    decided: outcome !== null,
-    outcome,
-    rationale,
-  });
+  const settle = () => undefined;
 
   if (total <= 0) return settle(null, "no eligible members");
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: Cannot read properties of undefined (reading 'decided')

[Killed] ObjectLiteral
src/modules/quorum/domain.ts:69:80
     pending,
   };
 
-  const settle = (outcome: Outcome | null, rationale: string): QuorumTally => ({
-    ...base,
-    decided: outcome !== null,
-    outcome,
-    rationale,
-  });
+  const settle = (outcome: Outcome | null, rationale: string): QuorumTally => ({});
 
   if (total <= 0) return settle(null, "no eligible members");
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:71:14
 
   const settle = (outcome: Outcome | null, rationale: string): QuorumTally => ({
     ...base,
-    decided: outcome !== null,
+    decided: outcome === null,
     outcome,
     rationale,
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:71:14
 
   const settle = (outcome: Outcome | null, rationale: string): QuorumTally => ({
     ...base,
-    decided: outcome !== null,
+    decided: true,
     outcome,
     rationale,
killedBy: tallyQuorum — majority stays pending before a majority is reached
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:76:7
     rationale,
   });
 
-  if (total <= 0) return settle(null, "no eligible members");
+  if (total > 0) return settle(null, "no eligible members");
 
   switch (input.rule) {
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:76:7
     rationale,
   });
 
-  if (total <= 0) return settle(null, "no eligible members");
+  if (total < 0) return settle(null, "no eligible members");
 
   switch (input.rule) {
killedBy: tallyQuorum — edge cases returns undecided for zero membership
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/modules/quorum/domain.ts:79:22
   if (total <= 0) return settle(null, "no eligible members");
 
   switch (input.rule) {
-    case "majority": {
-      const half = total / 2;
-      if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
-      if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
-      // approval unreachable even if every pending member approves
-      if (approvals + pending <= half) {
-        return settle("reject", `approval unreachable (max ${approvals + pending}/${total})`);
-      }
-      return settle(null, `pending (${approvals} approve / ${rejections} reject / ${pending} awaited)`);
-    }
+    case "majority": {}
     case "unanimous": {
       if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:79:5
   if (total <= 0) return settle(null, "no eligible members");
 
   switch (input.rule) {
-    case "majority": {
-      const half = total / 2;
-      if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
-      if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
-      // approval unreachable even if every pending member approves
-      if (approvals + pending <= half) {
-        return settle("reject", `approval unreachable (max ${approvals + pending}/${total})`);
-      }
-      return settle(null, `pending (${approvals} approve / ${rejections} reject / ${pending} awaited)`);
-    }
+    case "majority":
     case "unanimous": {
       if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/modules/quorum/domain.ts:80:20
 
   switch (input.rule) {
     case "majority": {
-      const half = total / 2;
+      const half = total * 2;
       if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
       if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected 'reject' to be 'approve' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:81:11
   switch (input.rule) {
     case "majority": {
       const half = total / 2;
-      if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
+      if (false) return settle("approve", `majority reached (${approvals}/${total})`);
       if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
       // approval unreachable even if every pending member approves
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:81:11
   switch (input.rule) {
     case "majority": {
       const half = total / 2;
-      if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
+      if (approvals <= half) return settle("approve", `majority reached (${approvals}/${total})`);
       if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
       // approval unreachable even if every pending member approves
killedBy: tallyQuorum — majority approves once approvals exceed half the membership
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:82:11
     case "majority": {
       const half = total / 2;
       if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
-      if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
+      if (rejections <= half) return settle("reject", `majority rejected (${rejections}/${total})`);
       // approval unreachable even if every pending member approves
       if (approvals + pending <= half) {
killedBy: tallyQuorum — majority stays pending before a majority is reached
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:82:11
     case "majority": {
       const half = total / 2;
       if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
-      if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
+      if (true) return settle("reject", `majority rejected (${rejections}/${total})`);
       // approval unreachable even if every pending member approves
       if (approvals + pending <= half) {
killedBy: tallyQuorum — majority stays pending before a majority is reached
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:84:11
       if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
       if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
       // approval unreachable even if every pending member approves
-      if (approvals + pending <= half) {
+      if (approvals + pending > half) {
         return settle("reject", `approval unreachable (max ${approvals + pending}/${total})`);
       }
killedBy: tallyQuorum — majority stays pending before a majority is reached
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/modules/quorum/domain.ts:84:11
       if (approvals > half) return settle("approve", `majority reached (${approvals}/${total})`);
       if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
       // approval unreachable even if every pending member approves
-      if (approvals + pending <= half) {
+      if (approvals - pending <= half) {
         return settle("reject", `approval unreachable (max ${approvals + pending}/${total})`);
       }
killedBy: tallyQuorum — majority stays pending before a majority is reached
statusReason: expected true to be false // Object.is equality

[NoCoverage] ArithmeticOperator
src/modules/quorum/domain.ts:85:62
       if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
       // approval unreachable even if every pending member approves
       if (approvals + pending <= half) {
-        return settle("reject", `approval unreachable (max ${approvals + pending}/${total})`);
+        return settle("reject", `approval unreachable (max ${approvals - pending}/${total})`);
       }
       return settle(null, `pending (${approvals} approve / ${rejections} reject / ${pending} awaited)`);

[NoCoverage] StringLiteral
src/modules/quorum/domain.ts:85:23
       if (rejections > half) return settle("reject", `majority rejected (${rejections}/${total})`);
       // approval unreachable even if every pending member approves
       if (approvals + pending <= half) {
-        return settle("reject", `approval unreachable (max ${approvals + pending}/${total})`);
+        return settle("", `approval unreachable (max ${approvals + pending}/${total})`);
       }
       return settle(null, `pending (${approvals} approve / ${rejections} reject / ${pending} awaited)`);

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:89:5
       }
       return settle(null, `pending (${approvals} approve / ${rejections} reject / ${pending} awaited)`);
     }
-    case "unanimous": {
-      if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
-      if (approvals === total) return settle("approve", `unanimous (${approvals}/${total})`);
-      if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
-      return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
-    }
+    case "unanimous":
     case "threshold": {
       const need = Math.max(1, Math.trunc(input.threshold ?? 0));
killedBy: tallyQuorum — unanimous approves only when every member approves
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/modules/quorum/domain.ts:89:23
       }
       return settle(null, `pending (${approvals} approve / ${rejections} reject / ${pending} awaited)`);
     }
-    case "unanimous": {
-      if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
-      if (approvals === total) return settle("approve", `unanimous (${approvals}/${total})`);
-      if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
-      return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
-    }
+    case "unanimous": {}
     case "threshold": {
       const need = Math.max(1, Math.trunc(input.threshold ?? 0));
killedBy: tallyQuorum — unanimous approves only when every member approves
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:90:11
       return settle(null, `pending (${approvals} approve / ${rejections} reject / ${pending} awaited)`);
     }
     case "unanimous": {
-      if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
+      if (true) return settle("reject", "unanimity broken by a rejection");
       if (approvals === total) return settle("approve", `unanimous (${approvals}/${total})`);
       if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
killedBy: tallyQuorum — unanimous approves only when every member approves
statusReason: expected 'reject' to be 'approve' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:90:11
       return settle(null, `pending (${approvals} approve / ${rejections} reject / ${pending} awaited)`);
     }
     case "unanimous": {
-      if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
+      if (rejections >= 0) return settle("reject", "unanimity broken by a rejection");
       if (approvals === total) return settle("approve", `unanimous (${approvals}/${total})`);
       if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
killedBy: tallyQuorum — unanimous approves only when every member approves
statusReason: expected 'reject' to be 'approve' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:91:11
     }
     case "unanimous": {
       if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
-      if (approvals === total) return settle("approve", `unanimous (${approvals}/${total})`);
+      if (false) return settle("approve", `unanimous (${approvals}/${total})`);
       if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
       return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
killedBy: tallyQuorum — unanimous approves only when every member approves
statusReason: expected 'reject' to be 'approve' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:91:11
     }
     case "unanimous": {
       if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
-      if (approvals === total) return settle("approve", `unanimous (${approvals}/${total})`);
+      if (approvals !== total) return settle("approve", `unanimous (${approvals}/${total})`);
       if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
       return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
killedBy: tallyQuorum — unanimous approves only when every member approves
statusReason: expected 'reject' to be 'approve' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:92:11
     case "unanimous": {
       if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
       if (approvals === total) return settle("approve", `unanimous (${approvals}/${total})`);
-      if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
+      if (true) return settle("reject", "all voted but not unanimous (abstention present)");
       return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
     }
killedBy: tallyQuorum — unanimous approves only when every member approves
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:92:11
     case "unanimous": {
       if (rejections > 0) return settle("reject", "unanimity broken by a rejection");
       if (approvals === total) return settle("approve", `unanimous (${approvals}/${total})`);
-      if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
+      if (pending !== 0) return settle("reject", "all voted but not unanimous (abstention present)");
       return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
     }
killedBy: tallyQuorum — unanimous approves only when every member approves
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:95:5
       if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
       return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
     }
-    case "threshold": {
-      const need = Math.max(1, Math.trunc(input.threshold ?? 0));
-      if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
-      if (approvals + pending < need) {
-        return settle("reject", `threshold unreachable (max ${approvals + pending}/${need})`);
-      }
-      return settle(null, `pending threshold (${approvals}/${need}, ${pending} awaited)`);
-    }
+    case "threshold":
   }
 }
killedBy: tallyQuorum — threshold approves once approvals reach the threshold
statusReason: Cannot read properties of undefined (reading 'outcome')

[Killed] BlockStatement
src/modules/quorum/domain.ts:95:23
       if (pending === 0) return settle("reject", "all voted but not unanimous (abstention present)");
       return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
     }
-    case "threshold": {
-      const need = Math.max(1, Math.trunc(input.threshold ?? 0));
-      if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
-      if (approvals + pending < need) {
-        return settle("reject", `threshold unreachable (max ${approvals + pending}/${need})`);
-      }
-      return settle(null, `pending threshold (${approvals}/${need}, ${pending} awaited)`);
-    }
+    case "threshold": {}
   }
 }
killedBy: tallyQuorum — threshold approves once approvals reach the threshold
statusReason: Cannot read properties of undefined (reading 'outcome')

[Killed] MethodExpression
src/modules/quorum/domain.ts:96:20
       return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
     }
     case "threshold": {
-      const need = Math.max(1, Math.trunc(input.threshold ?? 0));
+      const need = Math.min(1, Math.trunc(input.threshold ?? 0));
       if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
       if (approvals + pending < need) {
killedBy: tallyQuorum — threshold rejects once the threshold is unreachable
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/modules/quorum/domain.ts:96:43
       return settle(null, `pending unanimity (${approvals}/${total}, ${pending} awaited)`);
     }
     case "threshold": {
-      const need = Math.max(1, Math.trunc(input.threshold ?? 0));
+      const need = Math.max(1, Math.trunc(input.threshold && 0));
       if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
       if (approvals + pending < need) {
killedBy: tallyQuorum — threshold rejects once the threshold is unreachable
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:97:11
     }
     case "threshold": {
       const need = Math.max(1, Math.trunc(input.threshold ?? 0));
-      if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
+      if (false) return settle("approve", `threshold met (${approvals}/${need})`);
       if (approvals + pending < need) {
         return settle("reject", `threshold unreachable (max ${approvals + pending}/${need})`);
killedBy: tallyQuorum — threshold approves once approvals reach the threshold
statusReason: expected null to be 'approve' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:97:11
     }
     case "threshold": {
       const need = Math.max(1, Math.trunc(input.threshold ?? 0));
-      if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
+      if (true) return settle("approve", `threshold met (${approvals}/${need})`);
       if (approvals + pending < need) {
         return settle("reject", `threshold unreachable (max ${approvals + pending}/${need})`);
killedBy: tallyQuorum — threshold rejects once the threshold is unreachable
statusReason: expected 'approve' to be 'reject' // Object.is equality

[Killed] BlockStatement
src/modules/quorum/domain.ts:98:39
     case "threshold": {
       const need = Math.max(1, Math.trunc(input.threshold ?? 0));
       if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
-      if (approvals + pending < need) {
-        return settle("reject", `threshold unreachable (max ${approvals + pending}/${need})`);
-      }
+      if (approvals + pending < need) {}
       return settle(null, `pending threshold (${approvals}/${need}, ${pending} awaited)`);
     }
killedBy: tallyQuorum — threshold rejects once the threshold is unreachable
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:98:11
     case "threshold": {
       const need = Math.max(1, Math.trunc(input.threshold ?? 0));
       if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
-      if (approvals + pending < need) {
+      if (false) {
         return settle("reject", `threshold unreachable (max ${approvals + pending}/${need})`);
       }
killedBy: tallyQuorum — threshold rejects once the threshold is unreachable
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/modules/quorum/domain.ts:99:63
       const need = Math.max(1, Math.trunc(input.threshold ?? 0));
       if (approvals >= need) return settle("approve", `threshold met (${approvals}/${need})`);
       if (approvals + pending < need) {
-        return settle("reject", `threshold unreachable (max ${approvals + pending}/${need})`);
+        return settle("reject", `threshold unreachable (max ${approvals - pending}/${need})`);
       }
       return settle(null, `pending threshold (${approvals}/${need}, ${pending} awaited)`);

[NoCoverage] StringLiteral
src/modules/quorum/domain.ts:101:27
       if (approvals + pending < need) {
         return settle("reject", `threshold unreachable (max ${approvals + pending}/${need})`);
       }
-      return settle(null, `pending threshold (${approvals}/${need}, ${pending} awaited)`);
+      return settle(null, ``);
     }
   }

[Killed] BlockStatement
src/modules/quorum/domain.ts:124:100
  *  - any (any-one): approve the instant any branch approved; reject only when
  *    every branch rejected; otherwise pending.
  */
-export function consolidateParallel(mode: ParallelMode, branches: BranchOutcome[]): ParallelResult {
-  const approvals = branches.filter((b) => b === "approve").length;
-  const rejections = branches.filter((b) => b === "reject").length;
-  const pending = branches.filter((b) => b === "pending").length;
-  const n = branches.length;
-  const base = { approvals, rejections, pending };
-
-  if (n === 0) return { ...base, outcome: "pending", rationale: "no branches" };
-
-  if (mode === "all") {
-    if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
-    if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
-    return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
-  }
-  // any
-  if (approvals > 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
-  if (rejections === n) return { ...base, outcome: "reject", rationale: "all branches rejected" };
-  return { ...base, outcome: "pending", rationale: `awaiting a branch approval (${rejections}/${n} rejected)` };
-}
+export function consolidateParallel(mode: ParallelMode, branches: BranchOutcome[]): ParallelResult {}
 
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: Cannot read properties of undefined (reading 'outcome')
