[Killed] ConditionalExpression
src/modules/quorum/domain.ts:125:44
  *    every branch rejected; otherwise pending.
  */
 export function consolidateParallel(mode: ParallelMode, branches: BranchOutcome[]): ParallelResult {
-  const approvals = branches.filter((b) => b === "approve").length;
+  const approvals = branches.filter((b) => true).length;
   const rejections = branches.filter((b) => b === "reject").length;
   const pending = branches.filter((b) => b === "pending").length;
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'approve' to be 'pending' // Object.is equality

[Killed] MethodExpression
src/modules/quorum/domain.ts:125:21
  *    every branch rejected; otherwise pending.
  */
 export function consolidateParallel(mode: ParallelMode, branches: BranchOutcome[]): ParallelResult {
-  const approvals = branches.filter((b) => b === "approve").length;
+  const approvals = branches.length;
   const rejections = branches.filter((b) => b === "reject").length;
   const pending = branches.filter((b) => b === "pending").length;
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'approve' to be 'pending' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:126:45
  */
 export function consolidateParallel(mode: ParallelMode, branches: BranchOutcome[]): ParallelResult {
   const approvals = branches.filter((b) => b === "approve").length;
-  const rejections = branches.filter((b) => b === "reject").length;
+  const rejections = branches.filter((b) => false).length;
   const pending = branches.filter((b) => b === "pending").length;
   const n = branches.length;
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'pending' to be 'reject' // Object.is equality

[Killed] ArrowFunction
src/modules/quorum/domain.ts:126:38
  */
 export function consolidateParallel(mode: ParallelMode, branches: BranchOutcome[]): ParallelResult {
   const approvals = branches.filter((b) => b === "approve").length;
-  const rejections = branches.filter((b) => b === "reject").length;
+  const rejections = branches.filter(() => undefined).length;
   const pending = branches.filter((b) => b === "pending").length;
   const n = branches.length;
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'pending' to be 'reject' // Object.is equality

[Survived] EqualityOperator
src/modules/quorum/domain.ts:127:42
 export function consolidateParallel(mode: ParallelMode, branches: BranchOutcome[]): ParallelResult {
   const approvals = branches.filter((b) => b === "approve").length;
   const rejections = branches.filter((b) => b === "reject").length;
-  const pending = branches.filter((b) => b === "pending").length;
+  const pending = branches.filter((b) => b !== "pending").length;
   const n = branches.length;
   const base = { approvals, rejections, pending };

[Survived] ArrowFunction
src/modules/quorum/domain.ts:127:35
 export function consolidateParallel(mode: ParallelMode, branches: BranchOutcome[]): ParallelResult {
   const approvals = branches.filter((b) => b === "approve").length;
   const rejections = branches.filter((b) => b === "reject").length;
-  const pending = branches.filter((b) => b === "pending").length;
+  const pending = branches.filter(() => undefined).length;
   const n = branches.length;
   const base = { approvals, rejections, pending };

[Survived] ObjectLiteral
src/modules/quorum/domain.ts:129:16
   const rejections = branches.filter((b) => b === "reject").length;
   const pending = branches.filter((b) => b === "pending").length;
   const n = branches.length;
-  const base = { approvals, rejections, pending };
+  const base = {};
 
   if (n === 0) return { ...base, outcome: "pending", rationale: "no branches" };

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:131:7
   const n = branches.length;
   const base = { approvals, rejections, pending };
 
-  if (n === 0) return { ...base, outcome: "pending", rationale: "no branches" };
+  if (true) return { ...base, outcome: "pending", rationale: "no branches" };
 
   if (mode === "all") {
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'pending' to be 'approve' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:131:7
   const n = branches.length;
   const base = { approvals, rejections, pending };
 
-  if (n === 0) return { ...base, outcome: "pending", rationale: "no branches" };
+  if (n !== 0) return { ...base, outcome: "pending", rationale: "no branches" };
 
   if (mode === "all") {
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'pending' to be 'approve' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:133:7
 
   if (n === 0) return { ...base, outcome: "pending", rationale: "no branches" };
 
-  if (mode === "all") {
+  if (false) {
     if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
     if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'approve' to be 'pending' // Object.is equality

[Killed] BlockStatement
src/modules/quorum/domain.ts:133:23
 
   if (n === 0) return { ...base, outcome: "pending", rationale: "no branches" };
 
-  if (mode === "all") {
-    if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
-    if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
-    return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
-  }
+  if (mode === "all") {}
   // any
   if (approvals > 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'approve' to be 'pending' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:134:9
   if (n === 0) return { ...base, outcome: "pending", rationale: "no branches" };
 
   if (mode === "all") {
-    if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
+    if (rejections <= 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
     if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
     return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'reject' to be 'approve' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:134:9
   if (n === 0) return { ...base, outcome: "pending", rationale: "no branches" };
 
   if (mode === "all") {
-    if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
+    if (rejections >= 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
     if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
     return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'reject' to be 'approve' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:135:9
 
   if (mode === "all") {
     if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
-    if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
+    if (true) return { ...base, outcome: "approve", rationale: "all branches approved" };
     return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
   }
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'approve' to be 'pending' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:135:9
 
   if (mode === "all") {
     if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
-    if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
+    if (approvals !== n) return { ...base, outcome: "approve", rationale: "all branches approved" };
     return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
   }
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected 'pending' to be 'approve' // Object.is equality

[Killed] StringLiteral
src/modules/quorum/domain.ts:136:32
   if (mode === "all") {
     if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
     if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
-    return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
+    return { ...base, outcome: "", rationale: `${approvals}/${n} branches approved` };
   }
   // any
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected '' to be 'pending' // Object.is equality

[Killed] ObjectLiteral
src/modules/quorum/domain.ts:136:12
   if (mode === "all") {
     if (rejections > 0) return { ...base, outcome: "reject", rationale: "a required branch rejected" };
     if (approvals === n) return { ...base, outcome: "approve", rationale: "all branches approved" };
-    return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
+    return {};
   }
   // any
killedBy: consolidateParallel — all-must approves only when all branches approve
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:139:7
     return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
   }
   // any
-  if (approvals > 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
+  if (approvals <= 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
   if (rejections === n) return { ...base, outcome: "reject", rationale: "all branches rejected" };
   return { ...base, outcome: "pending", rationale: `awaiting a branch approval (${rejections}/${n} rejected)` };
killedBy: consolidateParallel — any approves on the first branch approval and rejects only when all reject
statusReason: expected 'pending' to be 'approve' // Object.is equality

[Killed] EqualityOperator
src/modules/quorum/domain.ts:139:7
     return { ...base, outcome: "pending", rationale: `${approvals}/${n} branches approved` };
   }
   // any
-  if (approvals > 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
+  if (approvals >= 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
   if (rejections === n) return { ...base, outcome: "reject", rationale: "all branches rejected" };
   return { ...base, outcome: "pending", rationale: `awaiting a branch approval (${rejections}/${n} rejected)` };
killedBy: consolidateParallel — any approves on the first branch approval and rejects only when all reject
statusReason: expected 'approve' to be 'reject' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:140:7
   }
   // any
   if (approvals > 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
-  if (rejections === n) return { ...base, outcome: "reject", rationale: "all branches rejected" };
+  if (false) return { ...base, outcome: "reject", rationale: "all branches rejected" };
   return { ...base, outcome: "pending", rationale: `awaiting a branch approval (${rejections}/${n} rejected)` };
 }
killedBy: consolidateParallel — any approves on the first branch approval and rejects only when all reject
statusReason: expected 'pending' to be 'reject' // Object.is equality

[Killed] ConditionalExpression
src/modules/quorum/domain.ts:140:7
   }
   // any
   if (approvals > 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
-  if (rejections === n) return { ...base, outcome: "reject", rationale: "all branches rejected" };
+  if (true) return { ...base, outcome: "reject", rationale: "all branches rejected" };
   return { ...base, outcome: "pending", rationale: `awaiting a branch approval (${rejections}/${n} rejected)` };
 }
killedBy: consolidateParallel — any approves on the first branch approval and rejects only when all reject
statusReason: expected 'reject' to be 'pending' // Object.is equality

[Killed] ObjectLiteral
src/modules/quorum/domain.ts:141:10
   // any
   if (approvals > 0) return { ...base, outcome: "approve", rationale: "a branch approved" };
   if (rejections === n) return { ...base, outcome: "reject", rationale: "all branches rejected" };
-  return { ...base, outcome: "pending", rationale: `awaiting a branch approval (${rejections}/${n} rejected)` };
+  return {};
 }
 
killedBy: consolidateParallel — any approves on the first branch approval and rejects only when all reject
statusReason: expected undefined to be 'pending' // Object.is equality
