[Survived] StringLiteral
src/modules/budget/domain.ts:6:17
 export class DomainError extends Error {
   constructor(public code: string, message: string) {
     super(`[${code}] ${message}`);
-    this.name = "DomainError";
+    this.name = "";
   }
 }

[Killed] BlockStatement
src/modules/budget/domain.ts:18:65
 }
 
 /** Returns available balance (re_minor - utilised_minor). */
-export function availableBalance(b: BudgetAvailability): bigint {
-  return b.reMinor - b.utilisedMinor;
-}
+export function availableBalance(b: BudgetAvailability): bigint {}
 
 /** Throws if bill amount exceeds available budget. */
killedBy: budget/domain — availableBalance() returns RE minus utilised
statusReason: expected undefined to be 600000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/budget/domain.ts:19:10
 
 /** Returns available balance (re_minor - utilised_minor). */
 export function availableBalance(b: BudgetAvailability): bigint {
-  return b.reMinor - b.utilisedMinor;
+  return b.reMinor + b.utilisedMinor;
 }
 
killedBy: budget/domain — availableBalance() returns RE minus utilised
statusReason: expected 1400000n to be 600000n // Object.is equality

[Killed] BlockStatement
src/modules/budget/domain.ts:23:85
 }
 
 /** Throws if bill amount exceeds available budget. */
-export function assertBudgetNotExceeded(available: bigint, requested: bigint): void {
-  if (requested > available) {
-    throw new DomainError(
-      "BUDGET_EXCEEDED",
-      `requested ${requested} paise exceeds available ${available} paise`
-    );
-  }
-}
+export function assertBudgetNotExceeded(available: bigint, requested: bigint): void {}
 
 export interface SanctionAvailability {
killedBy: budget/domain — assertBudgetNotExceeded() throws BUDGET_EXCEEDED when over budget
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/modules/budget/domain.ts:24:7
 
 /** Throws if bill amount exceeds available budget. */
 export function assertBudgetNotExceeded(available: bigint, requested: bigint): void {
-  if (requested > available) {
+  if (requested >= available) {
     throw new DomainError(
       "BUDGET_EXCEEDED",
killedBy: budget/domain — assertBudgetNotExceeded() passes when exactly at budget
statusReason: expected [Function] to not throw an error but 'DomainError: [BUDGET_EXCEEDED] reques…' was thrown

[Killed] ConditionalExpression
src/modules/budget/domain.ts:24:7
 
 /** Throws if bill amount exceeds available budget. */
 export function assertBudgetNotExceeded(available: bigint, requested: bigint): void {
-  if (requested > available) {
+  if (true) {
     throw new DomainError(
       "BUDGET_EXCEEDED",
killedBy: budget/domain — assertBudgetNotExceeded() passes when within budget
statusReason: expected [Function] to not throw an error but 'DomainError: [BUDGET_EXCEEDED] reques…' was thrown

[Killed] StringLiteral
src/modules/budget/domain.ts:26:7
 export function assertBudgetNotExceeded(available: bigint, requested: bigint): void {
   if (requested > available) {
     throw new DomainError(
-      "BUDGET_EXCEEDED",
+      "",
       `requested ${requested} paise exceeds available ${available} paise`
     );
killedBy: budget/domain — assertBudgetNotExceeded() throws BUDGET_EXCEEDED when over budget
statusReason: expected '' to be 'BUDGET_EXCEEDED' // Object.is equality

[Survived] StringLiteral
src/modules/budget/domain.ts:27:7
   if (requested > available) {
     throw new DomainError(
       "BUDGET_EXCEEDED",
-      `requested ${requested} paise exceeds available ${available} paise`
+      ``
     );
   }

[Killed] BlockStatement
src/modules/budget/domain.ts:38:68
 }
 
 /** Remaining unspent balance on a sanction. */
-export function sanctionAvailable(s: SanctionAvailability): bigint {
-  return s.amountMinor - s.utilisedMinor;
-}
+export function sanctionAvailable(s: SanctionAvailability): bigint {}
 
 export function assertSanctionNotExhausted(s: SanctionAvailability, requested: bigint): void {
killedBy: budget/domain — sanctions sanctionAvailable returns unspent
statusReason: expected undefined to be 700000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/budget/domain.ts:39:10
 
 /** Remaining unspent balance on a sanction. */
 export function sanctionAvailable(s: SanctionAvailability): bigint {
-  return s.amountMinor - s.utilisedMinor;
+  return s.amountMinor + s.utilisedMinor;
 }
 
killedBy: budget/domain — sanctions sanctionAvailable returns unspent
statusReason: expected 1300000n to be 700000n // Object.is equality

[Killed] BlockStatement
src/modules/budget/domain.ts:42:94
   return s.amountMinor - s.utilisedMinor;
 }
 
-export function assertSanctionNotExhausted(s: SanctionAvailability, requested: bigint): void {
-  const avail = sanctionAvailable(s);
-  if (requested > avail) {
-    throw new DomainError(
-      "SANCTION_EXHAUSTED",
-      `requested ${requested} paise exceeds sanction balance ${avail} paise`
-    );
-  }
-}
+export function assertSanctionNotExhausted(s: SanctionAvailability, requested: bigint): void {}
 
 /** FY must be in YYYY-YY format, e.g. 2024-25. */
killedBy: budget/domain — sanctions assertSanctionNotExhausted throws when exhausted
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/budget/domain.ts:44:7
 
 export function assertSanctionNotExhausted(s: SanctionAvailability, requested: bigint): void {
   const avail = sanctionAvailable(s);
-  if (requested > avail) {
+  if (false) {
     throw new DomainError(
       "SANCTION_EXHAUSTED",
killedBy: budget/domain — sanctions assertSanctionNotExhausted throws when exhausted
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/modules/budget/domain.ts:44:7
 
 export function assertSanctionNotExhausted(s: SanctionAvailability, requested: bigint): void {
   const avail = sanctionAvailable(s);
-  if (requested > avail) {
+  if (requested <= avail) {
     throw new DomainError(
       "SANCTION_EXHAUSTED",
killedBy: budget/domain — sanctions assertSanctionNotExhausted passes within limit
statusReason: expected [Function] to not throw an error but 'DomainError: [SANCTION_EXHAUSTED] req…' was thrown

[Killed] BlockStatement
src/modules/budget/domain.ts:53:49
 }
 
 /** FY must be in YYYY-YY format, e.g. 2024-25. */
-export function assertValidFY(fy: string): void {
-  if (!/^\d{4}-\d{2}$/.test(fy)) {
-    throw new DomainError("INVALID_FY", `fiscal year must be YYYY-YY, got '${fy}'`);
-  }
-}
+export function assertValidFY(fy: string): void {}
 
 /**
killedBy: budget/domain — assertValidFY() rejects invalid FY format
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/budget/domain.ts:54:7
 
 /** FY must be in YYYY-YY format, e.g. 2024-25. */
 export function assertValidFY(fy: string): void {
-  if (!/^\d{4}-\d{2}$/.test(fy)) {
+  if (false) {
     throw new DomainError("INVALID_FY", `fiscal year must be YYYY-YY, got '${fy}'`);
   }
killedBy: budget/domain — assertValidFY() rejects invalid FY format
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/modules/budget/domain.ts:54:7
 
 /** FY must be in YYYY-YY format, e.g. 2024-25. */
 export function assertValidFY(fy: string): void {
-  if (!/^\d{4}-\d{2}$/.test(fy)) {
+  if (/^\d{4}-\d{2}$/.test(fy)) {
     throw new DomainError("INVALID_FY", `fiscal year must be YYYY-YY, got '${fy}'`);
   }
killedBy: budget/domain — assertValidFY() accepts valid FY format
statusReason: expected [Function] to not throw an error but 'DomainError: [INVALID_FY] fiscal year…' was thrown

[Killed] BlockStatement
src/modules/budget/domain.ts:63:88
  * GFR Rule 11: Revised Estimate (reMinor) cannot exceed Budget Estimate (beMinor).
  * Release orders must be backed by sanctioned budget — prevents over-release.
  */
-export function assertReleaseWithinSanction(beMinor: bigint, newReMinor: bigint): void {
-  if (newReMinor > beMinor) {
-    throw new DomainError(
-      "GFR_RULE_11_VIOLATION",
-      `revised estimate ${newReMinor} paise exceeds budget estimate ${beMinor} paise (GFR Rule 11)`
-    );
-  }
-}
+export function assertReleaseWithinSanction(beMinor: bigint, newReMinor: bigint): void {}
 
 /**
killedBy: budget/domain — GFR Rules assertReleaseWithinSanction throws when RE > BE (Rule 11)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/budget/domain.ts:64:7
  * Release orders must be backed by sanctioned budget — prevents over-release.
  */
 export function assertReleaseWithinSanction(beMinor: bigint, newReMinor: bigint): void {
-  if (newReMinor > beMinor) {
+  if (false) {
     throw new DomainError(
       "GFR_RULE_11_VIOLATION",
killedBy: budget/domain — GFR Rules assertReleaseWithinSanction throws when RE > BE (Rule 11)
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/modules/budget/domain.ts:64:7
  * Release orders must be backed by sanctioned budget — prevents over-release.
  */
 export function assertReleaseWithinSanction(beMinor: bigint, newReMinor: bigint): void {
-  if (newReMinor > beMinor) {
+  if (newReMinor <= beMinor) {
     throw new DomainError(
       "GFR_RULE_11_VIOLATION",
killedBy: budget/domain — GFR Rules assertReleaseWithinSanction passes when RE <= BE
statusReason: expected [Function] to not throw an error but 'DomainError: [GFR_RULE_11_VIOLATION] …' was thrown

[Killed] BlockStatement
src/modules/budget/domain.ts:84:102
   reMinor: bigint;       // source head revised estimate
   utilisedMinor: bigint; // already spent/committed on the source head
 }
-export function assertReappropriationValid(source: ReappropriationSource, amountMinor: bigint): void {
-  if (amountMinor <= 0n) {
-    throw new DomainError("INVALID_AMOUNT", "re-appropriation amount must be positive");
-  }
-  const savings = source.reMinor - source.utilisedMinor;
-  if (amountMinor > savings) {
-    throw new DomainError(
-      "INSUFFICIENT_SAVINGS",
-      `re-appropriation ${amountMinor} paise exceeds source head savings ${savings} paise (GFR Rule 10: must be met from savings)`
-    );
-  }
-}
+export function assertReappropriationValid(source: ReappropriationSource, amountMinor: bigint): void {}
 
 /**
killedBy: budget/domain — GFR Rules assertReappropriationValid throws for zero/negative amount
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/budget/domain.ts:85:7
   utilisedMinor: bigint; // already spent/committed on the source head
 }
 export function assertReappropriationValid(source: ReappropriationSource, amountMinor: bigint): void {
-  if (amountMinor <= 0n) {
+  if (false) {
     throw new DomainError("INVALID_AMOUNT", "re-appropriation amount must be positive");
   }
killedBy: budget/domain — GFR Rules assertReappropriationValid throws for zero/negative amount
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/modules/budget/domain.ts:85:26
   utilisedMinor: bigint; // already spent/committed on the source head
 }
 export function assertReappropriationValid(source: ReappropriationSource, amountMinor: bigint): void {
-  if (amountMinor <= 0n) {
-    throw new DomainError("INVALID_AMOUNT", "re-appropriation amount must be positive");
-  }
+  if (amountMinor <= 0n) {}
   const savings = source.reMinor - source.utilisedMinor;
   if (amountMinor > savings) {
killedBy: budget/domain — GFR Rules assertReappropriationValid throws for zero/negative amount
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/modules/budget/domain.ts:86:45
 }
 export function assertReappropriationValid(source: ReappropriationSource, amountMinor: bigint): void {
   if (amountMinor <= 0n) {
-    throw new DomainError("INVALID_AMOUNT", "re-appropriation amount must be positive");
+    throw new DomainError("INVALID_AMOUNT", "");
   }
   const savings = source.reMinor - source.utilisedMinor;

[Killed] ArithmeticOperator
src/modules/budget/domain.ts:88:19
   if (amountMinor <= 0n) {
     throw new DomainError("INVALID_AMOUNT", "re-appropriation amount must be positive");
   }
-  const savings = source.reMinor - source.utilisedMinor;
+  const savings = source.reMinor + source.utilisedMinor;
   if (amountMinor > savings) {
     throw new DomainError(
killedBy: budget/domain — GFR Rules assertReappropriationValid throws when exceeds savings (Rule 10)
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/modules/budget/domain.ts:89:30
     throw new DomainError("INVALID_AMOUNT", "re-appropriation amount must be positive");
   }
   const savings = source.reMinor - source.utilisedMinor;
-  if (amountMinor > savings) {
-    throw new DomainError(
-      "INSUFFICIENT_SAVINGS",
-      `re-appropriation ${amountMinor} paise exceeds source head savings ${savings} paise (GFR Rule 10: must be met from savings)`
-    );
-  }
+  if (amountMinor > savings) {}
 }
 
killedBy: budget/domain — GFR Rules assertReappropriationValid throws when exceeds savings (Rule 10)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/budget/domain.ts:89:7
     throw new DomainError("INVALID_AMOUNT", "re-appropriation amount must be positive");
   }
   const savings = source.reMinor - source.utilisedMinor;
-  if (amountMinor > savings) {
+  if (false) {
     throw new DomainError(
       "INSUFFICIENT_SAVINGS",
killedBy: budget/domain — GFR Rules assertReappropriationValid throws when exceeds savings (Rule 10)
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/modules/budget/domain.ts:92:7
   if (amountMinor > savings) {
     throw new DomainError(
       "INSUFFICIENT_SAVINGS",
-      `re-appropriation ${amountMinor} paise exceeds source head savings ${savings} paise (GFR Rule 10: must be met from savings)`
+      ``
     );
   }

[Killed] BlockStatement
src/modules/budget/domain.ts:103:93
  * sanction) is rejected so a financial commitment always has two distinct
  * accountable parties (GFR maker-checker; DFPR delegation).
  */
-export function assertSanctionApproverDistinct(createdBy: string, approverId: string): void {
-  if (createdBy === approverId) {
-    throw new DomainError(
-      "MAKER_CHECKER_VIOLATION",
-      "sanction approver must differ from the officer who created it (maker-checker)"
-    );
-  }
-}
+export function assertSanctionApproverDistinct(createdBy: string, approverId: string): void {}
 
 export { assertValidPfmsHoA, assertValidDdoCode } from "../../shared/pfms.js";
killedBy: budget/domain — assertSanctionApproverDistinct() throws MAKER_CHECKER_VIOLATION for same actor
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/budget/domain.ts:104:7
  * accountable parties (GFR maker-checker; DFPR delegation).
  */
 export function assertSanctionApproverDistinct(createdBy: string, approverId: string): void {
-  if (createdBy === approverId) {
+  if (false) {
     throw new DomainError(
       "MAKER_CHECKER_VIOLATION",
killedBy: budget/domain — assertSanctionApproverDistinct() throws MAKER_CHECKER_VIOLATION for same actor
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/modules/budget/domain.ts:104:33
  * accountable parties (GFR maker-checker; DFPR delegation).
  */
 export function assertSanctionApproverDistinct(createdBy: string, approverId: string): void {
-  if (createdBy === approverId) {
-    throw new DomainError(
-      "MAKER_CHECKER_VIOLATION",
-      "sanction approver must differ from the officer who created it (maker-checker)"
-    );
-  }
+  if (createdBy === approverId) {}
 }
 
killedBy: budget/domain — assertSanctionApproverDistinct() throws MAKER_CHECKER_VIOLATION for same actor
statusReason: expected [Function] to throw an error
