[Killed] BlockStatement
src/modules/gl/domain.ts:15:67
  * Journal lines must balance: sum(debit) == sum(credit).
  * H3: paise can exceed 2^53, so balance is checked in bigint, not float.
  */
-export function assertJournalBalances(lines: JournalLine[]): void {
-  if (!lines || lines.length < 2) {
-    throw new DomainError("JOURNAL_TOO_FEW_LINES", "a journal requires at least 2 lines");
-  }
-  const totalDebit  = lines.reduce((acc, l) => acc + BigInt(l.debitMinor),  0n);
-  const totalCredit = lines.reduce((acc, l) => acc + BigInt(l.creditMinor), 0n);
-  if (totalDebit !== totalCredit) {
-    throw new DomainError(
-      "JOURNAL_UNBALANCED",
-      `journal is unbalanced: debit ${totalDebit} !== credit ${totalCredit}`
-    );
-  }
-}
+export function assertJournalBalances(lines: JournalLine[]): void {}
 
killedBy: L11 — Canary: Journal balance gate catches off-by-one CANARY: 1 paise imbalance is caught (not silently accepted)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modules/gl/domain.ts:16:7
  * H3: paise can exceed 2^53, so balance is checked in bigint, not float.
  */
 export function assertJournalBalances(lines: JournalLine[]): void {
-  if (!lines || lines.length < 2) {
+  if (false) {
     throw new DomainError("JOURNAL_TOO_FEW_LINES", "a journal requires at least 2 lines");
   }
killedBy: L11 — Canary: Journal balance gate catches off-by-one CANARY: empty lines array caught (mutation: remove length check)
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/modules/gl/domain.ts:16:17
  * H3: paise can exceed 2^53, so balance is checked in bigint, not float.
  */
 export function assertJournalBalances(lines: JournalLine[]): void {
-  if (!lines || lines.length < 2) {
+  if (!lines || lines.length >= 2) {
     throw new DomainError("JOURNAL_TOO_FEW_LINES", "a journal requires at least 2 lines");
   }
killedBy: auto-journal — generateSalesInvoiceJournal() generates balanced 3-line journal with GST
statusReason: [JOURNAL_TOO_FEW_LINES] a journal requires at least 2 lines

[Killed] ArrowFunction
src/modules/gl/domain.ts:19:36
   if (!lines || lines.length < 2) {
     throw new DomainError("JOURNAL_TOO_FEW_LINES", "a journal requires at least 2 lines");
   }
-  const totalDebit  = lines.reduce((acc, l) => acc + BigInt(l.debitMinor),  0n);
+  const totalDebit  = lines.reduce(() => undefined,  0n);
   const totalCredit = lines.reduce((acc, l) => acc + BigInt(l.creditMinor), 0n);
   if (totalDebit !== totalCredit) {
killedBy: auto-journal — generateSalesInvoiceJournal() generates balanced 3-line journal with GST
statusReason: [JOURNAL_UNBALANCED] journal is unbalanced: debit undefined !== credit 118000

[Killed] ArithmeticOperator
src/modules/gl/domain.ts:19:48
   if (!lines || lines.length < 2) {
     throw new DomainError("JOURNAL_TOO_FEW_LINES", "a journal requires at least 2 lines");
   }
-  const totalDebit  = lines.reduce((acc, l) => acc + BigInt(l.debitMinor),  0n);
+  const totalDebit  = lines.reduce((acc, l) => acc - BigInt(l.debitMinor),  0n);
   const totalCredit = lines.reduce((acc, l) => acc + BigInt(l.creditMinor), 0n);
   if (totalDebit !== totalCredit) {
killedBy: auto-journal — generateSalesInvoiceJournal() generates balanced 3-line journal with GST
statusReason: [JOURNAL_UNBALANCED] journal is unbalanced: debit -118000 !== credit 118000

[Killed] ArithmeticOperator
src/modules/gl/domain.ts:20:48
     throw new DomainError("JOURNAL_TOO_FEW_LINES", "a journal requires at least 2 lines");
   }
   const totalDebit  = lines.reduce((acc, l) => acc + BigInt(l.debitMinor),  0n);
-  const totalCredit = lines.reduce((acc, l) => acc + BigInt(l.creditMinor), 0n);
+  const totalCredit = lines.reduce((acc, l) => acc - BigInt(l.creditMinor), 0n);
   if (totalDebit !== totalCredit) {
     throw new DomainError(
killedBy: auto-journal — generateSalesInvoiceJournal() generates balanced 3-line journal with GST
statusReason: [JOURNAL_UNBALANCED] journal is unbalanced: debit 118000 !== credit -118000

[Killed] ArrowFunction
src/modules/gl/domain.ts:20:36
     throw new DomainError("JOURNAL_TOO_FEW_LINES", "a journal requires at least 2 lines");
   }
   const totalDebit  = lines.reduce((acc, l) => acc + BigInt(l.debitMinor),  0n);
-  const totalCredit = lines.reduce((acc, l) => acc + BigInt(l.creditMinor), 0n);
+  const totalCredit = lines.reduce(() => undefined, 0n);
   if (totalDebit !== totalCredit) {
     throw new DomainError(
killedBy: auto-journal — generateSalesInvoiceJournal() generates balanced 3-line journal with GST
statusReason: [JOURNAL_UNBALANCED] journal is unbalanced: debit 118000 !== credit undefined

[Killed] ConditionalExpression
src/modules/gl/domain.ts:21:7
   }
   const totalDebit  = lines.reduce((acc, l) => acc + BigInt(l.debitMinor),  0n);
   const totalCredit = lines.reduce((acc, l) => acc + BigInt(l.creditMinor), 0n);
-  if (totalDebit !== totalCredit) {
+  if (false) {
     throw new DomainError(
       "JOURNAL_UNBALANCED",
killedBy: gl/domain — assertJournalBalances() throws JOURNAL_UNBALANCED for unbalanced lines
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/modules/gl/domain.ts:21:35
   }
   const totalDebit  = lines.reduce((acc, l) => acc + BigInt(l.debitMinor),  0n);
   const totalCredit = lines.reduce((acc, l) => acc + BigInt(l.creditMinor), 0n);
-  if (totalDebit !== totalCredit) {
-    throw new DomainError(
-      "JOURNAL_UNBALANCED",
-      `journal is unbalanced: debit ${totalDebit} !== credit ${totalCredit}`
-    );
-  }
+  if (totalDebit !== totalCredit) {}
 }
 
killedBy: gl/domain — assertJournalBalances() throws JOURNAL_UNBALANCED for unbalanced lines
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/modules/gl/domain.ts:23:7
   const totalCredit = lines.reduce((acc, l) => acc + BigInt(l.creditMinor), 0n);
   if (totalDebit !== totalCredit) {
     throw new DomainError(
-      "JOURNAL_UNBALANCED",
+      "",
       `journal is unbalanced: debit ${totalDebit} !== credit ${totalCredit}`
     );
killedBy: L11 — Canary: Journal balance gate catches off-by-one CANARY: 1 paise imbalance is caught (not silently accepted)
statusReason: expected [Function] to throw error matching /JOURNAL_UNBALANCED/ but got '[] journal is unbalanced: debit 12345…'
