[Killed] ConditionalExpression
src/modules/fnf/domain.ts:101:30
   // leave-encashment (consultant / third-party / apprentice) settles zero for
   // that head. Applied before exemption/tax so nothing downstream can reinstate
   // it. Defaults to eligible, preserving pre-engagement behaviour.
-  const gratuityGrossMinor = input.eligibleForGratuity === false ? 0n : input.gratuityGrossMinor;
+  const gratuityGrossMinor = true ? 0n : input.gratuityGrossMinor;
   const leaveEncashmentGrossMinor = input.leaveEncashmentEligible === false ? 0n : input.leaveEncashmentGrossMinor;
   input = { ...input, gratuityGrossMinor, leaveEncashmentGrossMinor };
killedBy: L10 F&F — net payable equals gross less TDS gross is the sum of all settlement legs
statusReason: expected 18000000n to be 21000000n // Object.is equality

[Killed] EqualityOperator
src/modules/fnf/domain.ts:101:30
   // leave-encashment (consultant / third-party / apprentice) settles zero for
   // that head. Applied before exemption/tax so nothing downstream can reinstate
   // it. Defaults to eligible, preserving pre-engagement behaviour.
-  const gratuityGrossMinor = input.eligibleForGratuity === false ? 0n : input.gratuityGrossMinor;
+  const gratuityGrossMinor = input.eligibleForGratuity !== false ? 0n : input.gratuityGrossMinor;
   const leaveEncashmentGrossMinor = input.leaveEncashmentEligible === false ? 0n : input.leaveEncashmentGrossMinor;
   input = { ...input, gratuityGrossMinor, leaveEncashmentGrossMinor };
killedBy: L10 F&F — net payable equals gross less TDS gross is the sum of all settlement legs
statusReason: expected 18000000n to be 21000000n // Object.is equality

[Killed] EqualityOperator
src/modules/fnf/domain.ts:102:37
   // that head. Applied before exemption/tax so nothing downstream can reinstate
   // it. Defaults to eligible, preserving pre-engagement behaviour.
   const gratuityGrossMinor = input.eligibleForGratuity === false ? 0n : input.gratuityGrossMinor;
-  const leaveEncashmentGrossMinor = input.leaveEncashmentEligible === false ? 0n : input.leaveEncashmentGrossMinor;
+  const leaveEncashmentGrossMinor = input.leaveEncashmentEligible !== false ? 0n : input.leaveEncashmentGrossMinor;
   input = { ...input, gratuityGrossMinor, leaveEncashmentGrossMinor };
 
killedBy: L10 F&F — net payable equals gross less TDS gross is the sum of all settlement legs
statusReason: expected 19000000n to be 21000000n // Object.is equality

[Killed] ConditionalExpression
src/modules/fnf/domain.ts:102:37
   // that head. Applied before exemption/tax so nothing downstream can reinstate
   // it. Defaults to eligible, preserving pre-engagement behaviour.
   const gratuityGrossMinor = input.eligibleForGratuity === false ? 0n : input.gratuityGrossMinor;
-  const leaveEncashmentGrossMinor = input.leaveEncashmentEligible === false ? 0n : input.leaveEncashmentGrossMinor;
+  const leaveEncashmentGrossMinor = true ? 0n : input.leaveEncashmentGrossMinor;
   input = { ...input, gratuityGrossMinor, leaveEncashmentGrossMinor };
 
killedBy: L10 F&F — net payable equals gross less TDS gross is the sum of all settlement legs
statusReason: expected 19000000n to be 21000000n // Object.is equality

[Killed] ObjectLiteral
src/modules/fnf/domain.ts:106:54
   input = { ...input, gratuityGrossMinor, leaveEncashmentGrossMinor };
 
   // Step 1: Exemptions
-  const gratuityExemption = computeGratuityExemption({
-    actualGratuityMinor: input.gratuityGrossMinor,
-    lastDrawnWagesMinor: input.lastDrawnWagesMinor,
-    completedYears: input.completedYears,
-    employeeCategory: input.employeeCategory,
-    ceilingMinor: input.gratuityCeilingMinor,
-  });
+  const gratuityExemption = computeGratuityExemption({});
 
   const leaveEncashExemption = computeLeaveEncashExemption({
killedBy: L10 F&F — separation income adds to FY salary income taxable separation income raises annual taxable income
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ObjectLiteral
src/modules/fnf/domain.ts:125:62
     priorExemptionClaimedMinor: input.priorLeaveEncashExemptionMinor,
   });
 
-  const retrenchmentExemption = computeRetrenchmentExemption({
-    actualCompMinor: input.retrenchmentCompMinor,
-    avgMonthlyPayMinor: input.lastDrawnWagesMinor,
-    completedYears: input.completedYears,
-    separationType: input.separationType,
-    ceilingMinor: input.retrenchmentCeilingMinor,
-  });
+  const retrenchmentExemption = computeRetrenchmentExemption({});
 
   const vrsExemption = computeVrsExemption({
killedBy: computeFnfSettlement — Conservation: exempt + taxable = gross conservation holds with retrenchment separation
statusReason: expected null not to be null

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:144:5
 
   // Step 2: Total gross
   const totalGrossMinor =
-    input.noticeBuyoutMinor +
-    input.leaveEncashmentGrossMinor +
-    input.gratuityGrossMinor +
-    input.retrenchmentCompMinor +
-    input.vrsCompMinor +
+    input.noticeBuyoutMinor + input.leaveEncashmentGrossMinor + input.gratuityGrossMinor + input.retrenchmentCompMinor - input.vrsCompMinor +
     input.arrearsMinor;
 
killedBy: L10 F&F — net payable equals gross less TDS gross is the sum of all settlement legs
statusReason: expected 11000000n to be 21000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:144:5
 
   // Step 2: Total gross
   const totalGrossMinor =
-    input.noticeBuyoutMinor +
-    input.leaveEncashmentGrossMinor +
-    input.gratuityGrossMinor +
-    input.retrenchmentCompMinor +
+    input.noticeBuyoutMinor + input.leaveEncashmentGrossMinor + input.gratuityGrossMinor - input.retrenchmentCompMinor +
     input.vrsCompMinor +
     input.arrearsMinor;
killedBy: L10 F&F — net payable equals gross less TDS gross is the sum of all settlement legs
statusReason: expected 13000000n to be 21000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:153:5
 
   // Step 3: Total exempt
   const totalExemptMinor =
-    gratuityExemption.exemptMinor +
-    leaveEncashExemption.exemptMinor +
-    (retrenchmentExemption?.exemptMinor ?? 0n) +
+    gratuityExemption.exemptMinor + leaveEncashExemption.exemptMinor - (retrenchmentExemption?.exemptMinor ?? 0n) +
     (vrsExemption?.exemptMinor ?? 0n);
 
killedBy: computeFnfSettlement — Conservation: exempt + taxable = gross conservation holds with retrenchment separation
statusReason: expected 1120000000n to be 1200000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:153:5
 
   // Step 3: Total exempt
   const totalExemptMinor =
-    gratuityExemption.exemptMinor +
-    leaveEncashExemption.exemptMinor +
+    gratuityExemption.exemptMinor - leaveEncashExemption.exemptMinor +
     (retrenchmentExemption?.exemptMinor ?? 0n) +
     (vrsExemption?.exemptMinor ?? 0n);
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: expected 1000000000n to be 3000000000n // Object.is equality

[Killed] LogicalOperator
src/modules/fnf/domain.ts:155:6
   const totalExemptMinor =
     gratuityExemption.exemptMinor +
     leaveEncashExemption.exemptMinor +
-    (retrenchmentExemption?.exemptMinor ?? 0n) +
+    (retrenchmentExemption?.exemptMinor && 0n) +
     (vrsExemption?.exemptMinor ?? 0n);
 
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] OptionalChaining
src/modules/fnf/domain.ts:155:6
   const totalExemptMinor =
     gratuityExemption.exemptMinor +
     leaveEncashExemption.exemptMinor +
-    (retrenchmentExemption?.exemptMinor ?? 0n) +
+    (retrenchmentExemption.exemptMinor ?? 0n) +
     (vrsExemption?.exemptMinor ?? 0n);
 
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: Cannot read properties of null (reading 'exemptMinor')

[Killed] OptionalChaining
src/modules/fnf/domain.ts:156:6
     gratuityExemption.exemptMinor +
     leaveEncashExemption.exemptMinor +
     (retrenchmentExemption?.exemptMinor ?? 0n) +
-    (vrsExemption?.exemptMinor ?? 0n);
+    (vrsExemption.exemptMinor ?? 0n);
 
   // Step 4: Total taxable on separation
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: Cannot read properties of null (reading 'exemptMinor')

[Killed] LogicalOperator
src/modules/fnf/domain.ts:156:6
     gratuityExemption.exemptMinor +
     leaveEncashExemption.exemptMinor +
     (retrenchmentExemption?.exemptMinor ?? 0n) +
-    (vrsExemption?.exemptMinor ?? 0n);
+    (vrsExemption?.exemptMinor && 0n);
 
   // Step 4: Total taxable on separation
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:161:5
   // Step 4: Total taxable on separation
   // Notice buyout and arrears are fully taxable (salary income u/s 17(1))
   const totalTaxableOnSeparationMinor =
-    input.noticeBuyoutMinor +
-    input.arrearsMinor +
+    input.noticeBuyoutMinor - input.arrearsMinor +
     gratuityExemption.taxableMinor +
     leaveEncashExemption.taxableMinor +
killedBy: computeFnfSettlement — Private employee resigning after 3 years gratuity = 0 (ineligible), leave encashment fully taxable (resignation)
statusReason: expected 195000000n to be 205000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:161:5
   // Step 4: Total taxable on separation
   // Notice buyout and arrears are fully taxable (salary income u/s 17(1))
   const totalTaxableOnSeparationMinor =
-    input.noticeBuyoutMinor +
-    input.arrearsMinor +
-    gratuityExemption.taxableMinor +
-    leaveEncashExemption.taxableMinor +
+    input.noticeBuyoutMinor + input.arrearsMinor + gratuityExemption.taxableMinor - leaveEncashExemption.taxableMinor +
     (retrenchmentExemption?.taxableMinor ?? 0n) +
     (vrsExemption?.taxableMinor ?? 0n);
killedBy: computeFnfSettlement — Private employee resigning after 3 years gratuity = 0 (ineligible), leave encashment fully taxable (resignation)
statusReason: expected -195000000n to be 205000000n // Object.is equality

[Killed] OptionalChaining
src/modules/fnf/domain.ts:165:6
     input.arrearsMinor +
     gratuityExemption.taxableMinor +
     leaveEncashExemption.taxableMinor +
-    (retrenchmentExemption?.taxableMinor ?? 0n) +
+    (retrenchmentExemption.taxableMinor ?? 0n) +
     (vrsExemption?.taxableMinor ?? 0n);
 
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: Cannot read properties of null (reading 'taxableMinor')

[Killed] LogicalOperator
src/modules/fnf/domain.ts:165:6
     input.arrearsMinor +
     gratuityExemption.taxableMinor +
     leaveEncashExemption.taxableMinor +
-    (retrenchmentExemption?.taxableMinor ?? 0n) +
+    (retrenchmentExemption?.taxableMinor && 0n) +
     (vrsExemption?.taxableMinor ?? 0n);
 
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] LogicalOperator
src/modules/fnf/domain.ts:166:6
     gratuityExemption.taxableMinor +
     leaveEncashExemption.taxableMinor +
     (retrenchmentExemption?.taxableMinor ?? 0n) +
-    (vrsExemption?.taxableMinor ?? 0n);
+    (vrsExemption?.taxableMinor && 0n);
 
   // Step 5: Annual taxable income for the FY
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] OptionalChaining
src/modules/fnf/domain.ts:166:6
     gratuityExemption.taxableMinor +
     leaveEncashExemption.taxableMinor +
     (retrenchmentExemption?.taxableMinor ?? 0n) +
-    (vrsExemption?.taxableMinor ?? 0n);
+    (vrsExemption.taxableMinor ?? 0n);
 
   // Step 5: Annual taxable income for the FY
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: Cannot read properties of null (reading 'taxableMinor')

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:169:34
     (vrsExemption?.taxableMinor ?? 0n);
 
   // Step 5: Annual taxable income for the FY
-  const totalSalaryIncomeMinor = input.salaryYtdMinor + totalTaxableOnSeparationMinor;
+  const totalSalaryIncomeMinor = input.salaryYtdMinor - totalTaxableOnSeparationMinor;
   const stdDed = BigInt(stdDeduction(input.taxRegime, input.fyStartYear)) * 100n; // convert rupees to paise
   const chapterViA = input.taxRegime === "old"
killedBy: L10 F&F — separation income adds to FY salary income taxable separation income raises annual taxable income
statusReason: expected 42500000n to be 62500000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:170:18
 
   // Step 5: Annual taxable income for the FY
   const totalSalaryIncomeMinor = input.salaryYtdMinor + totalTaxableOnSeparationMinor;
-  const stdDed = BigInt(stdDeduction(input.taxRegime, input.fyStartYear)) * 100n; // convert rupees to paise
+  const stdDed = BigInt(stdDeduction(input.taxRegime, input.fyStartYear)) / 100n; // convert rupees to paise
   const chapterViA = input.taxRegime === "old"
     ? input.deductions80cMinor + input.deductions80dMinor + input.otherDeductionsMinor
killedBy: L10 F&F — standard deduction is converted rupees to paise new regime deducts Rs 75,000 = 7,500,000 paise
statusReason: expected 99999250n to be 92500000n // Object.is equality

[Killed] EqualityOperator
src/modules/fnf/domain.ts:171:22
   // Step 5: Annual taxable income for the FY
   const totalSalaryIncomeMinor = input.salaryYtdMinor + totalTaxableOnSeparationMinor;
   const stdDed = BigInt(stdDeduction(input.taxRegime, input.fyStartYear)) * 100n; // convert rupees to paise
-  const chapterViA = input.taxRegime === "old"
+  const chapterViA = input.taxRegime !== "old"
     ? input.deductions80cMinor + input.deductions80dMinor + input.otherDeductionsMinor
     : 0n; // New regime: no Ch VI-A deductions
killedBy: L10 F&F — Chapter VI-A deductions apply only in the old regime 80C reduces taxable income in the OLD regime
statusReason: expected 95000000n to be 80000000n // Object.is equality

[Killed] ConditionalExpression
src/modules/fnf/domain.ts:171:22
   // Step 5: Annual taxable income for the FY
   const totalSalaryIncomeMinor = input.salaryYtdMinor + totalTaxableOnSeparationMinor;
   const stdDed = BigInt(stdDeduction(input.taxRegime, input.fyStartYear)) * 100n; // convert rupees to paise
-  const chapterViA = input.taxRegime === "old"
+  const chapterViA = true
     ? input.deductions80cMinor + input.deductions80dMinor + input.otherDeductionsMinor
     : 0n; // New regime: no Ch VI-A deductions
killedBy: L10 F&F — Chapter VI-A deductions apply only in the old regime 80C is IGNORED in the NEW regime
statusReason: expected 77500000n to be 92500000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:172:7
   const totalSalaryIncomeMinor = input.salaryYtdMinor + totalTaxableOnSeparationMinor;
   const stdDed = BigInt(stdDeduction(input.taxRegime, input.fyStartYear)) * 100n; // convert rupees to paise
   const chapterViA = input.taxRegime === "old"
-    ? input.deductions80cMinor + input.deductions80dMinor + input.otherDeductionsMinor
+    ? input.deductions80cMinor - input.deductions80dMinor + input.otherDeductionsMinor
     : 0n; // New regime: no Ch VI-A deductions
 
killedBy: L10 F&F — Chapter VI-A deductions apply only in the old regime 80C, 80D and other deductions accumulate ADDITIVELY (old regime)
statusReason: expected 86000000n to be 81000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:172:7
   const totalSalaryIncomeMinor = input.salaryYtdMinor + totalTaxableOnSeparationMinor;
   const stdDed = BigInt(stdDeduction(input.taxRegime, input.fyStartYear)) * 100n; // convert rupees to paise
   const chapterViA = input.taxRegime === "old"
-    ? input.deductions80cMinor + input.deductions80dMinor + input.otherDeductionsMinor
+    ? input.deductions80cMinor + input.deductions80dMinor - input.otherDeductionsMinor
     : 0n; // New regime: no Ch VI-A deductions
 
killedBy: L10 F&F — Chapter VI-A deductions apply only in the old regime 80C, 80D and other deductions accumulate ADDITIVELY (old regime)
statusReason: expected 84000000n to be 81000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:175:28
     ? input.deductions80cMinor + input.deductions80dMinor + input.otherDeductionsMinor
     : 0n; // New regime: no Ch VI-A deductions
 
-  let annualTaxableMinor = totalSalaryIncomeMinor - stdDed - chapterViA;
+  let annualTaxableMinor = totalSalaryIncomeMinor - stdDed + chapterViA;
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
 
killedBy: L10 F&F — Chapter VI-A deductions apply only in the old regime 80C reduces taxable income in the OLD regime
statusReason: expected 110000000n to be 80000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:175:28
     ? input.deductions80cMinor + input.deductions80dMinor + input.otherDeductionsMinor
     : 0n; // New regime: no Ch VI-A deductions
 
-  let annualTaxableMinor = totalSalaryIncomeMinor - stdDed - chapterViA;
+  let annualTaxableMinor = totalSalaryIncomeMinor + stdDed - chapterViA;
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
 
killedBy: L10 F&F — standard deduction is converted rupees to paise new regime deducts Rs 75,000 = 7,500,000 paise
statusReason: expected 107500000n to be 92500000n // Object.is equality

[Killed] ConditionalExpression
src/modules/fnf/domain.ts:176:7
     : 0n; // New regime: no Ch VI-A deductions
 
   let annualTaxableMinor = totalSalaryIncomeMinor - stdDed - chapterViA;
-  if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
+  if (true) annualTaxableMinor = 0n;
 
   // Step 6: Compute annual tax (convert paise to rupees for the engine, then back)
killedBy: L10 F&F — separation income adds to FY salary income taxable separation income raises annual taxable income
statusReason: expected 0n to be 10000000n // Object.is equality

[Killed] EqualityOperator
src/modules/fnf/domain.ts:176:7
     : 0n; // New regime: no Ch VI-A deductions
 
   let annualTaxableMinor = totalSalaryIncomeMinor - stdDed - chapterViA;
-  if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
+  if (annualTaxableMinor >= 0n) annualTaxableMinor = 0n;
 
   // Step 6: Compute annual tax (convert paise to rupees for the engine, then back)
killedBy: L10 F&F — separation income adds to FY salary income taxable separation income raises annual taxable income
statusReason: expected 0n to be 10000000n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:179:36
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
 
   // Step 6: Compute annual tax (convert paise to rupees for the engine, then back)
-  const taxableRupees = Math.round(Math.max(0, Number(annualTaxableMinor) / 100) / 10) * 10; // Sec 288A rounding
+  const taxableRupees = Math.round(Math.max(0, Number(annualTaxableMinor) / 100) * 10) * 10; // Sec 288A rounding
   const taxResult = computeTax(taxableRupees, input.taxRegime, input.fyStartYear);
   const annualTaxMinor = BigInt(taxResult.totalTax) * 100n;
killedBy: L10 F&F — negative results are clamped to zero, never emitted TDS on separation clamps at 0 when YTD TDS already exceeds annual tax
statusReason: expected 2269668000n to be 0n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:179:25
   if (annualTaxableMinor < 0n) annualTaxableMinor = 0n;
 
   // Step 6: Compute annual tax (convert paise to rupees for the engine, then back)
-  const taxableRupees = Math.round(Math.max(0, Number(annualTaxableMinor) / 100) / 10) * 10; // Sec 288A rounding
+  const taxableRupees = Math.round(Math.max(0, Number(annualTaxableMinor) / 100) / 10) / 10; // Sec 288A rounding
   const taxResult = computeTax(taxableRupees, input.taxRegime, input.fyStartYear);
   const annualTaxMinor = BigInt(taxResult.totalTax) * 100n;
killedBy: L10 F&F — negative results are clamped to zero, never emitted TDS on separation is annual tax minus YTD TDS when positive
statusReason: expected 0 to be greater than 0

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:181:26
   // Step 6: Compute annual tax (convert paise to rupees for the engine, then back)
   const taxableRupees = Math.round(Math.max(0, Number(annualTaxableMinor) / 100) / 10) * 10; // Sec 288A rounding
   const taxResult = computeTax(taxableRupees, input.taxRegime, input.fyStartYear);
-  const annualTaxMinor = BigInt(taxResult.totalTax) * 100n;
+  const annualTaxMinor = BigInt(taxResult.totalTax) / 100n;
 
   // Step 7: TDS on separation = annual tax − YTD TDS
killedBy: L10 F&F — negative results are clamped to zero, never emitted TDS on separation is annual tax minus YTD TDS when positive
statusReason: expected 0n to be -98076n // Object.is equality

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:184:30
   const annualTaxMinor = BigInt(taxResult.totalTax) * 100n;
 
   // Step 7: TDS on separation = annual tax − YTD TDS
-  let tdsOnSeparationMinor = annualTaxMinor - input.tdsYtdMinor;
+  let tdsOnSeparationMinor = annualTaxMinor + input.tdsYtdMinor;
   if (tdsOnSeparationMinor < 0n) tdsOnSeparationMinor = 0n;
 
killedBy: L10 F&F — negative results are clamped to zero, never emitted TDS on separation clamps at 0 when YTD TDS already exceeds annual tax
statusReason: expected 999000000n to be 0n // Object.is equality

[Killed] EqualityOperator
src/modules/fnf/domain.ts:185:7
 
   // Step 7: TDS on separation = annual tax − YTD TDS
   let tdsOnSeparationMinor = annualTaxMinor - input.tdsYtdMinor;
-  if (tdsOnSeparationMinor < 0n) tdsOnSeparationMinor = 0n;
+  if (tdsOnSeparationMinor >= 0n) tdsOnSeparationMinor = 0n;
 
   // Step 8: Net payable = total gross − TDS deducted on F&F
killedBy: L10 F&F — negative results are clamped to zero, never emitted TDS on separation clamps at 0 when YTD TDS already exceeds annual tax
statusReason: expected -999000000n to be 0n // Object.is equality

[Killed] ConditionalExpression
src/modules/fnf/domain.ts:185:7
 
   // Step 7: TDS on separation = annual tax − YTD TDS
   let tdsOnSeparationMinor = annualTaxMinor - input.tdsYtdMinor;
-  if (tdsOnSeparationMinor < 0n) tdsOnSeparationMinor = 0n;
+  if (true) tdsOnSeparationMinor = 0n;
 
   // Step 8: Net payable = total gross − TDS deducted on F&F
killedBy: L10 F&F — negative results are clamped to zero, never emitted TDS on separation is annual tax minus YTD TDS when positive
statusReason: expected 0 to be greater than 0

[Killed] ArithmeticOperator
src/modules/fnf/domain.ts:188:27
   if (tdsOnSeparationMinor < 0n) tdsOnSeparationMinor = 0n;
 
   // Step 8: Net payable = total gross − TDS deducted on F&F
-  const netPayableMinor = totalGrossMinor - tdsOnSeparationMinor;
+  const netPayableMinor = totalGrossMinor + tdsOnSeparationMinor;
 
   return {
killedBy: computeFnfSettlement — Govt employee retiring after 30 years gratuity + leave encashment fully exempt, TDS only on notice buyout
statusReason: expected 3856073000n to be 2743927000n // Object.is equality
