[Killed] BlockStatement
src/modules/decisions/domain.ts:53:15
 export function evaluateDecisionTable(
   table: DecisionTableDef,
   context: Record<string, unknown>,
-): EvalResult {
-  const matchedIndices: number[] = [];
-
-  for (let i = 0; i < table.rules.length; i++) {
-    const rule = table.rules[i]!;
-    if (ruleMatches(rule, context)) {
-      matchedIndices.push(i);
-    }
-  }
-
-  switch (table.hitPolicy) {
-    case "first":
-      return resolveFirst(table, matchedIndices);
-    case "collect":
-      return resolveCollect(table, matchedIndices);
-    case "unique":
-      return resolveUnique(table, matchedIndices);
-  }
-}
+): EvalResult {}
 
 // ---------------------------------------------------------------------------
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] ArrayDeclaration
src/modules/decisions/domain.ts:54:36
   table: DecisionTableDef,
   context: Record<string, unknown>,
 ): EvalResult {
-  const matchedIndices: number[] = [];
+  const matchedIndices: number[] = ["Stryker was here"];
 
   for (let i = 0; i < table.rules.length; i++) {
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: Cannot read properties of undefined (reading 'outputs')

[Killed] BlockStatement
src/modules/decisions/domain.ts:56:48
 ): EvalResult {
   const matchedIndices: number[] = [];
 
-  for (let i = 0; i < table.rules.length; i++) {
-    const rule = table.rules[i]!;
-    if (ruleMatches(rule, context)) {
-      matchedIndices.push(i);
-    }
-  }
+  for (let i = 0; i < table.rules.length; i++) {}
 
   switch (table.hitPolicy) {
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:56:19
 ): EvalResult {
   const matchedIndices: number[] = [];
 
-  for (let i = 0; i < table.rules.length; i++) {
+  for (let i = 0; false; i++) {
     const rule = table.rules[i]!;
     if (ruleMatches(rule, context)) {
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:58:9
 
   for (let i = 0; i < table.rules.length; i++) {
     const rule = table.rules[i]!;
-    if (ruleMatches(rule, context)) {
+    if (true) {
       matchedIndices.push(i);
     }
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected 'CFO' to be 'Director' // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:58:37
 
   for (let i = 0; i < table.rules.length; i++) {
     const rule = table.rules[i]!;
-    if (ruleMatches(rule, context)) {
-      matchedIndices.push(i);
-    }
+    if (ruleMatches(rule, context)) {}
   }
 
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:64:5
   }
 
   switch (table.hitPolicy) {
-    case "first":
-      return resolveFirst(table, matchedIndices);
+    case "first":
     case "collect":
       return resolveCollect(table, matchedIndices);
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected 'Manager' to be 'Director' // Object.is equality

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:66:5
   switch (table.hitPolicy) {
     case "first":
       return resolveFirst(table, matchedIndices);
-    case "collect":
-      return resolveCollect(table, matchedIndices);
+    case "collect":
     case "unique":
       return resolveUnique(table, matchedIndices);
killedBy: evaluateDecisionTable — COLLECT hit policy returns all matching rules merged together
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/modules/decisions/domain.ts:66:10
   switch (table.hitPolicy) {
     case "first":
       return resolveFirst(table, matchedIndices);
-    case "collect":
+    case "":
       return resolveCollect(table, matchedIndices);
     case "unique":
killedBy: evaluateDecisionTable — COLLECT hit policy returns all matching rules merged together
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:68:5
       return resolveFirst(table, matchedIndices);
     case "collect":
       return resolveCollect(table, matchedIndices);
-    case "unique":
-      return resolveUnique(table, matchedIndices);
+    case "unique":
   }
 }
killedBy: evaluateDecisionTable — UNIQUE hit policy returns the single matching rule when exactly one matches
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] BlockStatement
src/modules/decisions/domain.ts:77:85
 // Helpers
 // ---------------------------------------------------------------------------
 
-function ruleMatches(rule: DecisionRule, context: Record<string, unknown>): boolean {
-  for (const [inputKey, condition] of Object.entries(rule.inputs)) {
-    if (!condition || condition.trim() === "") continue;
-    // Compose as "field condition" so the condition evaluator can parse it
-    const expr = `${inputKey} ${condition}`;
-    if (!evaluateCondition(expr, context)) {
-      return false;
-    }
-  }
-  return true;
-}
+function ruleMatches(rule: DecisionRule, context: Record<string, unknown>): boolean {}
 
 function buildDefaults(outputs: DecisionOutput[]): Record<string, unknown> {
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:78:68
 // ---------------------------------------------------------------------------
 
 function ruleMatches(rule: DecisionRule, context: Record<string, unknown>): boolean {
-  for (const [inputKey, condition] of Object.entries(rule.inputs)) {
-    if (!condition || condition.trim() === "") continue;
-    // Compose as "field condition" so the condition evaluator can parse it
-    const expr = `${inputKey} ${condition}`;
-    if (!evaluateCondition(expr, context)) {
-      return false;
-    }
-  }
+  for (const [inputKey, condition] of Object.entries(rule.inputs)) {}
   return true;
 }
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected 'CFO' to be 'Director' // Object.is equality

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:79:9
 
 function ruleMatches(rule: DecisionRule, context: Record<string, unknown>): boolean {
   for (const [inputKey, condition] of Object.entries(rule.inputs)) {
-    if (!condition || condition.trim() === "") continue;
+    if (true) continue;
     // Compose as "field condition" so the condition evaluator can parse it
     const expr = `${inputKey} ${condition}`;
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected 'CFO' to be 'Director' // Object.is equality

[Killed] BooleanLiteral
src/modules/decisions/domain.ts:79:9
 
 function ruleMatches(rule: DecisionRule, context: Record<string, unknown>): boolean {
   for (const [inputKey, condition] of Object.entries(rule.inputs)) {
-    if (!condition || condition.trim() === "") continue;
+    if (condition || condition.trim() === "") continue;
     // Compose as "field condition" so the condition evaluator can parse it
     const expr = `${inputKey} ${condition}`;
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected 'CFO' to be 'Director' // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:82:44
     if (!condition || condition.trim() === "") continue;
     // Compose as "field condition" so the condition evaluator can parse it
     const expr = `${inputKey} ${condition}`;
-    if (!evaluateCondition(expr, context)) {
-      return false;
-    }
+    if (!evaluateCondition(expr, context)) {}
   }
   return true;
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected 'CFO' to be 'Director' // Object.is equality

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:82:9
     if (!condition || condition.trim() === "") continue;
     // Compose as "field condition" so the condition evaluator can parse it
     const expr = `${inputKey} ${condition}`;
-    if (!evaluateCondition(expr, context)) {
+    if (true) {
       return false;
     }
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/modules/decisions/domain.ts:83:14
     // Compose as "field condition" so the condition evaluator can parse it
     const expr = `${inputKey} ${condition}`;
     if (!evaluateCondition(expr, context)) {
-      return false;
+      return true;
     }
   }
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected 'CFO' to be 'Director' // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:89:76
   return true;
 }
 
-function buildDefaults(outputs: DecisionOutput[]): Record<string, unknown> {
-  const defaults: Record<string, unknown> = {};
-  for (const out of outputs) {
-    if (out.defaultValue !== undefined) {
-      defaults[out.key] = out.defaultValue;
-    }
-  }
-  return defaults;
-}
+function buildDefaults(outputs: DecisionOutput[]): Record<string, unknown> {}
 
 function resolveFirst(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
killedBy: evaluateDecisionTable — FIRST hit policy returns defaults when no rules match
statusReason: Cannot read properties of undefined (reading 'approvalLevel')

[Killed] BlockStatement
src/modules/decisions/domain.ts:91:30
 
 function buildDefaults(outputs: DecisionOutput[]): Record<string, unknown> {
   const defaults: Record<string, unknown> = {};
-  for (const out of outputs) {
-    if (out.defaultValue !== undefined) {
-      defaults[out.key] = out.defaultValue;
-    }
-  }
+  for (const out of outputs) {}
   return defaults;
 }
killedBy: evaluateDecisionTable — FIRST hit policy returns defaults when no rules match
statusReason: expected undefined to be 'self' // Object.is equality

[Killed] EqualityOperator
src/modules/decisions/domain.ts:92:9
 function buildDefaults(outputs: DecisionOutput[]): Record<string, unknown> {
   const defaults: Record<string, unknown> = {};
   for (const out of outputs) {
-    if (out.defaultValue !== undefined) {
+    if (out.defaultValue === undefined) {
       defaults[out.key] = out.defaultValue;
     }
killedBy: evaluateDecisionTable — FIRST hit policy returns defaults when no rules match
statusReason: expected undefined to be 'self' // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:92:41
 function buildDefaults(outputs: DecisionOutput[]): Record<string, unknown> {
   const defaults: Record<string, unknown> = {};
   for (const out of outputs) {
-    if (out.defaultValue !== undefined) {
-      defaults[out.key] = out.defaultValue;
-    }
+    if (out.defaultValue !== undefined) {}
   }
   return defaults;
killedBy: evaluateDecisionTable — FIRST hit policy returns defaults when no rules match
statusReason: expected undefined to be 'self' // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:99:86
   return defaults;
 }
 
-function resolveFirst(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 0) {
-    return {
-      matched: false,
-      outputs: buildDefaults(table.outputs),
-      matchedRules: [],
-    };
-  }
-  const firstIdx = matchedIndices[0]!;
-  return {
-    matched: true,
-    outputs: { ...table.rules[firstIdx]!.outputs },
-    matchedRules: [firstIdx],
-  };
-}
+function resolveFirst(table: DecisionTableDef, matchedIndices: number[]): EvalResult {}
 
 function resolveCollect(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:100:7
 }
 
 function resolveFirst(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 0) {
+  if (true) {
     return {
       matched: false,
killedBy: evaluateDecisionTable — FIRST hit policy returns the first matching rule when multiple match
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:100:36
 }
 
 function resolveFirst(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 0) {
-    return {
-      matched: false,
-      outputs: buildDefaults(table.outputs),
-      matchedRules: [],
-    };
-  }
+  if (matchedIndices.length === 0) {}
   const firstIdx = matchedIndices[0]!;
   return {
killedBy: evaluateDecisionTable — FIRST hit policy returns defaults when no rules match
statusReason: Cannot read properties of undefined (reading 'outputs')

[Killed] ObjectLiteral
src/modules/decisions/domain.ts:101:12
 
 function resolveFirst(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
   if (matchedIndices.length === 0) {
-    return {
-      matched: false,
-      outputs: buildDefaults(table.outputs),
-      matchedRules: [],
-    };
+    return {};
   }
   const firstIdx = matchedIndices[0]!;
killedBy: evaluateDecisionTable — FIRST hit policy returns defaults when no rules match
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:115:88
   };
 }
 
-function resolveCollect(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 0) {
-    return {
-      matched: false,
-      outputs: buildDefaults(table.outputs),
-      matchedRules: [],
-    };
-  }
-  const merged: Record<string, unknown> = {};
-  for (const idx of matchedIndices) {
-    Object.assign(merged, table.rules[idx]!.outputs);
-  }
-  return {
-    matched: true,
-    outputs: merged,
-    matchedRules: matchedIndices,
-  };
-}
+function resolveCollect(table: DecisionTableDef, matchedIndices: number[]): EvalResult {}
 
 function resolveUnique(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
killedBy: evaluateDecisionTable — COLLECT hit policy returns all matching rules merged together
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:116:7
 }
 
 function resolveCollect(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 0) {
+  if (false) {
     return {
       matched: false,
killedBy: evaluateDecisionTable — COLLECT hit policy returns defaults when no rules match
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:116:36
 }
 
 function resolveCollect(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 0) {
-    return {
-      matched: false,
-      outputs: buildDefaults(table.outputs),
-      matchedRules: [],
-    };
-  }
+  if (matchedIndices.length === 0) {}
   const merged: Record<string, unknown> = {};
   for (const idx of matchedIndices) {
killedBy: evaluateDecisionTable — COLLECT hit policy returns defaults when no rules match
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:124:37
     };
   }
   const merged: Record<string, unknown> = {};
-  for (const idx of matchedIndices) {
-    Object.assign(merged, table.rules[idx]!.outputs);
-  }
+  for (const idx of matchedIndices) {}
   return {
     matched: true,
killedBy: evaluateDecisionTable — COLLECT hit policy returns all matching rules merged together
statusReason: expected undefined to be 'Director' // Object.is equality

[Killed] ObjectLiteral
src/modules/decisions/domain.ts:127:10
   for (const idx of matchedIndices) {
     Object.assign(merged, table.rules[idx]!.outputs);
   }
-  return {
-    matched: true,
-    outputs: merged,
-    matchedRules: matchedIndices,
-  };
+  return {};
 }
 
killedBy: evaluateDecisionTable — COLLECT hit policy returns all matching rules merged together
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:134:87
   };
 }
 
-function resolveUnique(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 1) {
-    const idx = matchedIndices[0]!;
-    return {
-      matched: true,
-      outputs: { ...table.rules[idx]!.outputs },
-      matchedRules: [idx],
-    };
-  }
-  if (matchedIndices.length === 0) {
-    return {
-      matched: false,
-      outputs: {},
-      matchedRules: [],
-      error: "unique: no rules matched",
-    };
-  }
-  return {
-    matched: false,
-    outputs: {},
-    matchedRules: matchedIndices,
-    error: `unique: ${matchedIndices.length} rules matched, expected exactly 1`,
-  };
-}
+function resolveUnique(table: DecisionTableDef, matchedIndices: number[]): EvalResult {}
 
killedBy: evaluateDecisionTable — UNIQUE hit policy returns the single matching rule when exactly one matches
statusReason: Cannot read properties of undefined (reading 'matched')

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:135:7
 }
 
 function resolveUnique(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 1) {
+  if (false) {
     const idx = matchedIndices[0]!;
     return {
killedBy: evaluateDecisionTable — UNIQUE hit policy returns the single matching rule when exactly one matches
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:135:36
 }
 
 function resolveUnique(table: DecisionTableDef, matchedIndices: number[]): EvalResult {
-  if (matchedIndices.length === 1) {
-    const idx = matchedIndices[0]!;
-    return {
-      matched: true,
-      outputs: { ...table.rules[idx]!.outputs },
-      matchedRules: [idx],
-    };
-  }
+  if (matchedIndices.length === 1) {}
   if (matchedIndices.length === 0) {
     return {
killedBy: evaluateDecisionTable — UNIQUE hit policy returns the single matching rule when exactly one matches
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/modules/decisions/domain.ts:143:36
       matchedRules: [idx],
     };
   }
-  if (matchedIndices.length === 0) {
-    return {
-      matched: false,
-      outputs: {},
-      matchedRules: [],
-      error: "unique: no rules matched",
-    };
-  }
+  if (matchedIndices.length === 0) {}
   return {
     matched: false,
killedBy: evaluateDecisionTable — UNIQUE hit policy returns error when no rules match
statusReason: expected 'unique: 0 rules matched, expected exa…' to contain 'no rules matched'

[Killed] ConditionalExpression
src/modules/decisions/domain.ts:143:7
       matchedRules: [idx],
     };
   }
-  if (matchedIndices.length === 0) {
+  if (false) {
     return {
       matched: false,
killedBy: evaluateDecisionTable — UNIQUE hit policy returns error when no rules match
statusReason: expected 'unique: 0 rules matched, expected exa…' to contain 'no rules matched'

[Killed] ArrayDeclaration
src/modules/decisions/domain.ts:147:21
     return {
       matched: false,
       outputs: {},
-      matchedRules: [],
+      matchedRules: ["Stryker was here"],
       error: "unique: no rules matched",
     };
killedBy: evaluateDecisionTable — UNIQUE hit policy returns error when no rules match
statusReason: expected [ 'Stryker was here' ] to deeply equal []
